{"description": "[Zero Install](https://0install.net/) is a decentralized cross-platform software-installation system available under the LGPL. It allows software developers to publish programs directly from their own web-sites, while supporting features familiar from centralized distribution repositories such as shared libraries, automatic updates and digital signatures. It is intended to complement, rather than replace, the operating system’s package management. 0install packages never interfere with those provided by the distribution.\n\nZero Install does not define a new packaging format; unmodified tarballs or zip archives can be used. Instead, it defines an XML metadata format to describe these packages and the dependencies between them. A single metadata file can be used on multiple platforms (e.g. Windows, Ubuntu, Debian, Fedora, FreeBSD and Mac OS X).\n\nZero Install also has some [interesting features](https://docs.0install.net/features/) not often found in traditional package managers. For example, while it will share libraries whenever possible, it can always install multiple versions of a package in parallel when there are conflicting requirements. Installation is always side-effect-free (each package is unpacked to its own directory and will not touch shared directories), making it ideal for use with sandboxing technologies and virtualization.", "updated": "2024-03-23T12:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/0install/2.25.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/0install/2.25.6", "licenseUrl": "https://opensource.org/licenses/lgpl-license", "packageName": "0install", "displayName": "Zero Install", "summary": "Decentralized cross-distribution software installation system", "version": "2.25.6", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/23daa374e2e649e33d1f4b3ffe2ce07cb1614cd3/icons/0install.png", "author": "Bastian Eicher", "downloadCount": 18340, "tags": ["0install", "Zero", "Install", "Package", "Manager"]}