{"description": "A feature-packed software solution that provides users with a powerful antivirus, a junk cleaner and a system booster within the same interface\n\n## Features\n\n- 360 Total Security offers your PC complete protection from Viruses, Trojans and other emerging threats.\n- Whether you are shopping online, downloading files or chatting with your friends you can be sure that 360 Total Security is there to keep you safe and your computer optimized.\n- Clean-up utility is just one click away to keep your PC in optimal condition.\n- Full Check: Quickly check the overall condition of your computers' health and safety with one click.\n- Virus Scan: Integrating award winning antivirus engines from 360 Cloud Scan Engine,360 QVMII AI Engine, Avira and Bitdefender to provide you with the ultimate in Virus detection and protection capabilities.\n- Speedup: Manage and optimize your system services, boot up items and plugins - Shorten your boot time and get going sooner!\n- Cleanup: Cleanup frees your disk space by removing junk files and plugin, which can improve system performance - With cleanup you can decide which areas and files to clean.\n- Protection: Protection offers 4 different user selectable modes - Performance/Balanced/Security and Custom. Each mode offers a different level of protection from malware, phishing attacks and backdoors.\n- Top-rated tools:  WiFi Security Check,  Sandbox,  Patch Up\n\n## Notes\n\n- The uninstall for this package **is not silent**.", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/360ts/11.0.0.1083", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/360ts/11.0.0.1083", "licenseUrl": "http://www.360totalsecurity.com/en/about.html", "packageName": "360ts", "displayName": "360 Total Security", "summary": "A feature-packed software solution that provides users with a powerful antivirus, a junk cleaner and a system booster within the same interface", "version": "11.0.0.1083", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@b92d42be38598e16e7e526b3b8b43c3220439cd4/icons/360ts.png", "author": "Qihu 360 Software", "downloadCount": 105340, "tags": ["antivirus", "security", "privacy-protection", "internet-security", "anti-keylogger", "anti-phishing", "webcam-protection", "foss", "admin"]}