{"description": "4t Tray Minimizer is a lightweight but powerful window manager, which helps you to free up space on the desktop and the taskbar via the following actions:\n\n- Minimize To Tray - any application can be minimized to the system tray.\n- Roll Up/Roll Down - you can roll up any window to its title bar.\n- Make Transparent - you can make a window semi-transparent and take a look at foreground windows.\n- Hide/Show The System Tray - hides the system tray.\n\nThe Pro version allows you to control the behavior of your favorite applications: how and when they will be minimized to tray; customize its keyboards shortcuts for launching, restoring or hiding actions; minimize them to tray at start up and more...\n\nSome benefits of the Pro version:\n\n- Would you like to hide your favorite program instead of closing, because it is loading for a long time and you don't want to wait while it will be launched next time? You can redefine the reaction to its close button click and it will be minimized to tray instead of closing. Next time it will be restored much more quickly.\n- You can define one hot key to launch, restore and hide the favorite application. When you press the hot key you don't care where your favorite application right now is: it will be launched if it was not running yet; it will be brought up if it was inactive or minimized to tray\n\nThe Free and the Pro versions let you to customize the hot keys both for the standard windows actions and for 4t Tray Minimizer actions:\n\n- Minimize All Windows hot key, Minimize Window and Maximize Window hot keys\n- Minimize To Tray hot key, Hide Window hot key, Minimize All Windows To Tray hot key, Roll Up/Roll Down hot key and more...", "updated": "2024-03-20T16:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/4t-tray-minimizer/6.07", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/4t-tray-minimizer/6.07", "licenseUrl": "http://www.4t-niagara.com/tray/license.txt", "packageName": "4t-tray-minimizer", "displayName": "4t Tray Minimizer", "summary": "4t Tray Minimizer is a lightweight but powerful window manager, which helps you to free up space on the desktop and the taskba", "version": "6.07", "icon": "https://cdn.rawgit.com/aronovgj/chocolatey/08a8155432343282ce6e49d25be125c93f1b25ac/icons/4t-tray-minimizer.png", "author": "4t Niagara Software", "downloadCount": 2727, "tags": ["minimize", "minimizer", "tray", "4t", "icon", "admin"]}