{"description": "AccessChk is a command-line tool for viewing the effective permissions on files, registry keys, services, processes,\nkernel objects, and more.\n\nAs a part of ensuring that they've created a secure environment Windows administrators often need to know what kind of\naccesses specific users or groups have to resources including files, directories, Registry keys, global objects and\nWindows services. AccessChk quickly answers these questions with an intuitive interface and output.\n\nUsage: `accesschk [-s][-e][-u][-r][-w][-n][-v]-[f <account>,...][[-a]|[-k]|[-p [-f] [-t]]|[-h][-o [-t <object type>]][-c]|[-d]] [[-l [-i]]|[username]] <file, directory, registry key, process, service, object>`\n\nParameter | Description\n:--------:|------------\n-a        | Name is a Windows account right. Specify \"*\" as the name to show all rights assigned to a user. Note that when you specify a specific right, only groups and accounts directly assigned to the right are displayed.\n-c        | Name is a Windows Service, e.g. ssdpsrv. Specify \"*\" as the name to show all services and \"scmanager\" to check the security of the Service Control Manager.\n-d        | Only process directories or top-level keys\n-e        | Only show explicitly set-Integrity Levels (Windows Vista and higher only)\n-f        | If following -p, shows full process token information including groups and privileges. Otherwise is a list of comma-separated accounts to filter from the output.\n-h        | Name is a file or printer share. Specify '*' as the name to show all shares.\n-i        | Ignore objects with only inherited ACEs when dumping full access control lists.\n-k        | Name is a Registry key, e.g. hklm\\software\n-l        | PShow full security descriptor. Add -i to ignore inherited ACEs.\n-n        | Show only objects that have no access\n-o        | Name is an object in the Object Manager namespace (default is root). To view the contents of a directory, specify the name with a trailing backslash or add -s. Add -t and an object type (e.g. section) to see only objects of a specific type.\n-p        | Name is a process name or PID, e.g. cmd.exe (specify \"*\" as the name to show all processes). Add -f to show full process token information, including groups and privileges. Add -t to show threads\n-q        | Omit Banner\n-r        | Show only objects that have read access\n-s        | Recurse\n-t        | Object type filter, e.g. \"section\"\n-u        | Suppress errors\n-v        | Verbose (includes Windows Vista Integrity Level)\n-w        | Show only objects that have write access\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@ab7733d9bd5714cac138fe9e5eec447633fb3d75/automatic/accesschk/screenshot.png)\n\n## Notes\n\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T18:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/accesschk/6.15", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/accesschk/6.15", "licenseUrl": "https://docs.microsoft.com/sysinternals/license-terms", "packageName": "accesschk", "displayName": "AccessChk - Windows Sysinternals", "summary": "Reports effective permissions for securable objects", "version": "6.15", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@024a0e31a291ceea63f7af5e63e2679403c5aa8f/icons/sysinternals.png", "author": "Mark Russinovich", "downloadCount": 11772, "tags": ["permissions", "security", "tools", "sysinternals"]}