{"description": "ACMESharp is a .NET library and PowerShell client for the ACME protocol, which is used to interopertate with the Let's Encrypt project's CA server and any other ACME-compliant server.\n        \n        This package installs the PowerShell module client to allow requesting and retrieving PKI certificates (X.509 SSL/TLS) from an ACME-compatible CA server.  If you install this package with elevated privileges, the module will be installed to the system-wide PS modules directory.  Otherwise, it will be installed to the installing user's personal PS modules directory.\n        \n        **Please Note:** This package has the following installation requirements:\n          * minimum of **Windows 2008R2**\n          * minimum of **PowerShell v3**\n          * minimum of **.NET Framework 4.5**\n        \n        ACMESharp implements an extensible provider model for various parts of its operation, including:\n        * **Vault** - handles storage of client-side state and artifacts\n        * **Challenge Types** and Challenge Handlers** - used to verify domain ownership to the CA\n        * **PKI** - handle PKI-related operations such as generating private keys and CSRs\n        * **Installers** - install issued PKI certificates to target servers\n        \n        This package includes the base ACMESharp PowerShell module and *all* official ACMESharp extension Providers which include:\n        * `manual` - DNS and HTTP Challenge Handler\n        * `iis` - HTTP Challenge Handler for local Windows IIS server\n        * `awsRoute53` - DNS Challenge Handler for AWS Route 53 service\n        * `awsS3` - HTTP Challenge Handler for AWS S3 service in combination with CloudFront front-end\n\n        This package currently includes **no automated installers**, therefore you need to manually install the generated certificates by exporting them first into an appropriate format.", "updated": "2024-03-21T12:33:27Z", "galleryUrl": "https://community.chocolatey.org/packages/acmesharp-posh-all/0.8.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/acmesharp-posh-all/0.8.1.0", "licenseUrl": "https://raw.githubusercontent.com/ebekker/ACMESharp/master/LICENSE", "packageName": "acmesharp-posh-all", "displayName": "ACMESharp PowerShell Module - ALL (Install)", "summary": "PowerShell module to talk to Let's Encrypt CA and other ACME servers (includes ALL extensions).", "version": "0.8.1.0", "icon": "https://cdn.rawgit.com/ebekker/ACMESharp/49bf6524da8239ecf258ab3857dfbbf40366ecfd/artwork/ACMESharp-logo-square64.png", "author": "ACMESharp", "downloadCount": 6868, "tags": ["pki", "ssl", "tls", "security", "certificates", "letsencrypt", "acme", "powershell", "acmesharp"]}