{"description": "### Overview\nAcrylic is a local DNS proxy for Windows which improves the performance of your computer by caching the responses coming from your DNS servers and helps you fight unwanted ads through a custom HOSTS file optimized for handling hundreds of thousands of domain names and with additional support for wildcards and regular expressions.\n\nWhen you browse a web page a portion of its loading time is dedicated to name resolution (usually from a few milliseconds to 1 second or more) while the rest is dedicated to the transfer of the web page contents and resources to your browser. What Acrylic does is to reduce the time dedicated to name resolution for frequently visited addresses closest to zero possible. It may not seem such a great optimization but in a few weeks of Internet browsing you will probably save an hour or so, which is definitely not such a bad thing. Furthermore Acrylic's sliding expiration caching mechanism, simultaneous forwarding to multiple DNS servers and support for background DNS updates are able to improve your browsing experience independently of the browser.\n\nWith Acrylic you can also gracefully overcome downtimes of your DNS servers without disrupting your work, because in that case you will at least be able to connect to your favourite websites and to your email server.\n\nAnother good thing is that Acrylic is released as open source, which means that it's free and its source code, written with Borland Delphi, is freely available to anyone under the GNU General Public License.\n\nThis Chocolatey package will install Acrylic DNS Proxy into `Program Files (x86)` and register a Windows service called `Acrylic DNS Proxy`.", "updated": "2024-03-20T20:18:26Z", "galleryUrl": "https://community.chocolatey.org/packages/acrylic-dns-proxy/2.1.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/acrylic-dns-proxy/2.1.1", "licenseUrl": "https://www.gnu.org/licenses/old-licenses/gpl-2.0.html", "packageName": "acrylic-dns-proxy", "displayName": "Acrylic DNS Proxy", "summary": "Local DNS Proxy for Windows", "version": "2.1.1", "icon": "", "author": "mrplfcucob", "downloadCount": 5730, "tags": ["Acrylic", "DNS", "Proxy"]}