{"description": "---\n\n### [choco://ad-acl-scanner](choco://ad-acl-scanner)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of AD ACL Scanner](https://cdn.staticaly.com/gh/canix1/ADACLScanner/master/src/ADACLScan6.0.png)\t\n\n\n#### Features\n\nIt has the following features:\n\n* View HTML reports of DACLs/SACLs and save it to disk.\n* Export DACLs/SACLs on Active Directory objects in a CSV format.\n* Connect and browse you default domain, schema , configuration or a naming context defined by distinguishedname.\n* Browse naming context by clicking you way around, either by OU’s or all types of objects.\n* Report only explicitly assigned DACLs/SACLs.\n* Report on OUs , OUs and Container Objects or all object types.\n* Filter DACLs/SACLs for a specific access type.. Where does “Deny” permission exists?\n* Filter DACLs/SACLs for a specific identity. Where does \"Domain\\Client Admins\" have explicit access? Or use wildcards like \"jdoe\".\n* Filter DACLs/SACLs for permission on specific object. Where are permissions set on computer objects?\n* Skip default permissions (defaultSecurityDescriptor) in report. Makes it easier to find custom permissions.\n* Report owner of object.\n* Compare previous results with the current configuration and see the differences by color scheme (Green=matching permissions, Yellow= new permissions, Red= missing permissions).\n* Report when permissions were modified\n* Can use AD replication metadata when comparing.\n* Can convert a previously created CSV file to a HTML report.\n* Effective rights, select a security principal and match it agains the permissions in AD.\n* Color coded permissions based on criticality when using effective rights scan.\n* List you domains and select one from the list.\n* Get the size of the security descriptor (bytes).\n* Rerporting on disabled inheritance .\n* Get all inherited permissions in report.\n* HTLM reports contain headers.\n* Summary of criticality for all report types.\n* Refresh Nodes by right-click container object.\n* Exclude of objects from report by matching string to distinguishedName\n* You can take a CSV file from one domain and use it for another. With replacing the old DN with the current domains you can resuse reports between domains. You can also replace the (Short domain name)Netbios name security principals.\n* Reporting on modified default security descriptors in Schema.\n* Verifying the format of the CSV files used in convert and compare functions.\n* When compairing with CSV file Nodes missing in AD will be reported as \"Node does not exist in AD\"\n* The progress bar can be disabled to gain speed in creating reports.\n* If the fist node in the CSV file used for compairing can't be connected the scan will stop.\n* Display group members in groups in the HTLM report.\n* Present the value of the true SDDL in NTsecurityDescriptor, bypassing Object-Specific ACE merge done when a new instance of the ObjectSecurity class is initialized.\n\n### System requirements\n\n* Powershell 2.0 or above\n* PowerShell using a single-threaded apartment\n* Some functions requires Microsoft .NET Framework version 4.0\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/ad-acl-scanner/readme.md)**\n\n\t\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-19T17:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/ad-acl-scanner/6.8", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ad-acl-scanner/6.8", "licenseUrl": "https://github.com/canix1/ADACLScanner/blob/master/license.md", "packageName": "ad-acl-scanner", "displayName": "AD ACL Scanner (Script)", "summary": "A tool with GUI used to create reports of access control lists (DACLs) and system access control lists (SACLs) in Active Directory .", "version": "6.8", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/mylogos/powershell_icon.png", "author": "Robin Granberg", "downloadCount": 4255, "tags": ["ad", "active", "directory", "acl", "scanner", "powershell", "server"]}