{"description": "![Screenshot of AD Tidy](http://www.cjwdev.co.uk/Software/ADTidy/ActionsList.PNG)\n\n#### Identify and clean up inactive user and computer accounts in your Active Directory domain\nSearch your Active Directory domain for user/computer accounts that are no longer in use by filtering based on last logon time, DNS record timestamp, and much more. You can then perform a number of actions on the accounts that were found - such as moving them to another OU, disabling them, setting a random password, removing them from all groups, and much more.\n\n#### Features \n* Report on both user and computer accounts \n* Search entire domain or select a specific OU \n* Multi-domain friendly - specify any domain and optionally use alternate credentials to connect to it \n* Get account last logon information from all DCs or select specific DCs (using either lastLogon attribute or lastLogonTimeStamp attribute) \n* Choose to only find accounts that have not logged on for a specified number of days \n* Confirm whether or not computer accounts are still active by using the Ping test and DNS record timestamp check\n* Powerful filtering capabilities let you filter results accounts based on name, group membership, expiration date, LDAP attribute, and more\n* Export report results to CSV or Excel XLSX file\n* Save report settings to file so that you can reload them whenever you want  or share them with colleagues\n* Option to reverse actions that were previously performed (Standard Edition only)\n* Command line support and Automated Rules allow for automation of account clean up tasks (Standard Edition only)\n\n#### For any accounts that are found in the report, you can perform one or more of the following actions:\n* Disable \n* Delete \n* Move To Another OU \n* Set Description \n* Set Expiration Date \n* Add To Group \n* Remove From Group \n* Remove From All Groups \n* Hide From Exchange Address Lists \n* Delete home drive \n* Clear LDAP Attribute Value \n* Run External Script\n* Set Random Password \n* Disable OWA \n* Set Password To Never Expire \n\nYou can also combine any of these actions into an Action Sequence to speed up common clean up tasks such as disabling accounts and moving them to another OU at the same time. Action sequences can be performed manually on any selected accounts, or by automated rules and command line scripts.\t\t\n\nPACKAGING NOTE: Uninstall through Control Panel.", "updated": "2024-03-18T14:33:36Z", "galleryUrl": "https://community.chocolatey.org/packages/ad-tidy-free/2.1.7.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ad-tidy-free/2.1.7.0", "licenseUrl": "", "packageName": "ad-tidy-free", "displayName": "AD Tidy Free Edition (Install)", "summary": "Identify and clean up inactive user and computer accounts in your Active Directory domain", "version": "2.1.7.0", "icon": "http://www.cjwdev.co.uk/images/user_zoom_72.png", "author": "Chris Wright", "downloadCount": 2714, "tags": ["cjwdev", "adtidy", "ad", "tidy", "active", "directory", "util", "utility", "admin"]}