{"description": "---\n\n### [choco://advancedrun](choco://advancedrun)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n\n![Screenshot of AdvancedRun](http://www.nirsoft.net/utils/advancedrun.png)\n\nAdvancedRun is a simple tool for Windows that allows you to run a program with different settings that you choose, including - low or high priority, start directory, main window state (Minimized/Maximized), run the program with different user or permissions, Operating system compatibility settings, and environment variables. You can also save the desired settings into a configuration file and then run the program automatically from command-line with the desired settings.\n\n### Examples of what you can do with AdvancedRun\n\n* Run the RegEdit of Windows as normal user on Windows 10/8/7/Vista, without elevation. In this mode, you'll not be able to access or modify Registry keys that require admin rights.\n* Run the RegEdit of Windows as SYSTEM user on Windows 10/8/7/Vista. In this mode, you'll be able to access the HKEY_LOCAL_MACHINE\\SECURITY key.\n* Run a program with a user of another running process.\n* Run a program in high priority.\n* Run a specific instance of program in Windows XP compatibility mode, without making global changes in the Registry.\n* Run a specific instance of program with different PATH environment string, but without modifying the PATH string of the entire system and without using batch files or command prompt window.\n* Run a program with a full set of environment variables you choose, ignoring the system environment variables completely.\n\n### System Requirements\n\nThis utility works on any version of Windows, starting from Windows XP and up to Windows 10. Both 32-bit and 64-bit systems are supported. Some of the features, like 'Run As SYSTEM User' and 'Run As user of selected process' are not supported on Windows XP.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/advancedrun/readme.md)**\n\t\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-15T18:03:36Z", "galleryUrl": "https://community.chocolatey.org/packages/advancedrun/1.51", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/advancedrun/1.51", "licenseUrl": "http://www.nirsoft.net/utils/advanced_run.html", "packageName": "advancedrun", "displayName": "AdvancedRun (Portable)", "summary": "AdvancedRun - configure and save settings for how programs run.", "version": "1.51", "icon": "http://www.nirsoft.net/utils/advancedrun_icon.png", "author": "Nir Sofer", "downloadCount": 2024, "tags": ["nirsoft", "advancedrun", "commandline", "portable", "binary"]}