{"description": "---\n\n### [choco://advanced-bat-to-exe-converter](choco://advanced-bat-to-exe-converter)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Advanced BAT to EXE Converter screenshot](https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/advanced-bat-to-exe-converter/advanced-bat-to-exe-converter_screenshot.png)\n\nAdvanced BAT to EXE Converter is the best choice to compile your Batch Files to .EXE for distributing commercially.  Advanced BAT to EXE Converter not only encrypts your code, but also creates an actual native Windows .EXE program.  These .EXE do not require any pre-installed software to function and can be digitally signed. \n\nEven the most complex batch files can be instantly converted to executables with the included Intelli-Parse technology.  This reduces development time by making sure your EXE works exactly as the original batch file does.  You can embed your Company name and Copyright information to build your online reputation.  Use the \"Include Version Info\" feature when compiling your project. \n\nAdvanced BAT to EXE Converter is the easiest and fastest way to develop and sell your own Windows apps!  There are many batch file examples that use unique extra commands included within the compiler. \n\n### .BAT to .EXE Benefits:   \n    \n* Users of your batch file scripts cannot view/change your code after it is encrypted by the compiler.\n* Any actions performed by the script can be kept secret.\n* Feature to run your scripts \"Invisible\" in the background without the batch file console window showing.\n* One of the powerful new commands can Launch any Windows program completely Invisible.\n** Executables compiled with Advanced BAT to EXE Converter will run on all Windows versions from Windows98 to Win10 64bit.**\n\nCheck out the [Frequently Asked Questions](http://www.battoexeconverter.com/#FAQ) section.\n\n### Advanced BAT to EXE Converter unique features:\n* Allows Mouse Input for your batch files\n* Built in editor.\n* Select executable icon for a professional appearance.\n* Encrypts batch file source to keep your code secret.\n* You can set EXE product version and company info properties.\n* Includes Advanced Extended Batch File Commands unavailable in normal batch files. There are many example batch files that utilize these extended commands.\n* Invisible Mode will launch the batch file completely silent. Users will not know any program was launched.\n* Embed and Encrypt additional dependency files (images, sounds, .exe)\n* Useful for creating installation packages.\n* Helps automate repetitive tasks.\n* Generated .EXE are stand-alone files that do not require any .DLL or .NET framework to run.\n* Works on all Windows 98/ME/2000/XP/2008/Vista/Win7/Win8.1/Win10 32+64bit compatible.\n* MSDOS compile option.\n\nAll of the advanced commands are available in both the FREE and PRO ($89.95) version. \t\n\nAdvanced BAT to EXE Converter has been updated often since 2003. We have spent thousands of hours developing the only batch file compiler that will work for all complex batch files. \n\nNo adware or bloatware in this free software download!\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/advanced-bat-to-exe-converter/readme.md)**\n\t\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-24T00:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/advanced-bat-to-exe-converter/4.23", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/advanced-bat-to-exe-converter/4.23", "licenseUrl": "http://www.battoexeconverter.com/buypro.html", "packageName": "advanced-bat-to-exe-converter", "displayName": "Advanced BAT to EXE Converter (Install)", "summary": "Advanced BAT to EXE Converter is the best choice to compile your Batch Files to .EXE for distributing commercially.", "version": "4.23", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/advanced-bat-to-exe-converter/advanced-bat-to-exe-converter_icon.png", "author": "Brandon Dargo", "downloadCount": 2597, "tags": ["dargo", "advanced", "bat", "exe", "converter", "programming", "dos", "command", "prompt", "batch", "binary"]}