{"description": "---\n\n### [choco://advanced-codecs](choco://advanced-codecs)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n## 64bit ADVANCED Codecs for Windows\n\t\n![Screen shot of Settings Application](https://cdn.jsdelivr.net/gh/bcurran3/ChocolateyPackages/advanced-codecs/advanced-codecs_screenshot.png)\n\n## Portable, self updating, codec solutions.\n\n\n**Installer releases have been discontinued.**\n\nInstallers are well known for putting things onto your system that you didnt want.\nTo illiminate the installer, I have created a 100%, portable, self updating, codec package.\n\n**32bit releases have been discontinued.**\n\n64bit codecs are best used for video playback when using a 64bit player.\n32bit codecs for use with video editing software are available from here.\nIf you want to take control of playback on your system, you've come to the right place.\n\n**Anything that the 'Movies & TV app' fails to play, will be able to play in WMP using my codecs.\nAll you need to do is check the box, [x] WMP suggested settings. See image below for more info.**\n\n**I have implemented an Auto-Update feature** that will allow users to update the included Settings Application and the distributed codecs directly from within the GUI without the need to download full codec releases. This new feature will be controlled by the existing checkbox on the Help tab and run solely off of my own servers.\nDonations to assist with hosting fees are appreciated, Thank you.\n\n**The Save and Restore settings feature** is automated and also controlled by the commandline.\nTo have your settings restored automatically during an upgrade, all you need to do is [Save ALL Settings]\nThe checkboxes involved are correctly set by default to allow automatic upgrade settings restoration.\n\n**Recently,** there has been a major re-write of the GUI itself and the filters they control. Support for MKV on the xbox360 was dropped along with the removal of several deprecated codecs and the SetACL dependency.\nI hope you enjoy these new releases and can find the time to send a small donation in support of continued maintenance into the future.\n\n**Top 10 features of the recent Settings Application rewrite:**\n\n1. Remove all unnecessary code associated with the deprecated codec removal\n2. Re-organize the entire layout to be more intuitive, user friendly and visually appealing\n3. Allow the user to click anywhere on the App to relocate the Settings Application on the screen\n4. Add an Always On Top feature to keep the Settings Application in view\n5. Activate the previous instance ot the Settings Application when trying to open a new instance\n6. Require Administrative privileges upon startup eliminating the need to rightclick\n7. Current codec setup can be propagated to All user accounts with the click of a button.\n8. Colorize and capitalize important functions to promote their significance\n9. Automatically resize the App relative to the display resolution and use high quality text\n10. Add a Save | Restore settings feature to seamlessly return to a previous setup\nAll functions are performed instantaneously. The moment you select something, the action is performed.\nIf you ever find yourself broken, simply press the [RESET ALL] button to return to a just installed state.\n**BONUS** Simple commandline features and a builtin, intelligent, Auto Update feature.\n\n[SETUP AND USAGE](https://shark007.net/forum/Thread-Setup-and-usage)\n\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/advanced-codecs/readme.md)**\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-22T19:19:16Z", "galleryUrl": "https://community.chocolatey.org/packages/advanced-codecs/18.2.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/advanced-codecs/18.2.3", "licenseUrl": "https://shark007.net/disclaimer.html", "packageName": "advanced-codecs", "displayName": "Shark007's 64bit ADVANCED Codecs (Portable)", "summary": "64bit ADVANCED Codecs for Windows is an audio and video codec package which contains a full suite of all the best codecs available.", "version": "18.2.3", "icon": "https://cdn.jsdelivr.net/gh/bcurran3/ChocolateyPackages/advanced-codecs/advanced-codecs_icon.png", "author": "Shark007", "downloadCount": 73609, "tags": ["shark007", "codecs", "codec", "audio", "video", "multimedia", "ffdshow", "ffmpeg", "icaros", "lav", "amr", "mpc", "ofr", "divx", "mka", "ape", "flac", "evo", "flv", "m4b", "mkv", "ogg", "ogv", "ogm", "rmvb", "h264", "h265", "avi", "wmv", "rm", "mpg", "mp4", "xvid", "y4m", "binary", "embedded"]}