{"description": "# Advanced Renamer\n\n![](https://cdn.jsdelivr.net/gh/aeliussaionji/chocopkgs@9e1debf09c54740f5ee9bcda8cf8be6f0f9894c4/icons/advanced-renamer-screenshot.png)\n\nAdvanced Renamer is a program for renaming multiple files and folders at once. By configuring renaming methods the names can be manipulated in various ways.\n\nIt is easy to set up a batch job using multiple methods on a large amount of files. The 14 different methods enables you to change the names, attributes, and timestamps of files in one go. The files can also be copied or moved to new locations based on information in the files.\n\nWith Advanced Renamer you can construct new file names by adding, removing, replacing, changing case, or giving the file a brand new name based on known information about the file.\n\nBefore performing the operations on the files you can verify that the output will be correct and if you perform the rename and regret it, you can undo the complete batch.\n\n## Image files\nThis mass file renamer is a great utility for organising digital pictures for both professionals and beginners. The thumbnail mode lets you display thumbnails directly in the file list giving you maximum control of the renaming process. With this program you can rename all your photos in a snap.\n\n## GPS data\nIf your image files contain GPS data you can add the name of the city and the country where the picture was taken. Coordinates are used to lookup city, country, and state names from a database containing more than 100,000 cities around the globe.\n\n## Music files\nMP3 and other music files often have messed up names and contain weird characters. With Advanced Renamer you can change the names of your favourite music files to more suitable names using the built-in ID3 functions.\n\n## Video files\nEver wanted to add the codec or the resolution of a video to the filename? With the video tags you can add various information about video and audio content to the names.\n\n## TV shows\nAdd episode title or airdate to video files containing TV Shows after importing show information from the tvmaze.com website.", "updated": "2024-03-23T21:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/advanced-renamer/3.94.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/advanced-renamer/3.94.3", "licenseUrl": "https://www.advancedrenamer.com/user_guide/license", "packageName": "advanced-renamer", "displayName": "Advanced Renamer", "summary": "Batch file renaming utility for Windows.", "version": "3.94.3", "icon": "https://cdn.rawgit.com/AeliusSaionji/chocopkgs/fad605e78a28a3a84f3abf5e38b0601fe7a32d90/icons/advanced-renamer.png", "author": "Kim Jensen", "downloadCount": 22248, "tags": ["advanced-renamer"]}