{"description": "AirDroid is a free and fast Android device manager app that allows you to access Android phone/tablet from computer remotely and securely. Manage SMS, files, photos and videos, WhatsApp, Line, WeChat and more on computer.\n\n## Features\n- SMS: send and receive individual or group messages.\n- Files: transfer files between Android and computer from any network.\n- Notification Mirror: Mirror phone notifications from any allowed apps to computer.\n- AirMirror: Complete control of Android, and use any apps, like WhatsApp, WeChat and Line.\n\n- Contacts: View and edit all the contacts.\n- Photos: Transfer photos between Android and computer.\n- Music and Videos: Play and manage music and videos on Android and transfer them between Android and computer.\n- Ringtones: Set music as ringtone and export ringtones.\n- Screenshot: View the real time screen of Android devices, take static screenshots. (requires root)\n- Apps: Import and export .apk files.\n- Camera: See through the lens of both front and back cameras.\n- URL: Push url to Android and open it with default web browser.\n- Clipboard: Share clipboard content between Android and computer.\n\n### Package Parameters\nThe following package parameter can be set:\n\n* `-ia /D=` - this is for the installation path. (e.g. with cmd: `choco install airdroid -ia /D=\"E:\\Some Directory\\somebody\\airdroid\"`)\n\n**Please Note**: This is an automatically updated package. If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T16:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/airdroid/3.7.1.300", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/airdroid/3.7.1.300", "licenseUrl": "https://www.airdroid.com/en/legal/eula.html", "packageName": "airdroid", "displayName": "Airdroid", "summary": "Access Android phone/tablet from computer remotely and securely. Manage SMS, files, photos and videos, WhatsApp, Line, WeChat and more on computer.", "version": "3.7.1.300", "icon": "https://cdn.jsdelivr.net/gh/olafhaag/chocolatey-packages@master/automatic/airdroid/airdroid.png", "author": "Sand Studio", "downloadCount": 19105, "tags": ["airdroid", "android", "phone", "remote", "admin"]}