{"description": "# Airtest IDE (Portable)\n### About \n* **Airtest** - is an Cross-Platform UI Automation Framework for Games and Apps.\n* **AirtestIDE** - is an out of the box GUI tool that helps to create and run cases in a user-friendly way. AirtestIDE supports a complete automation workflow: `create, run, report`.\n# Features\n*   **Write Once, Run Anywhere:** Airtest provides cross-platform APIs, including app installation, simulated input, assertion and so forth. Airtest uses image recognition technology to locate UI elements so that you can automate games and apps without injecting any code. \n*   **Fully Scalable:** Airtest cases can be easily run on large device farms, using commandline or python API. HTML reports with detailed info and screen recording allow you to quickly locate failure points. NetEase builds Airlab on top of the Airtest Project.\n*   **Poco:** Poco adds the ability to directly access object(UI widget) hierarchy across the major platforms and game engines. It allows writing instructions in Python, to achieve more advanced automation.\n## Game Test\nWith image recognition and UI hierarchy, our automation framework support game testing.\n- Supports all game engines and apps\n- Multiplatform\n- Easy to use\n## Android native apps\nIn Android native apps testing process, Airtest can play a siginificant role - plug-and-play.\n## Windows applications\nSupport for Windows applications, write one code and run the it across the platforms.\n## iOS Support\nWith poco, Airtest can access iOS native element and find out their location and attributes, which make iOS testing process easy and convenient.\n## Selenium Plugin\nBase on Chrome Devtools Protocol, record and generate selenium scripts, accurately access web element.\n# Documentation\nYou can find the complete Airtest documentation on readthedocs.", "updated": "2024-03-24T01:18:29Z", "galleryUrl": "https://community.chocolatey.org/packages/airtest-ide/1.2.15.20230405", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/airtest-ide/1.2.15.20230405", "licenseUrl": "https://github.com/AirtestProject/Airtest/blob/master/LICENSE", "packageName": "airtest-ide", "displayName": "Airtest IDE (Portable)", "summary": "Cross platform UI automation IDE", "version": "1.2.15.20230405", "icon": "https://rawcdn.githack.com/EpicMorg/chocolatey/fa6b2288d40bb748eef08ab9b67fd9fb588fec3e/.github/airtest-ide/icons/airtest_128.png", "author": "NetEase Inc", "downloadCount": 1563, "tags": ["airtest-ide", "airtest", "ide", "poco", "pocoui", "poco-ui", "selenium", "automatisation", "test", "python"]}