{"description": "AllDup is a freeware tool for searching and removing file duplicates on your computer. The fast search algorithm find duplicates of any file type, e. g. text, pictures, music or movies. The powerful search engine enables you to find duplicates with a combination of the following criteria: File Name, File Extension, File Size, File Content, Last Modified Date, Create Date, File Attributes and Hard Links\n\n\n## Features\n\n- Entire folders or individual files can be excluded from the search by masks or size conditions\n- Save and restore the search result for continue working later\n- Search for duplicates of digital photo files\n- Search for hard links\n- Many flexible options helps you to select unnecessary duplicates automatically\n- Search is performed in multiple specified folders, drives, media storages, CD/DVDs...\n- Create shortcuts or hardlinks to the last original file\n- Ignore the ID3 tags of MP3 files\n- Search for duplicates of music and video files\n- Find duplicates with a combination of the following criteria: file content, file name, file extension, file dates and file attributes!\n- For your safety all files that have to be deleted can be moved to the Recycle Bin or a separate backup folder\n- Search for duplicates of executable and any other files\n- List non-duplicate files\n- Export the search result to TXT or CSV file\n- Detailed log file about all actions\n- The built-in file viewer allows you to preview many different file formats and analyze the content of the file before deciding what to do with it\n- The unnecessary duplicates can be deleted permanently or copied/moved to a folder of your choice\n- Search through an unlimited number of files and folders\n- Convenient search result list\n- Fast search algorithm\n\n![screenshot](https://cdn.rawgit.com/chocolatey/chocolatey-coreteampackages/master/automatic/alldup/screenshot.png)", "updated": "2024-03-23T06:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/alldup/4.4.56", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/alldup/4.4.56", "licenseUrl": "http://www.alldup.de/alldup_help/alldup.htm", "packageName": "alldup", "displayName": "AllDup", "summary": "Tool for searching and removing file duplicates", "version": "4.4.56", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-coreteampackages@edba4a5849ff756e767cba86641bea97ff5721fe/icons/alldup.png", "author": "Michael Thummerer Software Design", "downloadCount": 38433, "tags": ["alldup", "find", "delete", "files", "duplicates", "freeware", "admin"]}