{"description": "The point of this program is to make adding/removing programs to/from your Windows firewall easier than ever.\n\nThis program will add a right click option to all .exe and .com programs, allowing you to allow, block or remove a program from the Windows firewall in 1 click.\n\nBut as the rest of my programs I have gone an extra step, \"Shane\" style if you will :-D\n\nWhen you add a program to the firewall, all rules that have the same file path will be removed first and then a new single rule is added.\nThis can greatly help when a user has multiple different rules for a program and they don't realize it.\nA lot of times those rules can conflict and create problems.\nNow all those extra rules are removed during the process.\n\nAlso when you allow a program through the firewall the settings in the rule are to allow any protocol, any port and allow edge transport.\nBasically the settings in the rule are to let the program be fully allowed through.\n\nAside from allowing programs through you can also block them if need be.\nSame thing happens, all current rules that point to the same program are removed and a single new rule is added that blocks the program on every protocol and every port.\n\nAnd just for those users who like to keep things clean, there is also an option to remove all rules for a program from the firewall.\nNice feature to have when you are uninstalling a game or program and don't want the rules in the firewall any more.\n\nAll 3 of these options are just 1 click.\n\nYou can also select multiple .exe and .com files at once to make things even faster. All done through Windows Explorer.\n\n\nHow TO INSTALL:\n\nExtract all files from the zip folder. Make sure to save them in a folder that wont be moved or deleted. (Chocolatey will do this for you.)\n\nOnce extracted run the Right_Click_Options.exe in the extracted folder and then in that program click on \"Add Right Click Menu\".\n\nThat's it! That will add the right click menu options to all .exe and .com files. Nothing is installed or written anywhere else.\n\nTo uninstall just run Right_Click_Options.exe again and click \"Remove Right Click Menu\" and then simply delete all the files in the program folder.\n\nIf for any reason you move the files to a new folder you need to run the \"Add Right Click Menu\" option again so the registry keys will be updated with the new file paths.", "updated": "2024-03-20T08:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/allow-block-remove-firewall/1.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/allow-block-remove-firewall/1.0.0", "licenseUrl": "http://www.tweaking.com/core/termsofuse/index.html", "packageName": "allow-block-remove-firewall", "displayName": "Tweaking.com - (Right Click) Allow, Block or Remove - Windows Firewall (Portable)", "summary": "A program to easily add, block, or remove programs in Windows Firewall.", "version": "1.0.0", "icon": "", "author": "Tweaking.com", "downloadCount": 1801, "tags": ["tweaking.com", "windows", "firewall", "util", "utility"]}