{"description": "Altcopy is a free program that allows you to copy/paste between a Windows PC and a smart device (e.g., phone).\n\n## Features\n\n### Instant two-way copying\nCopy text from your PC to your Smart device's clipboard, and Paste text from your device's clipboard to your PC, instantly! All you need is the PC application, and the Android application on your device. No sign-in required! Click here to see how the initial sync works.\n\n### Over any network\nText can be copied over any network. As long as your PC and Smart device both have internet connections, you're good to go. Alt-C uses Google Cloud Messaging with SSL connections to copy the text. \nAlt-C\n\n### From any application\nText is copied from your PC to your device, or from your device to your PC, with the simple press of a Global Hotkey. On your PC - Select the text in any application, press the Copy Hotkey, and it arrives in your device's clipboard - ready to be pasted! On your Smart Device - copy some text and press the Paste Hotkey on your PC to paste the text!\n\n### Auto Launch Applications\nConfigure Alt-C to open specific types of text in various applications. Open URLs in your Web Browser, Email addresses in your email app, GPS co-ordinates in your Maps app, Phone Numbers in the Dialer and Text in your favourite note taking application. Configure your Alt-C Auto Launch experience under Settings! \n(ALL Text is parsed on the device itself)\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/altcopy/screenshot.png)", "updated": "2024-03-21T12:03:39Z", "galleryUrl": "https://community.chocolatey.org/packages/altcopy/1.0.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/altcopy/1.0.7", "licenseUrl": "http://canobakedbeans.co.za/terms.html", "packageName": "altcopy", "displayName": "Alt-C", "summary": "Two-way text copying between your PC and Smart devices", "version": "1.0.7", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/altcopy/altcopy.png", "author": "Can O' Baked Beans Creations", "downloadCount": 654, "tags": ["altcopy", "two-way", "test", "copy", "pc", "smart", "device", "smartphone", "tablet"]}