{"description": "___\n[choco://amazondrive](choco://amazondrive)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n___\n\n(Now Amazon Photos)\n\n###About Amazon Photos for Desktop\n\nAmazon Photos for Desktop lets you back up, upload, download, and sync files on your computer without connecting to the Amazon Photos website.\n\nThe Amazon Photos for Desktop application is compatible with:\n\nMac computers running Mac OS X 10.10 and higher\nWindows computers running Windows 7 and higher\n\n**Backup**\n\nThe Backup feature automatically uploads selected folders containing photos, videos, or files, and creates an alternate copy online. Set the folder of your choice to automatically upload its files to Amazon Photos—either continuously or at a scheduled time you choose. To free up space on your computer, use the Backup feature and then delete the files on your computer. The online copies are still available to view or edit online.\n\nWith Amazon Photos for Desktop, you can also manually upload, download, and sync files between your computer and your Amazon Photos account.\n\n**Sync**\n\nSync works by creating an \"Amazon Drive\" folder on your computer. Using drag-and-drop, you then upload files to Amazon Photos or download them from Amazon Photos to your computer without opening the full website. You can also use the application to synchronize the \"Amazon Drive\" folder on your computer or selected folders in your Amazon Photos account.\n\n**Note:** Amazon Photos for Desktop allows you to upload large files, including files larger than 2 GB in size. You can upload individual files up to 48.82 GB in size. In certain cases, the maximum file upload size may be lower than 48.82 GB due to limitations outside of our service. This includes limitations with your computer's web browser settings or specifications.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/amazondrive/readme.md)**\n\t\n\n___\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n___", "updated": "2024-03-23T09:18:55Z", "galleryUrl": "https://community.chocolatey.org/packages/amazondrive/5.6.0.102", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/amazondrive/5.6.0.102", "licenseUrl": "https://www.amazon.com/gp/help/customer/display.html/?nodeId=201376540", "packageName": "amazondrive", "displayName": "Amazon Photos (Install)", "summary": "Unlimited Secure Storage from Amazon", "version": "5.6.0.102", "icon": "https://images-na.ssl-images-amazon.com/images/G/01/digital/adrive/images/drive_logo.png", "author": "Amazon.com", "downloadCount": 6596, "tags": ["amazon", "amazondrive", "amazonclouddrive", "cloud", "drive"]}