{"description": "---\n\n### [choco://amazon-music](choco://amazon-music)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n#### With the Amazon Music app, you can play and download your music, export downloads to iTunes and Windows Media Player, shop the Amazon Digital Music Store, and access Prime Music (if you're an eligible Prime member).\n\n# music\n\n* Any way you want it.\n* Amazon Music Unlimited: Stream tens of millions of songs, including new releases from today's most popular artists.\n* Prime Music: A growing selection of 2 million songs included with your Amazon Prime membership.\n* Play music on all your favorite devices and download to play offline.\n\n* Lets you play, manage and download all your music with ease and convenience.\n* With Prime Music, members can enjoy a growing selection of two million songs, playlists, and stations - always ad-free and included with your Prime membership.\n* With Amazon Music Unlimited – unlock even more. Listen to tens of millions of songs with weekly new releases.\n* Amazon Music for PC is fast. It'll get you from launch to play in seconds.\n* Amazon Music for PC detects and adds new music to your library even if you bought it from iTunes or ripped a CD. Your music library will always be organized and up-to-date.\n* System Requirements: Windows 7 and later\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/amazon-music/readme.md)**\n\t\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-23T17:03:29Z", "galleryUrl": "https://community.chocolatey.org/packages/amazon-music/7.13.0.2210", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/amazon-music/7.13.0.2210", "licenseUrl": "https://goo.gl/p9o41Q", "packageName": "amazon-music", "displayName": "Amazon Music (Install)", "summary": "Amazon Music for PC and Mac is a free desktop application you can use to play, download, and manage your digital music directly on your computer.", "version": "7.13.0.2210", "icon": "https://images-na.ssl-images-amazon.com/images/I/71VdVNOOaZL._SX425_.png", "author": "Amazon Digital Services LLC", "downloadCount": 40713, "tags": ["amazon", "music", "streaming", "player"]}