{"description": "![Screenshot of AMIDuOS](http://download.amiduos.com/web/kb/activation-trial-days-message.png)\n\n###Try AMIDuOS for free for 30 days! Buy it for only US$ 15 (PRO - Lollipop/Jellybean)\n\n##Introducing AMIDuOS\nAMIDuOS is a revolutionary new concept that brings the functionality, depth and fun of the Android experience to Microsoft® Windows devices. It runs on nearly any Windows 7,8 or 10 PC or tablet device for fast, easy switching between Windows and Android environments - without the need to dual boot!\n\n##Features\n###Full Android Experience\nAMIDuOS is nothing less than the full Android experience, with all the features that the latest version of the popular mobile operating system has to offer. It runs fast, looks crisp and sharp and performs with no limitations – because it is 100% native Android running on your Windows hardware!\n\n###Application Compatibility\nAMIDuOS can run nearly all of the Android applications available in Android app markets. To get you started, it comes with preloaded Amazon Appstore. To make AMIDuOS your own, simply add your favorite Android app markets with the AMIDuOS package installer. AMIDuOS is also ARM v7 compatible, so it can run most popular ARM applications as well.\n\n###Performance\nAMIDuOS supports 3D acceleration, so you can enjoy a superior Android gaming experience in Windows. It uses Windows OpenGL drivers for improved frame rates to support even the most graphics-intensive games. Applications run mainly in the native x86-mode to provide peak performance, while ARM emulation is only performed on as-needed basis. This helps AMIDuOS to save power and extend battery life to the fullest.\n\n###Device Support\nWhile AMIDuOS leverages device drivers from Windows™ to enable near-native performance in Android, it also supports key peripherals and sensors of the Windows hardware, including high-definition cameras, audio and microphone. Sensor support includes Ambient Light, Accelerometer, Gyrometer, Compass and Orientation - giving you the full Android tablet/mobile experience.\n\n###Tablet Features\nAMIDuOS provides a complete Android tablet experience with multitouch and gesture support like Pinch and Zoom, along with a full-featured software keyboard. It also supports Compass and GPS functionality, allowing map navigation by multitouch.\n\n###Desktop Features\nIn Desktop mode AMIDuOS offers full hardware keyboard support, including keyboard shortcuts. The screen orientation can be changed to portrait mode for applications that require it. AMIDuOS also supports Ethernet and simulated WiFi to provide network access for Android applications.\n\n###Storage and File Sharing\nFile sharing between Windows and Android is also supported in AMIDuOS, so you can share pictures, videos and music between both OS modes with ease. AMIDuOS also supports SD card emulation and allows you to configure the SD card size with an easy-to-use configuration tool.", "updated": "2024-03-21T02:03:51Z", "galleryUrl": "https://community.chocolatey.org/packages/amiduos/2.0.8.8511", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/amiduos/2.0.8.8511", "licenseUrl": "", "packageName": "amiduos", "displayName": "AMIDuOS PRO (Lollipop) (Trial) (Install)", "summary": "Run Android Apps in Windows 7/8/10 with AMIDuOS", "version": "2.0.8.8511", "icon": "http://amiduos.com/images/logo-navbar.png", "author": "American Megatrends Inc", "downloadCount": 1241, "tags": ["amiduos", "duos", "android", "emulator", "admin"]}