{"description": "The Native Development Kit (NDK) is a set of tools that allows you to use C and C++ code with Android, and provides platform libraries you can use to manage native activities and access physical device components, such as sensors and touch input. The NDK may not be appropriate for most novice Android programmers who need to use only Java code and framework APIs to develop their apps. However, the NDK can be useful for cases in which you need to do one or more of the following:\n\n* Squeeze extra performance out of a device to achieve low latency or run computationally intensive applications, such as games or physics simulations.\n* Reuse your own or other developers' C or C++ libraries.\n\n**Please Note:** Due to the way Google versions their android-ndk package, it is not compatible with the NuGet spec. So to get around it, I've replaced the letter variant to a dot number notation.\nExamples:\n* `r19` is equivalent to 19.0\n* `r19c` is equivalent to 19.3\n\n### Package Specific\n#### Package Parameters\nThe following package parameters can be set:\n\n* `/InstallationPath:` - Where to install the package to - defaults to \"`$env:SystemDrive\\Android\\`\"\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install packageID [other options] --params=\"'/ITEM:value /ITEM2:value2 /FLAG_BOOLEAN'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.", "updated": "2024-03-21T10:48:29Z", "galleryUrl": "https://community.chocolatey.org/packages/android-ndk/25.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/android-ndk/25.2", "licenseUrl": "https://developer.android.com/license", "packageName": "android-ndk", "displayName": "Android NDK (Install)", "summary": "The Android NDK is a toolset that lets you implement parts of your app in native code, using languages such as C and C++.", "version": "25.2", "icon": "https://cdn.jsdelivr.net/gh/ripclawffb/chocolatey-android-ndk@master/android-ndk.png", "author": "Google", "downloadCount": 11574, "tags": ["android-ndk", "android", "ndk", "google"]}