{"description": "Apache Ant is a Java library and command-line tool whose mission is to drive processes described in build files as targets and extension points dependent upon each other. The main known usage of Ant is the build of Java applications. Ant supplies a number of built-in tasks allowing to compile, assemble, test and run Java applications. Ant can also be used effectively to build non Java applications, for instance C or C++ applications. More generally, Ant can be used to pilot any type of process which can be described in terms of targets and tasks.\n\nAnt is written in Java. Users of Ant can develop their own \"antlibs\" containing Ant tasks and types, and are offered a large number of ready-made commercial or open-source \"antlibs\".\n\nAnt is extremely flexible and does not impose coding conventions or directory layouts to the Java projects which adopt it as a build tool.\n\nSoftware development projects looking for a solution combining build tool and dependency management can use Ant in combination with Apache Ivy.\n\nThe Apache Ant project is part of the [Apache Software Foundation](https://www.apache.org/).\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@170f8cefaff042f0fb37731acc25ce804e878d88/automatic/ant/screenshot.png)\n\n## Package Parameters\n\n* `/User` - override the default behaviour and set the `ANT_HOME` environment variable for the current user only\n  e.g. `choco install -y ant --package-parameters=\"/User\"`\n\nTo have Chocolatey remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n## Notes\n\n* Ant requires a supported version of Java to be installed and available on the path at runtime.  A minimum of Java 8 is required.\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/ant/1.10.14", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ant/1.10.14", "licenseUrl": "https://www.apache.org/licenses/LICENSE-2.0.html", "packageName": "ant", "displayName": "Apache Ant", "summary": "Apache Ant is a Java library and command-line tool whose mission is to drive processes described in build files as targets and extension points dependent upon each other", "version": "1.10.14", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@170f8cefaff042f0fb37731acc25ce804e878d88/icons/ant.png", "author": "Apache", "downloadCount": 338004, "tags": ["ant", "build", "build-management", "script", "build-script", "java", "xml", "apache"]}