{"description": "Any Video Converter – Best free video converter for converting videos between any formats freely!\n\n__All-in-One Free Video Converter__\n\nThere is open source software to perform almost every task for video conversion. But if you are one of these windows users who are looking for an All-in-One video converting tool with easy-to-use graphical interface, Any Video Converter Freeware provides just that, allowing you to effortlessly convert video files for FREE!\n\n__Free Video to Video Converter__\n\nWhether you are looking for free AVI video converter, free mxf converter, free MKV video converter, free FLV video converter, free MP4 converter, free iPad converter, free Android converter, or free YouTube converter, Any Video Converter Freeware is the right application for you. Download the free video converter now to convert videos and experience better digital life.\n\n__Excellent HTML5 Video Converter__\n\nHTML5 is the fastest growing web development trend and HTML5 video as a part of HTML5 becomes the new natural way to show video online. Free Any Video Converter can easily encode and create the HTML5 video online for watching videos on all browsers or sharing videos. With this HTML5 Video Converter, you can perfectly convert videos to HTML5 videos with embedding code and HTML page for modern browsers like IE9, Firefox, Chrome, Safari, Opera and more. Learn more details from how to convert video to WebM, OGG and MP4.\n\n__Free Video to Audio Converter__\n\nAny Video Converter Freeware is also a free video to audio converter that can extract audio from video, like convert MP4 to MP3, convert MPEG to M4A, convert AVI to MP3, convert WMV to WMA, convert MOV to AAC, convert WebM(V8) video to MP3, and VOB to MP3.\n\n__Free YouTube Video Downloader__\n\nThis free YouTube Downloader lets you download videos from YouTube and save them as MP3, MP4, WMV, MPEG, MKV, WebM, ASF, M2TS, DVD and other formats.", "updated": "2024-03-23T21:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/anyvideoconverter/6.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/anyvideoconverter/6.0.0", "licenseUrl": "", "packageName": "anyvideoconverter", "displayName": "Any Video Converter Free Edition", "summary": "Any Video Converter – Best free video converter for converting videos between any formats freely!", "version": "6.0.0", "icon": "https://cdn.rawgit.com/ferventcoder/chocolatey-packages/02c21bebe5abb495a56747cbb9b4b5415c933fc0/icons/anyvideoconverter.png", "author": "AnvSoft Co,  Ltd.", "downloadCount": 25187, "tags": ["anyvideoconverter", "video", "conversion", "converter", "avi", "flv", "mov", "mp4", "mpg", "admin"]}