{"description": "ArgyllCMS is an ICC compatible color management system, available\nas Open Source. It supports accurate ICC profile creation for scanners,\ncameras and film recorders, and calibration and profiling of displays\nand RGB, CMY & CMYK printers. Device Link can be created with a wide variety\nof advanced options, including specialized Video calibration standards\nand 3dLuts. Spectral sample data is supported, allowing a selection of\nilluminants observer types, and paper fluorescent whitener additive\ncompensation. Profiles can also incorporate source specific gamut\nmappings for perceptual and saturation intents. Gamut mapping and\nprofile linking uses the CIECAM02 appearance model, a unique gamut\nmapping algorithm, and a wide selection of rendering intents. It also\nincludes code for the fastest portable 8 bit raster color conversion\nengine available anywhere, as well as support for fast, fully accurate\n16 bit conversion. Device color gamuts can also be viewed and compared\nwith a modern Web browser using X3DOM . Comprehensive documentation is\nprovided for each major tool, and a general guide to using the tools for\ntypical color management tasks is also available. A mailing list provides\nsupport for more advanced usage.\n\nIt is licensed under the Affero GNU Version 3 license.\n\nFor more detailed information, please consult the HTML documentation in\n<doc/ArgyllDoc.html>, or <http://www.argyllcms.com/doc/ArgyllDoc.html>.\n\nFor the most recent source code start at <http://www.argyllcms.com/index.html>.\n\nContact me in regards to Argyll, icclib or cgatslib at:\n\n\tGraeme at argyllcms dot com\n\nEnjoy!\n\n## Maintainer's Note\n\nI produce and maintain Chocolatey packages in my spare time, for free. If you use my packages, and appreciate the time and effort I put into making and maintaining them, please consider [making a small donation](https://www.buymeacoffee.com/jtcmedia). Thank-you!", "updated": "2024-03-23T12:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/argyll/3.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/argyll/3.1.0", "licenseUrl": "https://www.gnu.org/licenses/agpl-3.0.html", "packageName": "argyll", "displayName": "Argyll CMS", "summary": "ICC compatible color management system", "version": "3.1.0", "icon": "", "author": "Graeme Gill", "downloadCount": 13762, "tags": ["graphics", "monitor", "scanner", "camera", "calibration", "icc", "color", "management", "argyll", "cli", "cross-platform"]}