{"description": "The code consist of two parts:\n\n1. ASN.1 parser library. This library I wrote, is very fast and memory efficient.\n2. Graphical User Interface provided by Windows Presentation Framework (WPF) with MVVM (Model-View-ViewModel) pattern.\n\nOld tool has unacceptable slow performance. For example, it took about 7 minutes to open a 90kb certificate revocation list file. While, for my tool it is a matter of 2-3 seconds on the same hardware. Feel the difference.\n\n## Same look new quality\nThe new tool resembles WinForms tool visual behavior, so existing editor users will not have difficulties with new tool:\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/asn1editor/screenshot1.png)\n\nand comparing with previous tool:\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/asn1editor/screenshot2.png)\n\nVery similar, so existing editor users will not face problems while using my own (if they wish to use new editor).\n\n## Main Features\nMain features in most are the same.\n\n### Dump Text Format data\nYou can view the selected node branch text dump by right-clicking the designated node and selecting “View Node Text”:\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/asn1editor/screenshot3.png)\n\nThis window provides TreeView textual visualization. It defines four columns:\n\n- **Offset** – specifies the start offset of the specified structure;\n- **Len** – specifies the structure’s payload length in bytes;\n- **LenByte** – specifies how many bytes are required to store length bytes (including transitional length byte). I’m not sure whether it is necessary, maybe we need more interesting data?\nTree View text visualizer with decoded primitive type value.\nYou can save this information to a file and print, if necessary.\n\n### Hex data viewer\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/asn1editor/screenshot4.png)\n\nin previous tool, hex data viewer was a separate window. I decided to combine them in the same window. By default, hex viewer is collapsed and can be opened by toggling the button in the toolbar. Hex viewer panel contains two toggle buttons. They are used to hide hex address and ASCII data panes:\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/asn1editor/screenshot5.png)\n\nWhen you select node in the Tree View panel, corresponding bytes are highlighted in the hex viewer as follows:\n\n- **Red** – this color indicates tag byte\n- **Green** – this color indicates length bytes. This includes transitional byte (if any).\n- **Black** – this color indicates the payload bytes.\n\n### Node data editor\nBy double-clicking on a node (or selecting from tree node context menu), a node data editor is opened:\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/asn1editor/screenshot6.png)\n\nYou can edit data for any primitive non-constructed type (except, NULL tag). Explicit value presentation depends on data type. For many types, textual value is displayed and allowed for input. However, not for all types there is encoder and decoder, so for certain types you will see raw hex view (and raw hex text should be inserted):\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/asn1editor/screenshot7.png)\n\nAs already said, NULL and constructed types are not editable:\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/asn1editor/screenshot8.png)\n\n**Note**: node content editor applies restrictions for certain data types. For example, if you are editing numeric strict, the code verifies whether all characters in the text are valid for numeric string.", "updated": "2024-03-23T11:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/asn1editor/1.4.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/asn1editor/1.4.1", "licenseUrl": "https://github.com/Crypt32/Asn1Editor.WPF/blob/master/LICENSE.md", "packageName": "asn1editor", "displayName": "ASN.1 Editor", "summary": "ASN.1 Editor is a tool that allows you to display, edit, format and convert ASN.1-encoded data.", "version": "1.4.1", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/asn1editor/asn1editor.png", "author": "Vadims Podāns", "downloadCount": 2173, "tags": ["ASN.1", "editor", "display", "edit", "format", "convert", "ASN.1-encoded", "data"]}