{"description": "Artistic Style is a source code indenter, formatter, and beautifier for the C, C++, C++/CLI, Objective-C, C# and Java programming languages.\n\nWhen indenting source code, we as programmers have a tendency to use both spaces and tab characters to create the wanted indentation. Moreover, some editors by default insert spaces instead of tabs when pressing the tab key, and other editors (Emacs for example) have the ability to \"pretty up\" lines by automatically setting up the white space before the code on the line, possibly inserting spaces in a code that up to now used only tabs for indentation.\n\nSince the NUMBER of space characters showed on screen for each tab character in the source code changes between editors (unless the user sets up the number to his liking...), one of the standard problems programmers are facing when moving from one editor to another is that code containing both spaces and tabs that was up to now perfectly indented, suddenly becomes a mess to look at when changing to another editor. Even if you as a programmer take care to ONLY use spaces or tabs, looking at other people's source code can still be problematic.\n\nTo address this problem, Artistic Style was created - a filter written in C++ that automatically re-indents and re-formats C / C++ / Objective-C / C++/CLI / C# / Java source files. It can be used from a command line, or it can be incorporated as classes in another C++ program.\n\n## Features\n\n- It's free and open source!\n- Cross-platform application works on Windows, Linux, Mac OS X, and others.\n- Supports 15 popular bracket styles.\n- Over 90 formatting options.\n- Detailed documentation for use and options\n- Available in over 20 languages with easy additions\n- Supports UTF8, UTF16, and most other character encodings.\n- Can process entire projects recursively.\n- Will not update unchanged files.\n- Checksum prevents dropped or duplicated data.\n- Seamless integration with many development environments and editors.\n- Can be included in C/C++ and Objective-C projects as a shared (DLL) or static library.\n- Can be included in Java projects as a Java Native Interface (KNI)\n- Can be included in C#, Python, Pascal, and other projects as a shared library (DLL).\n\n## Package Parameters\n\n- `/KeepAllFiles` - Don't remove any of the source/build files and other unneeded files.\n\n**Example**\n`choco install astyle --params '\"/KeepAllFiles\"'", "updated": "2024-03-22T22:18:29Z", "galleryUrl": "https://community.chocolatey.org/packages/astyle/3.4.12", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/astyle/3.4.12", "licenseUrl": "http://opensource.org/licenses/MIT", "packageName": "astyle", "displayName": "Artistic Style", "summary": "Artistic Style is a source code indenter, formatter, and beautifier for the C, C++, C++/CLI, Objective-C, C# and Java programming languages.", "version": "3.4.12", "icon": "", "author": "Jim Pattee,   Tal Dividson", "downloadCount": 11257, "tags": ["astyle", "beautifier", "command-only", "development"]}