{"description": "The desktop application Autenticação.gov allows citizens to take advantage of the electronic features of their Citizen Card, such as:\n      -sign digital documents with Citizen Card or Digital Mobile Key\n      -Personalize the digital signature\n      - view the address and finalize the process of changing the address on the Citizen Card\n      - change the PIN codes of the Citizen Card\n      - check if the digital certificates of the Citizen Card are valid\n      - include notes or information that the citizen finds useful, such as contacts to be used in case of emergency, blood group, allergies, etc.\n      - view and print the personal data contained in the Citizen Card.\n\n      A aplicação Autenticação.gov para computador permite ao cidadão tirar partido das funcionalidades eletrónicas do seu Cartão de Cidadão, como:\n      -assinar documentos digitais com Cartão de Cidadão ou Chave Móvel Digital\n      -personalizar a assinatura digital\n      -visualizar a morada e finalizar o processo de alteração de morada no Cartão de Cidadão\n      -alterar os códigos PIN do Cartão de Cidadão\n      -verificar se os certificados digitais do Cartão de Cidadão estão válidos\n      -incluir notas ou informações que o cidadão entenda, como contactos a utilizar em caso de urgência, grupo sanguíneo, alergias, etc.\n      -visualizar e imprimir os dados pessoais constantes no Cartão de Cidadão.", "updated": "2024-03-19T17:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/autenticacaogovpt/3.11.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/autenticacaogovpt/3.11.0", "licenseUrl": "", "packageName": "autenticacaogovpt", "displayName": "autenticacao.gov.pt (Install)", "summary": "The desktop application Autenticação.gov allows citizens to take advantage of the electronic features of their Citizen Card\n      A aplicação Autenticação.gov para computador permite ao cidadão tirar partido das funcionalidades eletrónicas do seu Cartão de Cidadão", "version": "3.11.0", "icon": "https://jorgercosta.github.io/autenticacao_gov_pt_chocolatey/logo.png", "author": "AGÊNCIA PARA A MODERNIZAÇÃO ADMINISTRATIVA,  IP", "downloadCount": 37, "tags": ["Identificação", "autenticação", "assinatura", "digital", "estado", "português"]}