{"description": "Automise CMD provides the command line runner for [Automise](https://chocolatey.org/packages/automise). \n\nThe package will download and install Automise with the default settings. A 30 day trail is included for each new installation after which a licence is required from our [store](https://www.finalbuilder.com/store).\n\n### Built In Actions\nOver 350 actions are included for common Windows tasks. Notiable groups of these actions include;\n\n * Logic - If..Then, Try..Catch..Finally, Switch, While, Iterator, and Async\n * File & directory - Search, Read, Update, and Delete\n * Text file - Search, Replace, Create, Read, Update, and Delete\n * Database - ADO Execute SQL, Stored Procedure, Backup\n * Notification - Email (SMTP), MSN, ICQ, and Telnet\n * Execution - Command line, PowerShell, Remote Execution, and PSTools \n * Software Maintenance - Install, Uninstall, Reinstall, MSI\n * Media - CD/DVD/Bluray\n * Upload & download -  Web Deploy, EC2, IIS, FTP, and SFTP\n * Configuration - Active Directory, .Net, HyperV, VWWare, XML, Windows OS, and IIS\n\n### Custom Scripting\nAll actions provide customisation through settings as well as scripting events. These events allow custom scripted behavior to be performed. Supported languages for scripts are JScript, VBScript, PowerShell, and IronPython.\n\n### Custom Actions - Action Studio\nCustom actions are used for large or complex custom scripting requirements. These custom actions can be backed by scripting logic or C# implementations. Custom action styles that can be written include;\n\n * Standard Actions - Simple actions that don't call an external tool. \n * Execute Actions - Actions that call an external tool to perform the desired task. \n * Iterator Actions - Tasks that require their repetition to be simplified in builds.", "updated": "2024-03-17T11:03:27Z", "galleryUrl": "https://community.chocolatey.org/packages/automiseruntime/5.0.0.1490", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/automiseruntime/5.0.0.1490", "licenseUrl": "https://www.finalbuilder.com/finalbuilder/license", "packageName": "automiseruntime", "displayName": "Automise Run-time (Install)", "summary": "Automise Run-time provides the command line runner for [Automise](https://chocolatey.org/packages/automise).", "version": "5.0.0.1490", "icon": "https://www.finalbuilder.com/images/automise/automise-Icon-256.png", "author": "VSoft Technologies Pty. Ltd.", "downloadCount": 8877, "tags": ["automise", "administration", "automation", "cmd", "CLI", "admin", "trial"]}