{"description": "Automate Mouse clicks with Auto Mouse Click Utility. Define Click Type, X Co-ordinates, Y-Co-ordinate and specify whether to return mouse cursor back to original location and automate mouse clicks. Install and try Auto Mouse Click for free. The Auto Mouse Click Utility allows to group Mouse Clicks (let's call the group as Mouse Click Script) and Save them in a File for later use. The Mouse Click Script can be loaded to run at a later time.\n\nYou can Register your copy of Auto Mouse Click Software Utility by paying in minimal registration fees, once the Free Trial of the Software Ends.\n\n## [How to Auto Mouse Click](https://www.murgee.com/auto-mouse-click)\n\n## Schedule Automatic Mouse Clicks\nIn Order to run Auto Mouse Clicks at a specified date / time, you would need 2 things. The First one is save the Mouse Clicks in a File by pressing ***Save Clicks*** and the second thing you would need is a Scheduler. You can also double click on the Mouse Clicks file (.amk) to run the Mouse Clicks automatically.\n\n## Register Auto Mouse Click\nAt the end of trial period of the Auto Mouse Click Software utility, a pop up window will appear asking you whether you wish to register the software utility ? Click on Yes and follow on screen prompts.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/automouseclick/screenshot.png)", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/automouseclick/99.1.4.20240319", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/automouseclick/99.1.4.20240319", "licenseUrl": "", "packageName": "automouseclick", "displayName": "Auto Mouse Click", "summary": "Automate Mouse clicks with Auto Mouse Click Utility.", "version": "99.1.4.20240319", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/automouseclick/automouseclick.png", "author": "MurGee", "downloadCount": 30757, "tags": ["automouseclick", "automate", "mouse", "click", "trial"]}