{"description": "ATTENTION: This is a licensing compliant, modified, derative work, please see \"UPDATE LOG\" in the script comments for the changes made.\n    Old locations that mentioned the original script:\n    http://aws.amazon.com/code/7932034889155460 (original URL now broken)\n    https://blog.appliedis.com/2012/10/05/how-to-publish-custom-performance-metrics-to-amazons-cloudwatch/\n    https://aws.amazon.com/blogs/aws/amazon-cloudwatch-monitoring-scripts-for-microsoft-windows/\n\n    2016-05-16 DarwinJS.  Version 1.2.0\n       - Corrected script help - was an unedited paste of mon-put-metrics-mem\n       - Added help examples for new functionality.\n       - Fixed to find .NET 3.5 with newer installs of AWS SDK on Amazon AMIs.\n       - allows -disk_drive 'all' to simple upload stats on all local disks - whatever they are for that instance.\n         Will also dynamically adjust if disks are added to or removed from instance in the future.\n       - drops any non-existent disks from the list given in -disk_drive, rather than generating an error.\n       - removed assumption of credentials being provided so that code can rely on the much better practice of using instance roles.\n       - replaced all \"write-host\" lines with better practice \"write-output\".\n       - updated parameters and defaults so that if the script is used with no parameters it reports disk utilization for\n         all installed disks and relies on instance roles for permission to post to cloudwatch.\n       - switch -selfschedulewiththeseparams schedules the script in the task scheduler instead of running.  Uses all parameters\n         given on the script call in the scheduled task (except, of course the parameter \"-selfschedulewiththeseparams\" itself)", "updated": "2024-03-20T20:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/aws-monitor-diskusage/1.2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/aws-monitor-diskusage/1.2.0", "licenseUrl": "https://raw.githubusercontent.com/DarwinJS/ChocoPackages/master/aws-monitor-diskusage/tools/aws-monitor-diskusage/LICENSE.txt", "packageName": "aws-monitor-diskusage", "displayName": "AWS Disk Monitoring Script For Windows (Install)", "summary": "Amazon no longer provides their monitoring  scripts for Windows.  Contains an updated AWS disk monitoring script for Windows and schedules it to run every 5 minutes to post metrics to AWS Cloudwatch.", "version": "1.2.0", "icon": "https://cdn.rawgit.com/DarwinJS/ChocoPackages/master/aws-monitor-diskusage/appicon.pngng", "author": "Amazon Web Services,  DarwinJS", "downloadCount": 1253, "tags": ["Amazon", "AWS", "CloudWatch", "Monitoring", "Scripts", "PowerShell", "Windows"]}