{"description": "# AWS IAM Authenticator for Kubernetes\n\nA tool to use AWS IAM credentials to authenticate to a Kubernetes cluster.\nThe initial work on this tool was driven by Heptio. The project receives contributions from multiple community engineers and is currently maintained by Heptio and Amazon EKS OSS Engineers.\n\n## Why do I want this?\nIf you are an administrator running a Kubernetes cluster on AWS, you already need to manage AWS IAM credentials to provision and update the cluster.\nBy using AWS IAM Authenticator for Kubernetes, you avoid having to manage a separate credential for Kubernetes access.\nAWS IAM also provides a number of nice properties such as an out of band audit trail (via CloudTrail) and 2FA/MFA enforcement.\n\nIf you are building a Kubernetes installer on AWS, AWS IAM Authenticator for Kubernetes can simplify your bootstrap process.\nYou won't need to somehow smuggle your initial admin credential securely out of your newly installed cluster.\nInstead, you can create a dedicated `KubernetesAdmin` role at cluster provisioning time and set up Authenticator to allow cluster administrator logins.\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-24T00:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/aws-iam-authenticator/0.5.9", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/aws-iam-authenticator/0.5.9", "licenseUrl": "https://github.com/kubernetes-sigs/aws-iam-authenticator/blob/master/LICENSE", "packageName": "aws-iam-authenticator", "displayName": "AWS IAM Authenticator for Kubernetes", "summary": "A tool to use AWS IAM credentials to authenticate to a Kubernetes cluster", "version": "0.5.9", "icon": "https://cdn.rawgit.com/douglaswth/chocolatey-packages/master/icons/aws-iam-authenticator.png", "author": "Heptio, Amazon EKS OSS Engineers", "downloadCount": 58163, "tags": ["aws-iam-authenticator", "aws", "cli", "cloud", "amazon", "kubernetes", "kubectl", "devops"]}