{"description": "BabelPad is a free Unicode text editor for Windows that supports the proper rendering of most complex scripts, and allows you to assign different fonts to different scripts in order to facilitate multi-script text editing. It also provides many useful [features and special utilities](https://www.babelstone.co.uk/Software/BabelPad_Features.html) for processing Unicode text. BabelPad supports the most recent version of the Unicode Standard, currently [Unicode 13.0](http://www.unicode.org/versions/Unicode13.0.0/) (released March 2020).\n\n![BabelPad Example](https://www.babelstone.co.uk/Software/Images/BabelPad_UDHR.png)\n\n## Key Features\n\n* Open files in a wide variety of [Unicode or legacy encodings](https://www.babelstone.co.uk/Software/BabelPad_Encodings.html); save files in any Unicode encoding (UTF-8, UTF-16, UTF-32) or Unicode-compatible encoding (GB18030), or as ASCII text with escaped Unicode characters.\n* Standard edit functionality, including drag-and-drop editing, multiple undo/redo, find and replace, and casing functions (for all casing scripts in Unicode).\n* Left-To-Right (LTR) or Right-To-Left (RTL) page layout; and support for bidirectional text.\n* Render text with either a single font or a user-defined composite font (where you can define which font to use for each Unicode block).\n* Render complex Unicode scripts using Microsoft's Uniscribe rendering engine or Universal Shaping Engine (for Windows 10).\n* Option to render all Unicode characters as individual spacing glyphs (i.e. with no shaping or joining of complex text).\n* Option to display text in different colours for different Unicode-defined scripts.\n* Convert Unicode text to/from a variety of escape codes (including converting to/from Unicode character names).\n* Convert between Unicode characters and code points by pressing Alt-X after a character or at the end of a code point.\n* Apply Unicode normalization (NFC, NFD, NFKC, NFKD) to text.\n* Convert Chinese text between traditional and simplified character forms.\n* Convert Chinese text to Mandarin pinyin readings.\n* Convert Japanese text between old and new character forms.\n* Convert between Vietnamese alphabet and VIQR.\n* Convert Extended Wylie Tibetan transliteration into Unicode Tibetan characters.\n* Convert between Yi (Nuosu) romanization and Unicode syllables.\n* Sort text according to the Unicode Collation Algorithm (UCA) or the CLDR Collation Algorithm.\n* Manipulate delimited columns of text (reorder, cut, copy, paste and sort columns delimited by tabs or any user-specified character or string).\n* Transcode from one list of characters or code points to another list of characters or code points\n* Batch replace one list of text strings with another list of text strings\n* Advanced character search utility which allows you to find all Unicode characters that match specified criteria.\n* Character Map utility to find and enter any Unicode character.\n* Supports user-defined custom keyboard layouts and text input methods ([file format](http://www.babelstone.co.uk/Software/BabelPad_Custom_Input_Method.html)).\n* Character lookup tools for finding Han (CJKV) characters by radical/stroke or by Mandarin or Cantonese readings.\n* Character lookup tool for finding Yi (Nuosu) characters by radical/stroke.\n* Character lookup tool for finding Tangut characters by reference code.\n* Various tools providing detailed information about Unicode versions, scripts, planes, blocks.\n* Emoji data tool that lists data about all Unicode-defined emoji, and select single or composite emoji.\n* Show additional non-Unicode data for Han (CJKV), Tangut and Egyptian Hieroglyph characters.\n* Unicode code point and character name of character at the current cursor position is displayed on the status bar, with additional information for Han (CJKV) and Tangut characters.\n\nFor more information see the [BabelPad Help](https://www.babelstone.co.uk/Software/BabelPad_Help.html) pages.", "updated": "2024-03-21T01:34:08Z", "galleryUrl": "https://community.chocolatey.org/packages/babelpad/15.1.0.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/babelpad/15.1.0.4", "licenseUrl": "https://www.babelstone.co.uk/Software/BabelPad.html#Download", "packageName": "babelpad", "displayName": "BabelPad", "summary": "Unicode text editor", "version": "15.1.0.4", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@174d8df68ae9c237a5d64629e6356e991b46475e/Icons/babelpad_icon.png", "author": "Andrew West", "downloadCount": 3643, "tags": ["babelpad", "unicode", "text", "edit", "notepad", "freeware"]}