{"description": "BabelMap is a free character map application for Windows that allows you to browse through the entire Unicode character repertoire of nearly 144,000 characters, or search for a particular character by name or by code point. Characters can then be copied to the clipboard for use in any Unicode-aware application. It also provides many useful [features and special utilities](https://www.babelstone.co.uk/Software/BabelMap_Features.html). BabelMap supports the most recent version of the Unicode Standard, currently [Unicode 13.0](http://www.unicode.org/versions/Unicode13.0.0/) (released March 2020).\n\n![BabelMap Example](https://www.babelstone.co.uk/Software/Images/BabelMap_13.png)\n\nSummary of Features\n* Browse through the entire Unicode code space block by block and character by character.\n* Tabbed display for Unicode planes (BMP, SMP, SIP, TIP, SSP, SPUA-A, SPUA-B), with options to display unassigned planes 4 through 13, and show unassigned ranges within assigned planes.\n* Display all characters using a single font, or define a composite font with different fonts used to display Unicode blocks.\n* Search for any Unicode character by character name; or go to a specified code point.\n* Paste any unknown Unicode character into the edit buffer and hit F2 to locate the character.\n* Edit buffer supports drag-and drop editing and the user-defined composite font.\n* Color code characters in the character grid by Unicode properties or version or script.\n* Advanced character search utility which allows you to find all Unicode characters that match specified criteria.\n* Character lookup tools for finding Han (CJKV) characters by radical/stroke or by Mandarin or Cantonese readings.\n* Character lookup tool for finding Yi (Nuosu) characters by radical/stroke.\n* Character lookup tool for finding Tangut characters by reference code.\n* Various tools providing detailed information about Unicode versions, scripts, planes, blocks.\n* Emoji data tool that lists data about all Unicode-defined emoji, and select single or composite emoji.\n* Show all Unicode properties for the selected character.\n* Show additional non-Unicode data for Han (CJKV), Tangut and Egyptian Hieroglyph characters.\n* Show summary information for all fonts installed on your system.\n* Show detailed information about any font on your system, including coverage of Unicode characters.\n* Export glyphs for any font to file as images.", "updated": "2024-03-24T00:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/babelmap/15.1.0.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/babelmap/15.1.0.3", "licenseUrl": "https://www.babelstone.co.uk/Software/BabelMap.html#Download", "packageName": "babelmap", "displayName": "BabelMap", "summary": "Unicode character map utility", "version": "15.1.0.3", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@046dcc9bc317214c6089a5cb436ce29ecb97c3b2/Icons/babelmap_icon.png", "author": "Andrew West", "downloadCount": 4222, "tags": ["babelmap", "unicode", "font", "glyph", "viewer", "analysis", "typeface", "freeware"]}