{"description": "Balabolka is a Text-To-Speech (TTS) program. All computer voices installed on your system are available to Balabolka. \nThe on-screen text can be saved as a WAV, MP3, MP4, OGG or WMA file. The program can read the clipboard content, view text from documents, customize font and background colour, control reading from the system tray or by the global hotkeys. \nBalabolka supports text file formats: AZW, AZW3, CHM, DjVu, DOC, DOCX, EML, EPUB, FB2, FB3, HTML, LIT, MOBI, ODP, ODS, ODT, PDB, PRC, PDF, PPT, PPTX, RTF, TCR, WPD, XLS, XLSX. \t\nThe program uses various versions of Microsoft Speech API (SAPI); it allows to alter a voice's parameters, including rate and pitch. \nThe user can apply a special substitution list to improve the quality of the voice's articulation. This feature is useful when you want to change the spelling of words. \nThe rules for the pronunciation correction use the syntax of regular expressions.\n\nBalabolka can save the synchronized text in external LRC files or in MP3 tags inside the audio files. \nWhen an audio file is played with players on a computer or on modern digital audio players, the text is displayed synchronously (at the same way, as lyrics for songs)\n\t\n#### Package Parameters\nThe following package parameters can be set:\n\n * `/NOICON` - Remove the Balabolka desktop icon\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install packageID [other options] --params=\"'/ITEM:value /ITEM2:value2 /FLAG_BOOLEAN'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-23T05:48:29Z", "galleryUrl": "https://community.chocolatey.org/packages/balabolka/2.15.0.864", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/balabolka/2.15.0.864", "licenseUrl": "", "packageName": "balabolka", "displayName": "Balabolka", "summary": "Text-To-Speech (TTS) program", "version": "2.15.0.864", "icon": "https://cdn.statically.io/gh/TheCakeIsNaOH/chocolatey-packages/6f509ff0a271ac69356650aa956d6a9c35f85080/Icons/balabolka_0000.png", "author": "Ilya Morozov", "downloadCount": 40040, "tags": ["balabolka"]}