{"description": "Replace, format, and extract text in multiple files using Regular Expressions. Perform GREP-like tasks including search and replace, RegEx substitutions, data extraction, and more! Built-in RegEx editors support color syntax highlighting and contextual tooltips making it easy to design patterns. Specialized RegEx tools like html/xml tag selector, line selector, or number selector help you make RegEx patterns faster. Integrated RegEx Builder helps with testing your RegEx patterns by letting you perform search and replace operations on sample text and automatically highlighting matches.\nProgram supports numerous text transformations that can be performed on text matched by your RegEx patterns. Some text transforms include: change letter case; trim; reverse order of characters; sort list; shuffle list; remove duplicates; compute hash; encrypt/decrypt; URL encode/decode; Morse code converter; escape/unescape string; operations with numbers (matched text is treated as a number that you can then change); etc.\nProcess 1000s of files using multiple CPU cores in manual, automatic/continuous, triggered/scheduled, or console modes, or directly from Windows Explorer right-click menu. Save files to output directory specified using either absolute or relative path, with original or new name defined by a mask. Select files for processing based on their name, dates, size, and contents using advanced file search supporting RegEx and advanced wildcards. Optionally merge together, split all, or zip processed files. Perform different operations on different files with conditional processing and process branching. Complete support for Regular Expressions (RegEx) and Unicode throughout the program. Detailed processing logs are available in both user interface and log files. Run multiple program instances simultaneously.\n\n    Note: This is a fully functional trial version. Processed files are limited in size.", "updated": "2024-03-22T11:33:39Z", "galleryUrl": "https://community.chocolatey.org/packages/batch-regex/5.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/batch-regex/5.0.0", "licenseUrl": "https://www.binarymark.com/eula.aspx", "packageName": "batch-regex", "displayName": "Batch RegEx", "summary": "Replace, format, and extract text in files", "version": "5.0.0", "icon": "https://www.binarymark.com/img/box/box20_std.png", "author": "BinaryMark", "downloadCount": 1016, "tags": ["batch-regex", "batch", "multiple", "bulk", "mass", "files", "regex", "regular-expressions", "grep", "regex-editor", "extract-text", "trial", "admin"]}