{"description": "Split multiple pictures into specified number of slices by rows and columns or into tiles of a desired size!\n\n- When you split images into rows and columns you need to specify the desired number of rows and columns\n- When splitting an image into tiles of a given fixed size, you have the option to specify that size precisely using either percentages or pixels to set tile's width and height\n- 130+ Actions and Effects: resize, contrast, watermark, etc...\n- Convert to/from and save results in any of 30+ formats: jpg, png, gif, tiff, bmp, j2k\n- 20 scaling modes: Lanczos, Bilinear, Bicubic, Box, HqX\n- Rotate and flip manually or using EXIF orientation tag\n- Fit to fixed size or rectangle; fit to aspect ratio\n- Perform lossless JPEG crops, flips, and rotations\n- Built-in and cloud-based face detection to perform advanced image processing on photos with detected faces\n- Automatic crop, crop to fixed size, crop from edges, crop to W:H ratio\n- Resize canvas and add padding; change print resolution\n- Change width and height independently or proportionately\n- Set dimensions using pixels, percentages %, or print units\n- Automatically shrink images to fit a desired file size in Kilobytes\n- Conditional processing based on image orientation, size, and other attributes\n- Add static and dynamic text and image watermarks with visual effects\n- Layers with 40+ blending modes and pixel filtering\n- Per-channel processing: extract, mix, replace, adjust values, etc...\n- 8 Color Models: RGB, HSB/HSV, HSL, HSI, HWB, YCbCr, Lab, LCH\n- Built-in image preview with interactive histograms\n- 4 operation modes: Manual, Background, Scheduled, and Console\n- Dynamically generate text watermarks with EXIF and file info\n- 12 compositing modes: source-over, source-in, source-out...\n- 40+ Blend Modes: lighten, darken, contrast, inversion...\n- Work with metadata: EXIF, IPTC, GPS, XMP.\n- Rename image files based on image or file properties and EXIF/IPTC metadata\n\n    Note: This is a fully functional trial version. Processed images will be watermarked.", "updated": "2024-03-22T11:18:31Z", "galleryUrl": "https://community.chocolatey.org/packages/batch-image-splitter/5.6.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/batch-image-splitter/5.6.0", "licenseUrl": "https://www.binarymark.com/eula.aspx", "packageName": "batch-image-splitter", "displayName": "Batch Image Splitter", "summary": "Split pictures into tiles of desired size", "version": "5.6.0", "icon": "https://www.binarymark.com/img/box/box15_std.png", "author": "BinaryMark", "downloadCount": 1016, "tags": ["batch-image-splitter", "split", "slice", "batch-resize", "images", "image", "picture", "pictures", "photo", "photos", "resize", "trial", "admin"]}