{"description": "Convert multiple images, photos, and pictures between 30+ formats: JPG, PNG, GIF, TIFF, BMP, JP2, J2K, TGA, PSD, RAW, DDS, PNM, WMF, ICO, SGI, HDR, LBM, MNG, XBM, XPM, PCD, PCX, PIC, JNG, WBM, G3... Lets you control encoding options: quality, compression, dithering, palette, bit depth, quantization, etc. Shows preview of the image and output file size. Supports lossless JPEG rotations / crops.\n\n- 120+ Actions and Effects: resize, contrast, watermark, etc...\n- Conditional processing based on image orientation, size, and other attributes\n- 4 operation modes: Manual, Background, Scheduled, and Console\n- Customize output file names with dynamic tags\n- Save images to multiple locations and using different settings\n- Work with metadata: EXIF, IPTC, GPS, XMP\n- Full 32-bit support for images with alpha channel\n- Fast parallel processing on multi-core CPUs\n- Rename image files based on image or file properties and EXIF/IPTC metadata\n- Resize, scale, shrink, fit to aspect ratio, fit to rectangle...\n- Automatic crop, crop to fixed size, crop from edges, crop to W:H ratio\n- Color adjustments: brightness, hue, saturation, tint, exposure...\n- Artistic effects: oil paint, pencil sketch, mosaic\n- Use creative effects: pixelate, vignette, frost glass...\n- Add static / dynamic text and image watermarks with visual effects\n- Rotate and flip manually or using EXIF orientation tag\n- Fit to fixed size or rectangle; fit to aspect ratio\n- Layers with 40+ blending modes and pixel filtering\n- 20 scaling modes: Lanczos, Bilinear, Bicubic, Box, HqX\n- Resize canvas and add padding; change print resolution\n- Change width and height independently or proportionately\n- Set dimensions using pixels, percentages %, or print units\n- Automatically shrink images to fit a desired file size in Kilobytes\n- Per-channel processing: extract, mix, replace, adjust values, etc...\n- 8 Color Models: RGB, HSB/HSV, HSL, HSI, HWB, YCbCr, Lab, LCH\n\n    Note: This is a fully functional trial version. Processed images will be watermarked.", "updated": "2024-03-17T09:18:26Z", "galleryUrl": "https://community.chocolatey.org/packages/batch-image-converter/5.6.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/batch-image-converter/5.6.0", "licenseUrl": "https://www.binarymark.com/eula.aspx", "packageName": "batch-image-converter", "displayName": "Batch Image Converter", "summary": "Convert multiple images between 30+ formats", "version": "5.6.0", "icon": "https://www.binarymark.com/img/box/box5_std.png", "author": "BinaryMark", "downloadCount": 1173, "tags": ["batch-image-converter", "batch-convert", "image-converter", "image-format", "picture-converter", "photo-converter", "jpeg", "jpg", "gif", "tif", "bmp", "trial", "admin"]}