{"description": "Turn average pictures and photos into great images with 120+ adjustments, actions, effects, and filters. Make HSL and RGB color corrections, adjust brightness, gamma, exposure, contrast, saturation, and 30+ other characteristics. Improve image quality by sharpening, noise reduction, and auto-levels filters. Apply creative effects to dramatically enhance your photos. Resize, crop, watermark, and convert between / save in 30+ image formats! Some additional key features include:\n\n- Built-in image preview with interactive histograms\n- Layers with 40+ blending modes and pixel filtering\n- Convert to/from and save results in any of 30+ formats: jpg, png, gif, tiff, bmp, j2k\n- Conditional processing based on image orientation, size, and other attributes\n- 4 operation modes: Manual, Background, Scheduled, and Console\n- 20 scaling modes: Lanczos, Bilinear, Bicubic, Box, HqX\n- Rotate and flip manually or using EXIF orientation tag\n- Fit to fixed size or rectangle; fit to aspect ratio\n- Perform lossless JPEG crops, flips, and rotations\n- Automatic crop, crop to fixed size, crop from edges, crop to W:H ratio\n- Change width and height independently or proportionately\n- Automatically shrink images to fit a desired file size in Kilobytes\n- Per-channel processing: extract, mix, replace, adjust values, etc...\n- 8 Color Models: RGB, HSB/HSV, HSL, HSI, HWB, YCbCr, Lab, LCH\n- Add static and dynamic text and image watermarks with visual effects\n- Use multiline text watermarks with various fonts and styles\n- Dynamically generate text watermarks with EXIF and file info\n- 12 compositing modes: source-over, source-in, source-out...\n- 40+ Blend Modes: lighten, darken, contrast, inversion...\n- Work with metadata: EXIF, IPTC, GPS, XMP.\n- Customize output file names with dynamic tags\n- Save images to multiple locations and using different settings\n- Fast parallel processing on multi-core CPUs\n- Rename image files based on image or file properties and EXIF/IPTC metadata\n\n    Note: This is a fully functional trial version. Processed images will be watermarked.", "updated": "2024-03-23T07:48:27Z", "galleryUrl": "https://community.chocolatey.org/packages/batch-image-enhancer/5.6.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/batch-image-enhancer/5.6.0", "licenseUrl": "https://www.binarymark.com/eula.aspx", "packageName": "batch-image-enhancer", "displayName": "Batch Image Enhancer", "summary": "Turn average photos into stunning images", "version": "5.6.0", "icon": "https://www.binarymark.com/img/box/box4_std.png", "author": "BinaryMark", "downloadCount": 928, "tags": ["batch-image-enhancer", "batch-image", "batch-photo", "patch-picture", "enhance", "improve-quality", "remove-noise", "auto-adjust", "white-balance", "sharpen", "color", "trial", "admin"]}