{"description": "Replace, insert, delete, copy, move, reverse, and otherwise modify bytes and bits in multiple files. Search and replace supports wildcard bytes and match selection. Perform bitwise operations on specified bytes with bitmasks and operators like NOT, AND, OR, XOR, NAND, NOR, XNOR. Reverse order of specified bytes and bits. Compute MD5, SHA1, SHA2, RIPE-MD hashes and CRC checksums for whole files or specified bytes. Convert files to/from bin-hex and Base-64 formats. Convert raw bytes in files to their hexadecimal, decimal, octal, or binary codes stored as ASCII text and vice-versa. Includes built-in base converter that can freely convert between binary, octal, decimal, and hexadecimal, as well as treat any sequence of bytes as a number.\nProcess 1000s of files using multiple CPU cores in manual, automatic/continuous, triggered/scheduled, or console modes, or directly from Windows Explorer right-click menu. Save files to output directory specified using either absolute or relative path, with original or new name defined by a mask. Select files for processing based on their name, dates, size, and contents using advanced file search supporting RegEx and advanced wildcards. Optionally merge together, split all, or zip processed files. Perform different operations on different files with conditional processing and process branching. Detailed processing logs are available in both user interface and log files. Run multiple program instances simultaneously.\n\n    Note: This is a fully functional trial version. Processed files are limited in size.", "updated": "2024-03-21T18:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/batch-hex-editor/5.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/batch-hex-editor/5.0.0", "licenseUrl": "https://www.binarymark.com/eula.aspx", "packageName": "batch-hex-editor", "displayName": "Batch Hex Editor", "summary": "Hex-edit raw byte data in multiple files", "version": "5.0.0", "icon": "https://www.binarymark.com/img/box/box21_std.png", "author": "BinaryMark", "downloadCount": 1080, "tags": ["batch-hex-editor", "batch", "multiple", "bulk", "mass", "files", "hex", "binary", "hex-edit", "search", "replace", "trial", "admin"]}