{"description": "Resize, crop, shrink, flip, EXIF-autorotate, resample, convert, enhance, and process multiple pictures and photos with this professional software!\n\n- 120+ Actions and Effects: resize, contrast, watermark, etc...\n- Convert to/from and save results in any of 30+ formats: jpg, png, gif, tiff, bmp, j2k\n- 20 scaling modes: Lanczos, Bilinear, Bicubic, Box, HqX\n- Rotate and flip manually or using EXIF orientation tag\n- Fit to fixed size or rectangle; fit to aspect ratio\n- Perform lossless JPEG crops, flips, and rotations\n- Automatic crop, crop to fixed size, crop from edges, crop to W:H ratio\n- Resize canvas and add padding; change print resolution\n- Change width and height independently or proportionately\n- Set dimensions using pixels, percentages %, or print units\n- Automatically shrink images to fit a desired file size in Kilobytes\n- Conditional processing based on image orientation, size, and other attributes\n- Add static and dynamic text and image watermarks with visual effects\n- Layers with 40+ blending modes and pixel filtering\n- Per-channel processing: extract, mix, replace, adjust values, etc...\n- 8 Color Models: RGB, HSB/HSV, HSL, HSI, HWB, YCbCr, Lab, LCH\n- Built-in image preview with interactive histograms\n- 4 operation modes: Manual, Background, Scheduled, and Console\n- Use multiline text watermarks with various fonts and styles\n- Dynamically generate text watermarks with EXIF and file info\n- Use picture watermarks to add visual attractiveness\n- 12 compositing modes: source-over, source-in, source-out...\n- 40+ Blend Modes: lighten, darken, contrast, inversion...\n- Customizable image format options: bit depth, compression...\n- Work with metadata: EXIF, IPTC, GPS, XMP.\n- Customize output file names with dynamic tags\n- Save images to multiple locations and using different settings\n- Fast parallel processing on multi-core CPUs\n- Rename image files based on image or file properties and EXIF/IPTC metadata\n\n    Note: This is a fully functional trial version. Processed images will be watermarked.", "updated": "2024-03-22T10:04:07Z", "galleryUrl": "https://community.chocolatey.org/packages/batch-image-resizer/5.6.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/batch-image-resizer/5.6.0", "licenseUrl": "https://www.binarymark.com/eula.aspx", "packageName": "batch-image-resizer", "displayName": "Batch Image Resizer", "summary": "Batch-Resize/Crop/Flip/Convert your images", "version": "5.6.0", "icon": "https://www.binarymark.com/img/box/box2_std.png", "author": "BinaryMark", "downloadCount": 1196, "tags": ["batch-image-resizer", "batch-resize", "images", "image", "picture", "pictures", "photo", "photos", "resize", "convert", "rename", "trial", "admin"]}