{"description": "# What is Bazelisk\n## About Bazelisk\n\nBazelisk is a wrapper for Bazel written in Go.\nIt automatically picks a good version of Bazel given your current working directory, downloads it from the official server (if required) and then transparently passes through all command-line arguments to the real Bazel binary.\nYou can call it just like you would call Bazel.\n\nSome ideas how to use it:\n- Install it as the `bazel` binary in your PATH (e.g. /usr/local/bin).\n  Never worry about upgrading Bazel to the latest version again.\n- Check it into your repository and recommend users to build your software via `./bazelisk build //my:software`.\n  That way, even someone who has never used Bazel or doesn't have it installed can build your software.\n- As a company using Bazel or as a project owner, add a `.bazelversion` file to your repository.\n  This will tell Bazelisk to use the exact version specified in the file when running in your workspace.\n  The fact that it's versioned inside your repository will then allow for atomic upgrades of Bazel including all necessary changes.\n  If you install Bazelisk as `bazel` on your CI machines, too, you can even test Bazel upgrades via a normal presubmit / pull request.\n  It will also ensure that users will not try to build your project with an incompatible version of Bazel, which is often a cause for frustration and failing builds.\n\nBefore Bazelisk was rewritten in Go, it was a Python script.\nThis still works and has the advantage that you can run it on any platform that has a Python interpreter, but is currently unmaintained and it doesn't support as many features.\nThe documentation below describes the newer Go version only.\n\n## Where does Bazelisk get Bazel from?\n\nBy default Bazelisk retrieves the list of Bazel versions from the Bazel GitHub project. If this fails, Bazelisk queries the official Bazel release server instead.\nIn both cases the actual binaries are downloaded from the release server.\n\n## Why is my Virus Scanner saying this is malware\n[Official Go Docs](https://golang.org/doc/faq#virus) indicate this is a common problem and is being specifically reviewed for Bazelisk in [Issue #168](https://github.com/bazelbuild/bazelisk/issues/168)", "updated": "2024-03-24T00:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/bazelisk/1.19.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bazelisk/1.19.0", "licenseUrl": "https://github.com/bazelbuild/bazelisk/blob/master/LICENSE", "packageName": "bazelisk", "displayName": "Bazelisk", "summary": "A user-friendly launcher for Bazel", "version": "1.19.0", "icon": "", "author": "bazelbuild", "downloadCount": 45137, "tags": ["bazelisk", "bazel", "build"]}