{"description": "BetterDiscord extends the functionality of DiscordApp by enhancing it with new features.\n\n---\n\n## BetterDiscord\n\nBetterDiscord is a client modification for Discord. This allows you to add plugins and themes to your personal copy of Discord. BetterDiscord also adds a number of other features out of the box.\n\n![Logo](https://betterdiscord.app/resources/branding/logo_large.svg)\n\n## Themes\n\nThemes allow you to completely customize your client with CSS. You can either make your own theme, or download the wide variety of themes from our community.\n\n## Plugins\n\nBetterDiscord comes with a builtin plugin loader and plugin API. Plugins can increase the functionality and user experience of the app through JavaScript. Write your own or download plugins made by the community.\n\n## Twitch Emotes\n\nUse your favorite BTTV and FFZ emotes in discord chat with other BD users.\n\n## Security\n\nAll plugin updates from our official repo are manually verified for malicious code.\n\n## CSS Editor\n\nBetterDiscord comes with a live CSS editor for debugging and basic UI tweaking.\n\n## Developer Utils\n\nFeatures for developers such as utility classes and a Plugin API come out of the box.\n\n## Transparency\n\nEnable transparency and use a transparent theme for a see-through window.\n\n## Public Servers\n\nExplore communities from [DiscordServers.com](https://discordservers.com/) directly through your client.\n\n**Please Note**: This is an automatically updated package. If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T01:18:29Z", "galleryUrl": "https://community.chocolatey.org/packages/betterdiscord/1.3.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/betterdiscord/1.3.0", "licenseUrl": "https://github.com/BetterDiscord/Installer/blob/main/LICENSE", "packageName": "betterdiscord", "displayName": "BetterDiscord Installer", "summary": "The Discord Enhancement Project", "version": "1.3.0", "icon": "https://rawcdn.githack.com/virtualex-itv/chocolatey-packages/28312650af5f6f365757d0c90621c11154a7c6ae/icons/betterdiscord.png", "author": "BetterDiscord Team", "downloadCount": 6208, "tags": ["betterdiscord", "better", "discord", "dc", "betterdc"]}