{"description": "BGB is a Gameboy emulator, a program that lets you play Gameboy and Gameboy Color games on a pc. It does this with many features that give a good gameplay experience, such as gamepad support, high quality sound and graphics, smooth Vsync animation, and low latency. In addition, it contains a debugger that lets you analyze/look into the emulation, create cheat codes, and assist in creating and modifying roms. Because of BGB's high emulation accuracy, if your rom works in BGB, it will most likely work on hardware too.\n\nFeatures\n- emulation of the GameBoy, GameBoy Color, and Super Gameboy\n- accurate emulation of the hardware, based on research with lots of test roms, useful for debugging/rom development. some highlights:\n- clock exact timing of LCD behavior/state changes\n- realistic initial ram values - random but with specific bit patterns, and simulated values left by bootroms (for example \"nibbler (pd)\" depends on this)\n- accurate emulation of LCD register writes during scanline (prehistorik man, demotronic demo)\n- emulation of inaccessible VRAM and OAM as on real hardware\n- 10 sprites per line limit\n- clock exact emulation of sprites causing mode 3 to take longer\n- correct memory access timing (access happening at the last/second to last clock of an opcode)\n- accurate emulation of the differences between DMG and GBC, including timing differences, differences in hardware behavior, initial state, etc.\n- can run a GBC rom as on a DMG, and a DMG rom as on a GBC\n- powerful debugger:\n- disassembler with syntax selectable from: no$gmb, rgbds, wla\n- assembler (change code and ability to save modified rom)\n- symbols (SYM file) support\n- \"inline\" editing in code, data, and stack viewer\n- breakpoints\n- break on access\n- conditional breakpoints\n- \"on jump\" access breakpoints for breaking before a jump into a range is taken.\n- source code breakpoints (ld b,b)\n- debug messages (ld d,d)\n- singlestepping/tracing/animating/step out/step over\n- vram viewer: BG map, tiles, OAM, palette.\n- IO registers viewer\n- live display of data during emulation and freezing of ram values\n- break on exceptions (accessing inaccessible VRAM, read unitialized RAM, echo ram access, access locked external ram, disable lcd outside vblank)\n- ability to modify all registers and state at any time\n- joypad window allows simulating button presses at any time while debugging\n- SGB multiplayer with up to 4 gamepads\n- graphics output: GDI, DirectDraw, Direct3D, OpenGL, null output\n- graphics doubler: HQ2X, Scale2x, scanlines filter, blocky\n- sound output: waveout, directsound, null, and disk writer supported. support for writing the 4 channels to separate wav files\n- AVI recording with installed codec of choice that is synchronized with recorded WAV file, and can be combined into a single video afterwards.\n- runs almost all roms perfectly, compatibility comparable with the best GB/C emulators\n- Accurate/high quality sound emulation, bandlimited synthesis\n- accurate video emulation including \"high color\" graphics, correct sprite/background priorities, 10 sprites/line limit, and mid-scanline register changes.\n- This emulator is fast.\n- Joystick/Gamepad support, everything mappable to every button\n- some user interface keys are configurable and can be mapped to joystick/gamepad buttons\n- MBC3 Real Time Clock emulation. RTC is saved/loaded in the .sav file, compatible with VBA\n- Auto delay/frameskip, emulation runs at 100% real speed and full 60 fps\n- GameGenie and GameShark cheat, load/save cheats (auto and manual), \"cheat searcher\", easy creation of new cheat codes\n- save/load state with quick (zsnes style, and mappable) keys.\n- back and forward compatibility of sav files and save states so your saved progress is not lost. bgb can load all save files of previous versions.\n- Load from ZIP and GZIP files\n- good OS/platform compatibility/low requirements\n- support for optional border bitmap and pseudo and real fullscreen modes.\n- TCP/IP game link support", "updated": "2024-03-22T05:33:36Z", "galleryUrl": "https://community.chocolatey.org/packages/bgb/1.5.10", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bgb/1.5.10", "licenseUrl": "http://bgb.bircd.org/", "packageName": "bgb", "displayName": "BGB", "summary": "BGB is a GameBoy emulator/debugger which runs on Windows and Wine.", "version": "1.5.10", "icon": "https://cdn.jsdelivr.net/gh/zemzelett/chocolatey-packages/icons/bgb.png", "author": "Bas Steendijk", "downloadCount": 566, "tags": ["gameboy", "emulator", "emu", "bgb", "game", "games", "emulate", "portable", "retro", "rom", "debug", "debugger"]}