{"description": "BgInfo is a fully-configurable program to automatically generate desktop backgrounds that include important information about the system including IP addresses, computer name, network adapters, and more.\n\nHow many times have you walked up to a system in your office and needed to click through several diagnostic windows to remind yourself of important aspects of its configuration, such as its name, IP address, or operating system version? If you manage multiple computers you probably need BGInfo. It automatically displays relevant information about a Windows computer on the desktop's background, such as the computer name, IP address, service pack version, and more. You can edit any field as well as the font and background colors, and can place it in your startup folder so that it runs every boot, or even configure it to display as the background for the logon screen.\n\n#### Command line usage\n\nWhen you run BGInfo it shows you the appearance and content of its default desktop background. If left untouched it will automatically apply these settings and exit after its 10 second count-down timer expires.\n\nSelecting any button or menu item will disable the timer, allowing you to customize the layout and content of the background information.\n\nIf you want BGInfo to edit or use a configuration stored in a file (instead of the default configuration which is stored in the registry) specify the name of the file on the command line: BGInfo MyConfig.bgi  \n\n__<path>__  Specifies the name of a configuration file to use for the current session. Changes to the configuration are automatically saved back to the file when OK or Apply is pressed. If this parameter is not present BGInfo uses the default configuration information which is stored in the registry under the current user (`HKEY_CURRENT_USER\\Software\\Winternals\\BGInfo`).\n\n__/timer__  Specifies the timeout value for the countdown timer, in seconds. Specifying zero will update the display without displaying the configuration dialog. Specifying 300 seconds or longer disables the timer altogether.\n\n__/popup__  Causes BGInfo to create a popup window containing the configured information without updating the desktop. The information is formatted exactly as it would if displayed on the desktop, but resides in a fitted window instead. When using this option the history database is not updated.\n\n__/silent__  Suppresses error messages.\n\n__/taskbar__  Causes BGInfo to place an icon in the taskbar's status area without updating the desktop. Clicking the icon causes the configured information to appear in a popup window. When using this option the history database is not updated.\n\n__/all__  Specifies that BGInfo should change the wallpaper for any and all users currently logged in to the system. This option is useful within a Terminal Services environment, or when BGInfo is scheduled to run periodically on a system used by more than one person (see Using a Schedule below).\n\n__/log__  Causes BGInfo to write errors to the specified log file instead of generating a warning dialog box. This is useful for tracking down errors that occur when BGInfo is run under the scheduler.\n\n__/rtf__  Causes BGInfo to write its output text to an RTF file. All formatting information and colors are included.", "updated": "2024-03-24T00:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/bginfo/4.32", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bginfo/4.32", "licenseUrl": "https://docs.microsoft.com/en-au/sysinternals/license-terms", "packageName": "bginfo", "displayName": "BgInfo", "summary": "Automatic desktop backgrounds that include system information", "version": "4.32", "icon": "http://raw.githubusercontent.com/flcdrg/au-packages/master/bginfo/icons/bginfo.png", "author": "Bryce Cogswell", "downloadCount": 805177, "tags": ["desktop", "background", "info", "sysinternals"]}