{"description": "Get complete picture of your biorhythms by seeing a total of 15 built-in rhythms: Primary, I-Ching, Secondary, and Intuitive Patterns, as well as user-defined rhythms, by visualizing them like never before with 9 fully customizable and interactive views, including: Graph, Table, Calendar, Timeline, Compatibility, and Report.\nPut biorhythms to practice easily: always be prepared for your bad days and take advantage of your good days with an all-in-one Threats and Opportunities View, unique activities feature, and Microsoft Outlook integration.\nSee how compatible you are in various areas with your loved ones, relatives, and friends in detailed, sortable Compatibility View and by being able to view biorhythms of multiple people side-by-side.\nMake personalized reports in a few clicks with charts, tips, and visuals - ready for printing and e-mail!\nIntegrated but optional Astrology, Numerology, and Celebrity Database modules further enhance the already impressive product`s feature set!\nYou can get started using the product very quickly! There is zero-learning curve as product`s intuitive Office 2007-like Ribbon User Interface, built-in interactive tutorial, and detailed tips make it a breeze to access the desired functionality. On top of that there is a ton of usability features: complete copy-paste and printing support for all views; lots of options; visualizations that make it possible to judge one`s biorhythms status at a glance; export to Excel, jpeg and other file formats; state of the art navigation system, and much, much more!\n\n    Note: This is Amateur Edition and is limited to only basic rhythms and views.", "updated": "2024-03-23T12:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/biorhythms-calculator/2.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/biorhythms-calculator/2.0.0", "licenseUrl": "https://www.binarymark.com/eula.aspx", "packageName": "biorhythms-calculator", "displayName": "Biorhythms Calculator", "summary": "Discover your good and bad days", "version": "2.0.0", "icon": "https://www.binarymark.com/img/box/box6_std.png", "author": "BinaryMark", "downloadCount": 924, "tags": ["biorhythms-calculator", "biorythms", "biorhythms", "biorhythm-program", "biorhythm-software", "biorhythms-charts", "biorhythms-online", "biorhythm-chart", "biorhythm-cycles", "admin"]}