{"description": "Bitcoin XT is an implementation of a Bitcoin full node, based upon the source code of Bitcoin Core with a focus on upgrades to the peer to peer protocol. By running it you can opt in to providing the Bitcoin network with additional services beyond what Bitcoin Core provides, including [bigger blocks](https://bitcoinxt.software/#sec-hardfork).\n\nIt is built by taking the latest stable Core release, applying a series of [patches](https://bitcoinxt.software/patches.html), and then doing deterministic builds so anyone can check the downloads correspond to the source code.\n\n### Disk Requirements\n* As of 18 January 2016, the total size of the BTC blockchain is __52.48 GB__ \n* Size increases based on quantity of transactions ([growth chart](https://blockchain.info/charts/blocks-size))\n* Blockchain is slowly downloaded only when Bitcoin XT is running and connected to network\n* Blockchain default location is `%AppData%\\Bitcoin\\data`\n* Bitcoin XT uses the same data directories as Bitcoin Core so either program can use the same blockchain data.\n\n### Security\n* This program should only be installed on a trusted machine.\n* By default, upon first execution Bitcoin XT creates an unencrypted wallet file at `%AppData%\\Bitcoin\\wallet.dat`\n* Wallet.dat stores all your private keys for public Bitcoin addresses.  If this file is not encrypted, anyone with access to the file may withdraw funds from addresses stored in the file.  For this reason, you should encrypt wallet.dat as soon as possible from the Bitcoin XT interface.\n* After encrypting wallet.dat, back up wallet.dat to at least one other secure storage medium.\n* More information about [securing your wallet](https://bitcoin.org/en/secure-your-wallet)", "updated": "2024-03-23T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/bitcoinxt/0.11.04", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bitcoinxt/0.11.04", "licenseUrl": "https://github.com/bitcoinxt/bitcoinxt/blob/master/COPYING", "packageName": "bitcoinxt", "displayName": "Bitcoin XT", "summary": "Software-based online payment system", "version": "0.11.04", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/74df04297239b7c70b597f40fe59e4fddb970a46/icons/bitcoinxt.png", "author": "Bitcoin XT Developers", "downloadCount": 1140, "tags": ["bitcoin", "btc", "wallet", "crypto", "currency", "p2p"]}