{"description": "Bitcoin Unlimited is an implementation of a full Bitcoin Core node. By running it, you express an interest to the Bitcoin network to make specific changes to the Bitcoin protocol, including changes to Bitcoin's blockchain blocksize.\n\nThe Bitcoin Unlimited client is not a competitive block scaling proposal like BIP-101, BIP-102, etc. Instead it tracks consensus. This means that it tracks the blockchain that the hash power majority follows, irrespective of blocksize, and signals its ability to accept larger blocks via protocol and block versioning fields.\n\nIf you support an increase in the blocksize limit by any means -- or just support Bitcoin conflict resolution as originally envisioned by its founder -- consider running a Bitcoin Unlimited client.\n\n### Disk requirements\n* As of 12 May 2017, the total size of the BTC blockchain is __107.9 GB__ \n* Size increases based on quantity of transactions ([growth chart](https://blockchain.info/charts/blocks-size))\n* Blockchain is slowly downloaded only when Bitcoin Unlimited is running and connected to network\n* Blockchain default location is `%AppData%\\Bitcoin\\data`\n\n### Security\n* This program should only be installed on a trusted machine.\n* By default, upon first execution Bitcoin Unlimited creates an unencrypted wallet file at `%AppData%\\Bitcoin\\wallet.dat`\n* Wallet.dat stores all your private keys for public Bitcoin addresses. If this file is not encrypted, anyone with access to the file may withdraw funds from addresses stored in the file. For this reason, you should encrypt the file as soon as possible with Bitcoin Unlimited.\n* After encrypting wallet.dat, back up wallet.dat to at least one other storage medium.\n* More information about [securing your wallet](https://bitcoin.org/en/secure-your-wallet)", "updated": "2024-03-11T15:18:39Z", "galleryUrl": "https://community.chocolatey.org/packages/bitcoin-unlimited.install/1.0.2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bitcoin-unlimited.install/1.0.2.0", "licenseUrl": "https://github.com/BitcoinUnlimited/BitcoinUnlimited/blob/release/COPYING", "packageName": "bitcoin-unlimited.install", "displayName": "Bitcoin Unlimited (Install)", "summary": "Software-based online payment system", "version": "1.0.2.0", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/1ee4d2d9a5c7b19315b9155256d7c87bc5ae8246/icons/bitcoin-unlimited.png", "author": "Bitcoin Unlimited", "downloadCount": 1698, "tags": ["bitcoin", "btc", "wallet", "crypto", "currency", "p2p", "protocol"]}