{"description": "## Bitcoin Wallet\nBitcoin uses decentralized, peer-to-peer technology to operate a public transactional database with no\ncentral authority or banks; managing transactions and the issuing of value units, called \"bitcoins\", is\ncarried out collectively by the network. Bitcoin is open-source; its design is public, nobody owns or\ncontrols Bitcoin and everyone can take part. Through many of its unique properties, Bitcoin allows\nexciting uses that could not be covered by any previous payment system.\n\nAll transactions executed upon the Bitcoin network are public record. Bitcoin Core wallet allows\ncreating private addresses, sending funds to private addresses, and synchronization of any private\naddresses that have received transactions. Bitcoin Core does this by reading the locally stored public\nledger called the blockchain, and populating the user interface with these pertinent details. Bitcoin\nCore wallet will thus download a full copy of the distributed ledger to your computer and keep it\nupdated. It will also keep it verified by comparing recent block data with block data of network nodes.\nA block chain is a transaction database containing all private addresses that have ever received a\ntransaction. The database is shared by all nodes participating in a system based on the Bitcoin\nprotocol. A full copy of a currency's block chain contains every transaction ever executed in the\ncurrency. With this information, one can find out how much value belonged to each address at any point\nin history.\n\nNew transactions are approved by computing a value determined dynamically by recent conditions of the\nBitcoin network which satisfy conditions specified within the Bitcoin protocol. The Bitcoin protocol can\nonly be modified by adjusting over 50% of currently running nodes, or in other words, upgrading to a new\nversion. Most upgrades only modify the user interface and make no changes to the Bitcoin protocol. In\nthe rare event a Bitcoin protocol update has been mandated, called a \"hard fork\", all software nodes\nthat utilizes the Bitcoin blockchain must be upgraded by a certain date.\n\n#### Disk Requirements\nAs of 15 February 2020, the total size of the BTC blockchain is 263.14 GB\nSize increases based on quantity of transactions ([growth chart](https://blockchain.info/charts/blocks-size))   \nBlockchain is slowly downloaded only when Bitcoin Core is running and connected to network\nBlockchain default location is %AppData%\\Bitcoin\\data\nSecurity   \nThis program should only be installed on a trusted machine.\nBy default, upon first execution Bitcoin Core creates an unencrypted wallet file at\n%AppData%\\Bitcoin\\wallet.dat   \nWallet.dat stores all your private keys for public Bitcoin addresses. If this file is not encrypted,\nanyone with access to the file may withdraw funds from addresses stored in the file. For this reason,\nyou should encrypt the file as soon as possible with Bitcoin Core.   \nAfter encrypting wallet.dat, back up wallet.dat to at least one other storage medium.\nMore information about securing your wallet\n\n#### Community\n[Forums](https://bitcoin.org/en/community#forums)   \n[IRC](https://bitcoin.org/en/community#irc)   \n[Social media](https://bitcoin.org/en/community#social)   \n\n#### Documentation\n[FAQ](https://bitcoin.org/en/faq)   \n[Wiki](http://en.bitcoin.it/)   \n[How to use](https://bitcoin.org/en/getting-started)   \n[How it works](https://bitcoin.org/en/how-it-works)   \n[Developer](https://bitcoin.org/en/developer-documentation)\n\n### Package-specific issue\nIf this package isn't up-to-date for some days, [Create an issue](https://github.com/tunisiano187/Chocolatey-packages/issues/new/choose)\n\nSupport the package maintainer and [![Patreon](https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@d15c4e19c709e7148588d4523ffc6dd3cd3c7e5e/icons/patreon.png)](https://www.patreon.com/tunisiano)", "updated": "2024-03-23T06:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/bitcoin.install/26.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bitcoin.install/26.0.0", "licenseUrl": "http://opensource.org/licenses/MIT", "packageName": "bitcoin.install", "displayName": "Bitcoin Core Wallet (Install)", "summary": "A software-based online payment system", "version": "26.0.0", "icon": "https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@97fb13fc99efb8a58a431402f7710535d8db0cd3/icons/bitcoin.svg", "author": "Satoshi Nakamoto, Gavin Andresen, Bitcoin Developers", "downloadCount": 12937, "tags": ["bitcoin", "btc", "blockchain", "wallet", "crypto", "currency", "p2p", "admin"]}