{"description": "Our SSH and SFTP client for Windows incorporates:\n    - One of the most advanced graphical SFTP clients.\n    - Single-click Remote Desktop forwarding.\n    - State-of-the-art terminal emulation with support for the bvterm, xterm, and vt100 protocols.\n    - Support for corporation-wide single sign-on using SSPI (GSSAPI) Kerberos 5 and NTLM user authentication, as well as Kerberos 5 host authentication.\n    - Support for ECDSA, RSA and DSA public key authentication with comprehensive user keypair management.\n    - FIPS 140-2 validation: Bitvise SSH Client 6.xx uses the FIPS-certified DLL version of Crypto++ 5.3.0, originally validated by NIST under certificate #819. Our next release will use Windows cryptography on Windows 8/2012 and newer, validated under certificates #1892 and #2357.\n    - Obfuscated SSH with an optional keyword. When supported and enabled in both the client and server, obfuscation makes it more difficult for an observer to detect that the protocol being used is SSH. (Protocol; OpenSSH patches)\n    - Powerful SSH port forwarding capabilities, including dynamic forwarding through integrated SOCKS and HTTP CONNECT proxy.\n    - Powerful command-line parameters which make the SSH client highly customizable and suitable for use in specific situations and controlled environments.\n    - An FTP-to-SFTP bridge allowing you to connect to an SFTP server using legacy FTP applications.\n    - An advanced, scriptable command-line SFTP client, sftpc.\n    - A scriptable command-line remote execution client, sexec, and a command-line terminal console client, stermc.\n    - A scriptable command-line tunneling client, stnlc, with support for static port forwarding rules, dynamic SOCKS-based tunneling, and FTP-to-SFTP bridge.\n    - Our .NET SSH library, FlowSshNet, with example PowerShell scripts showing how to use the SSH library for file transfer and remote program execution from PowerShell.\n    - Bitvise SSH Server remote administration features.", "updated": "2024-03-23T21:33:37Z", "galleryUrl": "https://community.chocolatey.org/packages/bitvise-ssh-client/9.33.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bitvise-ssh-client/9.33.0", "licenseUrl": "https://www.bitvise.com/ssh-client-license", "packageName": "bitvise-ssh-client", "displayName": "Bitvise SSH Client (Install)", "summary": "Bitvise SSH Client (previously Tunnelier) - Free SSH file transfer, terminal and tunneling!", "version": "9.33.0", "icon": "https://rawcdn.githack.com/jtcmedia/chocolatey-packages/1e87afdbb4face407d506d33453cbe11c70e5af2/icons/bitvise-ssh-client.png", "author": "Bitvise Limited", "downloadCount": 187262, "tags": ["ssh", "sftp", "client", "vt100", "admin"]}