{"description": "BlueJ is a development environment that allows you to develop Java programs quickly and easily. Its main features are that it is:\n\n* **Simple** BlueJ has a deliberately smaller and simpler interface than professional environments like NetBeans or Eclipse. This allows beginners to get started more quickly, and without being overwhelmed.\n* **Designed** for teaching BlueJ is deliberately designed with good pedagogy in mind. There is a popular textbook designed for teaching introductory university/college courses with BlueJ, and a site full of teaching resources.\n* **Interactive** BlueJ allows you to interact with objects. You can inspect their value, call methods on them, pass them as parameters and more. You can also directly invoke Java expressions without compiling. Thus BlueJ is a powerful graphical shell/REPL for Java.\n* **Portable** BlueJ runs on Windows, Mac OS X, Linux and other platforms which run Java. It can also run without installation from a USB stick.\n* **Mature** BlueJ is over fifteen years old, but continues to be updated and supported by a full-time team. We aim to respond to all technical support requests within one working day.\n* **Innovative** BlueJ has several features not seen before in other IDEs. Its object bench, code pad, and scope colouring were all original BlueJ features.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@48b2855247b0e422e994f50e85b9bf8c8ca98c79/automatic/bluej/screenshot.png)\n\n## Notes\n\n* BlueJ requires a Java 11+ JDK which is bundled with the install.\n* Current versions of BlueJ provide 64-bit support only - for a 32-bit operating system use [BlueJ 4.1.4](https://chocolatey.org/packages/bluej/4.1.4).\n\n  ```powershell\n  choco install bluej --version 4.1.4\n  choco pin pin add -n=bluej --version 4.1.4\n  ```\n\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T23:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/bluej/5.3.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bluej/5.3.0", "licenseUrl": "https://www.bluej.org/LICENSE.txt", "packageName": "bluej", "displayName": "BlueJ - Beginners Java Development Environment", "summary": "Beginners Java development environment that allows you to develop Java programs quickly and easily", "version": "5.3.0", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@ec1652f85e86682fba61efdbeb5a556dd6ad0284/icons/bluej.png", "author": "Michael Kölling", "downloadCount": 22036, "tags": ["bluej", "java", "ide"]}