{"description": "BOUML is a UML tool box allowing you to specify and generate code in C++, Java, Php, Python, MySQL and IDL.\n\t\t\t\n\t\t\tThe main key points of BOUML are :\n\t\t\t\n\t\t\t - it is again a free software since the release 7.0\n\t\t\t\n\t\t\t - it runs under Linux, MacOS X and Windows\n\t\t\t\n\t\t\t - it allows to program simultaneously in C++, Java, Php, Python and IDL\n\t\t\t\n\t\t\t - thank to a full access to the generated forms, you are the master and you decide what must be generated\n\t\t\t\n\t\t\t - it is extensible, and the external tools (I name them plug-out because they are executed outside BOUML) may be developed in C++ or Java, using BOUML for their definition as any other program (clearly I do not like very much language like Visual Basic, and I do not understand how this one can be imposed in a UML environment !)\n\t\t\t\n\t\t\t - it is fast and doesn't need a lot of memory to manage several thousands of classes, see benchmark\n\t\t\t\n\t\t\tThe initial reasons inciting me to develop BOUML was mainly : the pleasure to develop freely a tool and I hope to see it used by many people (I already had this very pleasant experience with two friends for Xcoral), and frankly a reaction to the very expensive price of the commercial UML tools.\n\t\t\t\n\t\t\tDue to license violations, attacks and insults from people of wikipedia (the worst of them were the administrators Bapti, Dereckson and Esby), I have decided to stop the free version of Bouml (the release 4.23 was the last free version of the first sequence), and to move to the non free version starting by the 5.0, upto the 6.12\n\t\t\t\n\t\t\tFinaly end of May 2017 I decided to distribute again BOUML as a free software\n\t\t\t\n\t\t\tThe implementation of BOUML since the 5.0 is based on Qt version 4, while the previous versions of BOUML was based on Qt 3 / 2.4.\n\t\t\t\n\t\t\tThe documentation is written with OpenOffice.org writer, many thanks for this powerful and pleasant office suite. The screen copies are made with Ksnapshot and sometimes modified by Le Gimp to have burred areas, thanks to the authors for these practical tools.\n\t\t\t\n\t\t\tSome of the examples given in this documentation spoke about the organs, describing an organ is very easy for me in French ... not in English ! I get the English translation of the words associated to the organs from a Marya J. Fancey documentation, thanks to her.\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\tLicense\n\t\t\tSince the release 7.0 bouml/bouml.exe are free of use.\n\t\t\t\n\t\t\tThe releases of bouml/bouml.exe from the 5.0 up to the 6.12 was not free, to use them you needed to buy a license, and to run them on a host at a date autorized by this license. I don't manage any more these versions.\n\t\t\t\n\t\t\tThe code generators/reverse/roundtrip more projectControl and projectSynchro are free of use.\n\t\t\t\n\t\t\tThe other plug-outs are free; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version.\n\t\t\t\n\t\t\tThe code generated for the plug-outs is under the term of the GNU General Public License because it contains the API sources. In the other cases the code generated by BOUML is usable without any restriction (i.e. no license).\n\t\t\t\n\t\t\tCopying and distribution of the documentation or a part of the documentation and screenshots is permitted in any medium, provided a mention of Bouml or https://www.bouml.fr\n\t\t\t\n\t\t\tThe versions of bouml and associated tools older prior the 5.0 are free; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version. I don't manage any more these versions.\n\t\t\t\n\t\t\tCopyright © 2004-2018 by Bruno Pagès.\n\t\t\t\n\t\t\tBOUML is distributed on the Internet at http://www.bouml.fr/", "updated": "2024-03-23T21:33:37Z", "galleryUrl": "https://community.chocolatey.org/packages/bouml/7.9.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bouml/7.9.1", "licenseUrl": "https://www.bouml.fr/legal-mentions.html", "packageName": "bouml", "displayName": "Bouml (Install)", "summary": "BOUML is a free UML 2 tool box including a modeler allowing you to specify and generate code in C++, Java, Idl, Php, Python and MySQL.", "version": "7.9.1", "icon": "https://www.bouml.fr/images/bouml_logo.png", "author": "Bruno_Pagès", "downloadCount": 756, "tags": ["bouml", "uml"]}