{"description": "*German version below*\nThe version of the broadband measurement that can be installed as a desktop app allows you to determine the performance of your Internet access and, at the same time, to check the data transfer rates contractually agreed with your provider in the fixed network.\n\nTo do this, you can first perform a single measurement using the desktop app. The single measurement is equally designed for measurements of connections with low data transfer rates up to gigabit connections. The measurement results are saved in the app and can therefore be viewed at any time.\n\nIf the result of the individual measurement indicates that your provider's download performance is not in compliance with the contract, you can use the desktop app verification procedure. As part of the verification procedure, a minimum of 20 measurements are carried out as a measurement campaign. The proof can be used in the argumentation towards the provider.\n\nIn the [generally understandable description](https://download.breitbandmessung.de/bbm/Beschreibung-Die_Desktop-App_der_Breitbandmessung_aus_Sicht_des_Nutzers.pdf) detailed information about the desktop app is compiled and the technical specification presents in detail the technical structure and technical processes of the measurement system and measurement procedure. The desktop app was developed by zafaco GmbH on behalf of the Federal Network Agency. \n\n*English version above*\nDie als Desktop-App installierbare Version der Breitbandmessung ermöglicht Ihnen die Ermittlung der Leistung Ihres Internetzugangs und zugleich die Überprüfung der mit Ihrem Anbieter vertraglich vereinbarten Datenübertragungsraten im Festnetz.\n\nHierfür können Sie zunächst mittels Desktop-App eine Einzelmessung durchführen. Die Einzelmessung ist gleichermaßen für Messungen von Anschlüssen mit geringen Datenübertragungsraten bis hin zu Gigabitanschlüssen ausgelegt. Die Messergebnisse werden in der App gespeichert und können somit jederzeit wieder eingesehen werden.\n\nGibt das Ergebnis der Einzelmessung Anhaltspunkte für eine nicht vertragskonforme Leistung Ihres Anbieters im Download, steht Ihnen das Desktop-App-Nachweisverfahren zur Verfügung. Im Rahmen des Nachweisverfahrens erfolgt die Durchführung einer Mindestanzahl von 20 Messungen als Messkampagne. Der Nachweis kann in der Argumentation gegenüber dem Anbieter genutzt werden.\n\nIn der [allgemeinverständlichen Beschreibung](https://download.breitbandmessung.de/bbm/Beschreibung-Die_Desktop-App_der_Breitbandmessung_aus_Sicht_des_Nutzers.pdf) sind detaillierte Informationen rund um die Desktop-App zusammengestellt und die technische Spezifikation stellt ausführlich den technischen Aufbau und die technischen Abläufe von Messsystem und Messverfahren dar. Die Desktop-App wurde von der zafaco GmbH im Auftrag der Bundesnetzagentur entwickelt.", "updated": "2024-03-20T20:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/breitbandmessung/3.6.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/breitbandmessung/3.6.0", "licenseUrl": "https://breitbandmessung.de/lizenzen", "packageName": "breitbandmessung", "displayName": "Breitbandmessung", "summary": "Die als Desktop-App installierbare Version der Breitbandmessung ermöglicht Ihnen die Ermittlung der Leistung Ihres Internetzugangs und zugleich die Überprüfung der mit Ihrem Anbieter vertraglich vereinbarten Datenübertragungsraten im Festnetz.", "version": "3.6.0", "icon": "https://cdn.statically.io/gh/jonasw234/au-packages/master/breitbandmessung/favicon.png", "author": "zafaco GmbH", "downloadCount": 1265, "tags": ["breitbandmessung", "internet", "anbieter", "streitbeilegung", "nachweis", "bandbreite", "geschwindigkeit"]}