{"description": "With Bug Shooting, creating screen captures and sending them to various bug tracking and issue management systems, e-mail, image editing and instant messaging applications is done in a breeze.\n\n# Intelligent capture mode\n- With the intelligent capture mode, it is as simple as never before to capture the screen. You can capture an area, a window, or the full screen, without having to change the capture mode. Try it out, you will love it.\n- Magnifier supports you during the capture and allow pixel-fine region selection.\n\n# Edit functions\n- Create professional graphics by adding different effects to your screenshots. Add text, arrows or other graphics.\n- The tool gallery gives you easy and quick access to frequently used tools. The gallery may be adapted to your needs.\n- Screenshots sometimes contain secret information (e.g. passwords) that should not be passed on. With the blur tool you can hide such information by blurring them so they cannot be recognized.\n\n# Share screenshots\n- Send your Screenshots directly to different applications (Outputs). Bug Shooting supports many Outputs, such as bug tracking and issue management systems, e-mail, image editing and instant messaging applications. Following applications are supported:\n    FogBugz, Gemini, OnTime, BugTracker.NET, Mantis BT, Done.Done., JIRA, Bugzilla, SpiraTest, elementool, Unfuddle, informUp, BugNET, BUGtrack, YouTRACK, Assembla, ImageShack, Twitpic, Abload.de, Skype, Lync 2010, Default Email Client, Gimp, MS Outlook, MS Word, MS Excel, MS Paint, Thunderbird, FTP, Command line\n- Of course, you can save your graphics in various image file format and print them as well.\n\n# Other functions\n- Bug Shooting automatically storage the captured screenshots and the edited graphics in a library. This provides you with quick access to your captures.\n- Bug Shooting provide functions for direct storage of screenshots on the hard drive or for sending these to an Output without editing the screenshot in the editor.\n- Bug Shooting provides an API (Application Programming Interface ) for creation of custom Outputs. See the documentation of the Output API here.\n\n# Free for personal use\n- The free license is only usable in a personal and non-commercial context. Commercial use of Bug Shooting requires the purchasing of an commercial license.\n    http://www.bugshooting.com/Home/LicensePersonal", "updated": "2024-03-23T19:03:32Z", "galleryUrl": "https://community.chocolatey.org/packages/bugShooting/2.12.4.744", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bugShooting/2.12.4.744", "licenseUrl": "http://www.bugshooting.com/Home/LicenseAgreement", "packageName": "bugShooting", "displayName": "Bug Shooting", "summary": "With Bug Shooting, creating screen captures and sending them to various bug tracking and issue management systems, e-mail, image editing and instant messaging applications is done in a breeze.", "version": "2.12.4.744", "icon": "https://cdn.rawgit.com/jschell/chocolateyPkgs/master/bugShooting/bugShooting-logo.png", "author": "Alexej Hirsch", "downloadCount": 2039, "tags": ["bugShooting", "bug", "shooting", "screenCapture", "capture", "screen"]}