{"description": "Bulk Crap Uninstaller is a free (as in speech) program uninstaller. It excels at removing large amounts of applications with minimal user input. It can clean up leftovers, detect orphaned applications, run uninstallers according to premade lists, and much more!\n\nEven though BCU was made with IT pros in mind, by default it is so straight-forward that anyone can use it effortlessly! \n\n## Features\n\n### Detect, manage and quietly uninstall\n\n* Normal registered applications (same as Programs and Features and many other uninstallers)\n* Hidden/protected registered applications\n* Applications with damaged or missing uninstallers\n* Portable applications (might have to point BCU where to look)\n* Chocolatey packages\n* Oculus games/apps\n* Steam games/apps\n* Windows Features\n* Windows Store apps (Universal Windows Platform apps)\n* Windows Updates\n\n### Fast, automatic uninstall\n\n* Uninstall any number of applications in a single batch\n* Minimal to no user input is required during uninstallation\n* Uninstall multiple items at once to speed up the process (with collision prevention)\n* Console interface can automatically uninstall applications based on conditions with no user input\n* Quietly uninstall many uninstallers that don’t support silent uninstallation\n* Uninstall applications even if they don’t have any uninstallers\n* Uninstall applications by window, shortcut or directory\n* Can handle crashing and hanging uninstallers\n\n### Other features\n\n* Find and remove leftovers after uninstallation\n* Clean Program Files directories from unused or empty folders\n* Manually uninstall any application, bypasing it’s uninstaller (Force uninstall)\n* Startup manager\n* Application ratings\n* Huge amount of data about applications is collected and displayed. User can freely browse, filter and export everything\n* Filtering with common presets or based on fully custom rules with Regex support\n* Verification of uninstaller certificates\n* Large amount of configurability\n* Can run user-specified commands before and after uninstalling\n* Can run on .Net 4.0 or newer, or, if not available, on .Net 3.5 with reduced functionality\n* Fully portable, settings are saved to a single file\n\n![screenshot](https://cdn.rawgit.com/chocolatey/chocolatey-coreteampackages/1a2d3e36282f7987cebec6644caa277c7290f169/automatic/bulk-crap-uninstaller/screenshot.png)", "updated": "2024-03-23T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/bulk-crap-uninstaller/5.7.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/bulk-crap-uninstaller/5.7.0", "licenseUrl": "https://github.com/Klocman/Bulk-Crap-Uninstaller/blob/master/Licence.txt", "packageName": "bulk-crap-uninstaller", "displayName": "Bulk Crap Uninstaller", "summary": "Bulk Crap Uninstaller is an open source program uninstaller.", "version": "5.7.0", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@11b6ffab0e41ca0e687b1202046aa0248682e8be/icons/bulk-crap-uninstaller.png", "author": "Marcin Szeniak", "downloadCount": 127440, "tags": ["uninstaller", "uninstall", "bulk", "admin", "foss"]}