{"description": "Burp Suite is an integrated platform for performing security testing of web applications. Its various tools work seamlessly together to support the entire testing process, from initial mapping and analysis of an application's attack surface, through to finding and exploiting security vulnerabilities.\n\nBurp gives you full control, letting you combine advanced manual techniques with state-of-the-art automation, to make your work faster, more effective, and more fun.\n\nBurp Suite Community Edition contains the following key components:\n- An intercepting Proxy, which lets you inspect and modify traffic between your browser and the target application.\n- An application-aware Spider, for crawling content and functionality.\n- A Repeater tool, for manipulating and resending individual requests.\n- A Sequencer tool, for testing the randomness of session tokens.\n- Extensibility, allowing you to easily write your own plugins, to perform complex and highly customized tasks within Burp.\n\nBurp is easy to use and intuitive, allowing new users to begin working right away. Burp is also highly configurable, and contains numerous powerful features to assist the most experienced testers with their work.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/burp-suite-free-edition/2022.12.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/burp-suite-free-edition/2022.12.4", "licenseUrl": "https://portswigger.net/burp/eula/community", "packageName": "burp-suite-free-edition", "displayName": "Burp Suite Community Edition", "summary": "Burp Suite is an integrated platform for performing security testing of web applications.", "version": "2022.12.4", "icon": "https://raw.githubusercontent.com/agabrys/chocolatey-packages/master/manual/burp-suite-free-edition/icon.png", "author": "PortSwigger Ltd.", "downloadCount": 179601, "tags": ["burp-suite", "proxy", "security", "testing", "web-applications", "freeware"]}