{"description": "DeDRM is a plugin for [Calibre](https://calibre-ebook.com) that removes DRM from ebooks as they are imported into Calibre.\n\nThe DeDRM plugin can remove DRM from Kindle eBooks (but not rented Kindle ebooks, books downloaded to a Kindle Fire,\nKindle for iOS or the Windows Store Kindle App), Barnes & Noble ePub ebooks (but not books downloaded to the Windows\nStore Nook App) , any ebooks using Adobe Digital Editions DRM (this includes ePubs from Kobo and Sony that are\ndownloaded for Adobe Digital Editions), and the older Mobipocket and eReader ebooks.\n\nThere are two Calibre plugins installed: DeDRM and Obok. The DeDRM plugin handles books that use Amazon DRM, Adobe\nDigital Editions DRM (version 1), Barnes & Noble DRM, and some historical formats. The Obok plugin handles Kobo DRM.\n\nTo use the plugin, simply import DRMed ebooks into Calibre, and the DRM will be removed. If ebooks have already been\nimported into Calibre, they will need to be removed and imported again to remove the DRM.\n\n## Anti-Piracy Notice\n\nPlease only use these tools for gaining full access to your own ebooks for archiving/conversion/convenience. De-drmed\nebooks should not be uploaded to open servers, torrents, or other methods of mass distribution. Authors, retailers\nand publishers all need to make a living, so that they can continue to produce books for us to read. Don’t be a\nparasite.\n\n## Notes\n\n* The [icon](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@5dfbb270aae8af37c0dd9041d47bed6ceb5f4695/icons/calibre-dedrm.png) used for the\n  package was produced by the [Free Software Foundation](https://www.fsf.org) and is used as-is under the provisions\n  of the [Creative Commons Attribution-ShareAlike 3.0 Unported License](http://creativecommons.org/licenses/by-sa/3.0/).\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/calibre-dedrm/10.0.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/calibre-dedrm/10.0.3", "licenseUrl": "https://www.gnu.org/licenses/gpl-3.0.html", "packageName": "calibre-dedrm", "displayName": "DeDRM - Calibre DRM Removal Plugin", "summary": "A Calibre plugin to remove DRM from eBooks", "version": "10.0.3", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@5dfbb270aae8af37c0dd9041d47bed6ceb5f4695/icons/calibre-dedrm.png", "author": "DeDRM Contributors", "downloadCount": 7742, "tags": ["dedrm", "ebook", "obok", "drm", "drm-removal", "calibre", "plugin", "calibre-plugin"]}