{"description": "Make Amazing Videos with the Camtasia Video Editor.\nCamtasia makes video editing surprisingly easy. The drag-and-drop editor and video assets help you complete your videos faster. No video experience needed.\n\nIf you need a previous version, [download it](https://www.techsmith.com/download/oldversions).\n\n* SCREEN RECORDER\n Record any part of your screen, down to the pixel.\n\n* WEBCAM\n Webcam lets you add a personal touch to your video.\n\n* MEDIA\n Import images, audio, and video up to 4K resolution.\n\n* MULTI-TRACK TIMELINE\n Build your videos quickly with multiple tracks for images, video, text, and audio.\n\n* ANNOTATIONS\n Arrows, callouts, shapes, and more help you get your point across.\n\n* TRANSITIONS\n Add an intro/outro to the beginning or end of a clip, image, shape, or text.\n\n* ANIMATIONS\n Zoom, pan, or create your own custom motion effects.\n\n* VOICE NARRATION\n A great way to add context to what you’re showing.\n\n* AUDIO EFFECTS\n Add audio effects to recordings, music, or narration to enhance your video.\n\n* VISUAL EFFECTS\n Adjust colors, add a drop shadow, change the clip speed, and more.\n\n* INTERACTIVITY\n Add quizzes to see who is watching your videos, and how much they've viewed.\n\n* GREEN SCREEN\n Put yourself in your video making it appear like you're right in the action.\n\n# Parameters:\n\n* /licensekey:ABCD-EFGH-IJKL\n Registered license key. If this is missing a 30 day trial is installed.\n\n* /licensename:\"\"Joe Bloggs\"\"\n Registered name for the license. Can only be used if a /licensekey is specified\n\n* /nodesktopshortcut\n Does not install an application shortcut on the desktop.\n\nExample: **-params='\"/licensekey:ABCD-EFGH-IJKL /licensename:\"\"Joe Bloggs\"\" /nodesktopshortcut\"'**\n\n**NOTE**: TechSmith seem to be okay with releasing a new version of the same version. This throws out the checksum of the package. If you find this happening, please raise an issue at https://github.com/pauby/chocopackages/issues. Thanks.\n\n**NOTE**: This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T00:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/camtasia/2023.4.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/camtasia/2023.4.4", "licenseUrl": "", "packageName": "camtasia", "displayName": "Camtasia (Install)", "summary": "Camtasia makes video editing surprisingly easy. The drag-and-drop editor and video assets help you complete your videos faster. No video experience needed.", "version": "2023.4.4", "icon": "https://cdn.jsdelivr.net/gh/pauby/ChocoPackages@2b1fa4d7/icons/camtasia.jpg", "author": "Techsmith", "downloadCount": 38139, "tags": ["camtasia", "admin", "video", "screen", "recording"]}