{"description": "Cantata is a graphical client for MPD. It contains the following features:\n\nCantata started off as a fork of QtMPC, mainly to provide better KDE integration - by using KDE libraries/classes wherever possible. However, the code (and user interface) is now *very* different to that of QtMPC, and both KDE and Qt (Linux) builds have the same feature set. Also, as of 1.4.0, by default Cantata is built as a Qt-only application (with no KDE dependencies).\n\nUnlike most other MPD clients, Cantata caches a copy of the MPD music library. This is so that it can create a proper hierarchy of artists and albums (where Cantata will use the AlbumArtist tag if found, otherwise it will fallback to the Artist tag), to provide album counts, tracks counts, etc in the browser\nviews and tooltips, and also to help with copying songs to/from devices.\n\n## Features\n\n- Support for Qt4, Qt5, KDE, MacOSX, and Windows.\n- Multiple MPD collections.\n- Highly customisable layout.\n- Songs grouped by album in play queue.\n- Context view to show artist, album, and song information of current track.\n- Simple tag editor.\n- File organizer - use tags to organize files and folders.\n- Ability to calculate ReplyGain tags. (Linux only, and if relevant libraries installed)\n- Dynamic playlists.\n- Online services; Jamendo, Magnatune, SoundCloud, and Podcasts.\n- Radio stream support - with the ability to search for streams via TuneIn, ShoutCast, or Dirble.\n- USB-Mass-Storage and MTP device support. (Linux only, and if relevant libraries installed)\n- Audio CD ripping and playback. (Linux only, and if relevant libraries installed)\n- Playback of non-MPD songs - via simple in-built HTTP server if connected to MPD via a standard socket, otherwise filepath is sent to MPD.\n- MPRISv2 DBUS interface.\n- Support for KDE global shortcuts (KDE builds), GNOME media keys (Linux only), and standard media keys (via Qxt)\n- Ubuntu/ambiance theme integration - including dragging of window via toolbar.\n- Basic support for touch-style interface (views are made 'flickable').\n- Scrobbling.\n- Ratings support.\n\n![screenshot](https://rawgit.com/majkinetor/au-packages/master/cantata/screenshot.png)", "updated": "2024-03-20T02:48:34Z", "galleryUrl": "https://community.chocolatey.org/packages/cantata/2.3.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/cantata/2.3.2", "licenseUrl": "https://github.com/CDrummond/cantata/blob/master/LICENSE", "packageName": "cantata", "displayName": "Cantata", "summary": "Cantata is a graphical client for music player daemon (mpd)", "version": "2.3.2", "icon": "https://rawgit.com/majkinetor/au-packages/master/cantata/icon.png", "author": "Craig Drummond", "downloadCount": 4249, "tags": ["foss", "cross-platform", "audio", "mp3", "radio", "media", "player", "multimedia", "mpd"]}