{"description": "CellProfiler is a free open-source software designed to enable biologists without training in computer vision or programming to quantitatively measure phenotypes from thousands of images automatically.\n\nCellProfiler is designed to serve biologists as well as bioimage analysts who want a flexible system that is easy to deploy to collaborators who lack computational skills. It is commonly used for small-scale experiments involving a few images but is also routinely run on millions of images using cluster or cloud computing resources at some of the largest pharmaceutical companies and academic screening centers in the world.\n\nWe curate the overwhelming number of computer-vision algorithms to a small number that are robust, powerful, and well-suited to biological problems. We translate computer vision techniques into language familiar to biologists. The software uses a pipeline workflow, with modules that map to biologists’ goals. Once a pipeline is configured, most analyses are fully automated. We focus on components applicable to many biologists’ use cases rather than heavily customized to unique experimental setups. We provide sensible defaults, example pipelines, extensive documentation, and an active Q&A forum to get new users up and running quickly. We enable convenient workflows by making connections with other bioimaging software.\n\n![screenshot](https://cdn.jsdelivr.net/gh/ITS-Unibas/chocolatey-community-packages@main/automatic/cellprofiler/screenshot.png)", "updated": "2024-03-23T18:48:26Z", "galleryUrl": "https://community.chocolatey.org/packages/cellprofiler/4.2.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/cellprofiler/4.2.6", "licenseUrl": "https://github.com/CellProfiler/CellProfiler/blob/master/LICENSE", "packageName": "cellprofiler", "displayName": "CellProfiler", "summary": "CellProfiler is a free open-source software designed to enable biologists without training in computer vision or programming to quantitatively measure phenotypes from thousands of images automatically.", "version": "4.2.6", "icon": "https://cdn.jsdelivr.net/gh/ITS-Unibas/chocolatey-community-packages@master/icons/cellprofiler.png", "author": "Broad Institute", "downloadCount": 891, "tags": ["cellprofiler", "admin", "foss"]}