{"description": "![Screenshot of Checker Plus for Gmail for Chrome](https://lh3.googleusercontent.com/iTEM192OWh44epk97ZcL3v7rLXMeUahrYqalVjaq9uJ0dm6LS05uvP8RLxyt9NMhyDktg3hLWdQ=s640-h400-e365-rw)\n\t\n###Get desktop notifications, read, listen or delete emails without opening Gmail or Inbox by Gmail and easily manage multiple accounts.\n• The fastest and easiest way to manage multiple email accounts\n• 5 star extension with great reviews!\n• Trusted developer of many extensions\n• 1 million satisfied users worldwide\n• Lots of features, options and updates\n• Extensive FAQs and personal tech support with very quick responses\n• Safer. Requires minimal permissions and only access to Google Mail's website\n• Can be used as an FVD Speed Dial widget\nClick \"Website\" or visit jasonsavard.com for more info.\n\n• Extra features are available upon contributing \"any\" amount.\n\n• Supports \"Inbox by Gmail\"\n\n• Uses Material Design\n\n• I'll add your suggestions\n\n• See the people emailing you just like in the Gmail chat notification, with an option to show their contact photos or your assigned photos for them.\n\n• Voice notification: If you get an email while you're busy watching a movie or cooking dinner this extension can optionally read it out loud ie. \"Jason says, dinner at my place\". It's great for the visually impaired.\n\n• Option to monitor any Gmail or custom labels\n\n• Option to run in this notifier in the background when Google Chrome is closed and still get new email alerts\n\n• Popup mail preview window to read, archive, mark as read or delete emails without leaving the current tab (or option to go directly to your Gmail tab)\n\n• Supports the offline view\n\n• Can also be used as a widget for the extension \"Awesome New Tab Page\" (ANTP) which supports multiple accounts\n\n• Desktop sound or voice notifications when new mail arrives (or add your own sounds)\n\n• Support for multiple Gmail and Google Apps accounts\n\n• You change the generated voice by adding TTS (text to speech) voice extensions\n\t\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-16T23:05:42Z", "galleryUrl": "https://community.chocolatey.org/packages/checkerplusforgmail-chrome/19.3.8", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/checkerplusforgmail-chrome/19.3.8", "licenseUrl": "https://jasonsavard.com/wiki/Terms_of_Service", "packageName": "checkerplusforgmail-chrome", "displayName": "Checker Plus for Gmail™ for Chrome", "summary": "Checker Plus for Gmail Chrome extension", "version": "19.3.8", "icon": "https://lh4.googleusercontent.com/G39bQlsJZNO-LaQvUAGVqmlSO3FD5VHF0iGhC31zDRJ0EF5HU_xVBAas4CznBYyW1J4hwd2RM6s=s26-h26-e365-rw", "author": "Jason Savard", "downloadCount": 1412, "tags": ["jasonsavard", "checker", "plus", "gmail", "chrome", "extension"]}