{"description": "---\n\n### [choco://choco-cleaner](choco://choco-cleaner)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://community.chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of Choco-Cleaner](https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/choco-cleaner/choco-cleaner_screenshot.png)\n\n## DO YOU WANT TO RECOVER SOME DISK SPACE USED BY UNNECESSARY RESIDUAL CHOCOLATEY FILES? \n\n## YOU JUST FOUND THE EASY WAY!\n\n#### This package creates a Windows Scheduled Task to run Choco-Cleaner.ps1 every Sunday at 11:00 PM.\n\n## **BEFORE and AFTER Choco-Cleaner: (198 packages installed and does not include temp folder deletions.)**\n![schreenshot of files and diskspace  before Choco-Cleaner](https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/choco-cleaner/choco-cleaner_before.png) ![screenshot of files and diskspace after choco-cleaner](https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/bd713cc4/choco-cleaner/choco-cleaner_after.png)\n\n**Sure, you're probably not going to get gigabytes of space back, but every few KB matters on some computers and to some people! Due to [slack space](https://www.computerhope.com/jargon/s/slack-space.htm) small files such as 6 byte .ignore files actually take up 4 KB of HDD space each.**\n\n## FEATURES:\n\nSet it and forget it! **Choco-Cleaner** cleans up your Chocolatey installation every Sunday at 11 PM in the background so you don't have to be bothered with it.\n\n**Choco-Cleaner** is completely configurable, just run **Choco-Cleaner -EditConfig** and read the comments. Most options are enabled by default.\n\t\n**Choco-Cleaner deletes:**\n\n* .log files that are not the most current one (NOT default)\n* .zip and various archive files left over from packages that forgot to delete them post install\n* .zip.txt and other archive-extensions.txt are lists of files that were extracted from an archive file for installation (NOT default)\n* .msi, .msu, and .msp are Microsoft intall packages left over from packages that forgot to delete them post install\n* .ignore files that are created to not shim executables during package install but not needed after shim operations are finished (This may change in a future version of Chocolatey.)\n* credits.txt are program credits (of contributors) files you can read on the web\n* readme.txt files you can read on the web\n* .md files are usually markdown readme files that you can read on the web\n* .old files are Chocolatey files that have been replaced by newer versions (exe's and dll's mostly)\n* chocolatey.config.backup is a backup of your chocolatey.config file\n* _processed.txt - I have no idea what made this file or why it exists\n* lib-bad holds packages that failed to install and lib-bkp contains previous package versions during upgrades\n* lib-synced holds packages installed by the (licensed versions) choco sync feature (NOT default)\n* archives and executables out of .nupkg files which are ZIP archives with NuGet package information - this is similar to what [Package Reducer](https://chocolatey.org/docs/features-package-reducer) does\n* \\users\\username\\AppData\\Local\\Temp\\chocolatey is where new package files are downloaded to during pre-installation (if you haven't changed your cacheLocation in chocolatey.config)\n* files in cacheLocation if set in chocolatey.config\n* \\users\\username\\AppData\\Local\\Nuget\\Cache if Nuget client is installed and caching files there\n* \\Windows\\Temp\\chocolatey \n* license.txt and verification.txt files are included when packages include binaries, you can read them on the package web page, programname.license.txt files are license files for Chocolatey default tools (NOT default)\n* orphaned shim files for programs that no longer exist\n* orphaned package install snapshot files found in the .chocolatey folder\n\n**If you find Choco-Cleaner useful, and I suspect you will, please consider donating: https://www.paypal.me/bcurran3donations or become a patron at https://www.patreon.com/bcurran3**", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/choco-cleaner/1.1.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/choco-cleaner/1.1.1", "licenseUrl": "https://www.gnu.org/licenses/gpl.html", "packageName": "choco-cleaner", "displayName": "(unofficial) Choco Cleaner (Script + Task)", "summary": "choco-cleaner - deletes unnecessary residual Chocolatey files to free up disk space", "version": "1.1.1", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/choco-cleaner/choco-cleaner_icon.png", "author": "bcurran3", "downloadCount": 968225, "tags": ["bcurran3", "unofficial", "choco", "cleaner", "cleanup", "schtasks", "scheduled", "task"]}