{"description": "![Screenshot of Chrono Download Manager](https://www.chronodownloader.net/img/shots/man_pop.png)\t\n\t\nChrono Download Manager is the first (and only) full-featured download manager for Google Chrome. All your download management is done inside a browser tab instead of by installing a separate download managing application. Chrono is tightly integrated with Chrome by context menus, toolbar buttons and key shortcuts.\t\n\nBesides download management, Chrono is also your best video download helper and bulk image downloader. The Chrono Sniffer detects all links, images, audios and videos on a webpage, and you can filter URLs by their file types or by Regular Expression.\n\nStart downloading with Chrono today! Have fun playing with it, and don't forget to share!\n\n\n##FEATURES\n* Totally override the Chrome's default download manager (e.g. Ctrl-J brings out Chrono Download Manager), and get rid of the Downloads Shelf(bar).\n* Use table to organize your downloads compactly and efficiently.\n* Just one click to browse and manage your downloads from a popup list at anytime.\n* Queue/Pause/Resume/Restart/Search/Recycle your downloads.\n* Desktop notifications and sound notifications for download completion/interruption.\n* Enter multiple URLs at the same time and downthemall with one-click.\n\n##MORE ADVANCED FEATURES\n* Highly customizable task filters let you group downloads by type, date, url etc.\n* Batch descriptors help you download a range of URLs with pattern painlessly.\n* Naming Mask determines a file name for your download automatically by URL host name, sub-directories, referrer, date/time and many more.\n* Rule System uses programmable rules to set naming masks automatically for different downloads, and to route your files to different folders.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/chrono-chrome/readme.md)**\n\n***\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n***", "updated": "2024-03-16T23:05:42Z", "galleryUrl": "https://community.chocolatey.org/packages/chrono-chrome/0.10.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/chrono-chrome/0.10.0", "licenseUrl": "", "packageName": "chrono-chrome", "displayName": "Chrono Download Manager for Chrome", "summary": "Chrono Download Manager - Download and manage the Web!", "version": "0.10.0", "icon": "https://www.chronodownloader.net/img/mobile-promo.png", "author": "www.chronodownloader.net", "downloadCount": 3136, "tags": ["chrono", "download", "manager", "chrome", "extension"]}