{"description": "Chromas is a free trace viewer for simple DNA sequencing projects which do not require assembly of multiple sequences. \n\n![Chromas](https://technelysium.com.au/wp/wp-content/uploads/Chromas.png)  \n\n#### Features:\n\n* Opens .ab1 chromatogram files from Applied Biosystems DNA sequencers.\n* Opens SCF and ZTR format chromatogram files created by other sequencers or retrieved from databases.\n* Save in .scf or Applied Biosystems .ab1 format.\n* Print a chromatogram with options to zoom or fit to one page.\n* Automatic removal of low-quality sequence (when quality data is available) or vector sequences.\n* Export sequences in plain text, FASTA, FASTQ, EMBL, GenBank or GCG formats, or formatted with base numbering for presentation.\n* Copy the sequence to the clipboard in plain text, FASTA or FASTQ format for pasting into other applications.\n* Reverse and complement the sequence and chromatogram.\n* Search for subsequences by exact matching or optimal alignment.\n* Display translations in 3 frames along with the sequence.\n* Copy an image of a chromatogram section for pasting into documents or presentations.\n* Batch processing, including format conversion, sequence export with vector removal, batch printing and batch export of raw data.\n* Enhance .ab1 files using the PeakTrace RP component from Nucleics Pty Ltd to improve peak readability and extract more high-quality bases.\n\nChromas is free of charge. The *PeakTrace RP* component requires registration for a free account, and is a paid service after the 40 free units have been used. An introductory discount is available by following the [link under the Options menu](https://www.nucleics.com/buy-peaktrace-for-chromas/) in Chromas.", "updated": "2024-03-20T19:18:43Z", "galleryUrl": "https://community.chocolatey.org/packages/chromas/2.6.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/chromas/2.6.6", "licenseUrl": "https://raw.githubusercontent.com/teknowledgist/Chocolatey-packages/master/automatic/chromas/tools/LICENSE.txt", "packageName": "chromas", "displayName": "Chromas", "summary": "Trace viewer for simple DNA sequencing", "version": "2.6.6", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@dbcca1de66271ed0fa01a07f297bb2eb04a0c9d2/Icons/chromas_icon.png", "author": "Technelysium", "downloadCount": 2593, "tags": ["chromas", "trace", "sequence", "DNA", "chromatogram", "biosystems", "embedded"]}