{"description": "This project provides extensions to four core areas; Environment, Exploration, Content and Deployment. Enhancements to the Visual Studio environment include the new SharePoint References tab available on the Add Reference dialog, allowing you to easily reference any SharePoint assembly without searching the file system or GAC for it. Exploration extends the new SharePoint Explorer with advanced information about SharePoint sites such as the installed Web Parts and Master Pages or the Feature dependencies and elements. Also included in the Explorer are a variety of import functions to bring existing SharePoint items into your active solution. The Content area includes advanced templates such as Linq to SharePoint, Custom Action or Delegate Control. Project templates include the SharePoint Full Trust Proxy and the SharePoint Console Application. Our enhanced Deployment functions give you the ability to utilise quick deployment and almost a dozen other productivity enhancing deployment steps, including automated deployment (per file on change deployment) Find the complete overview of all the CKS Development Tools Edition features on the Documentation tab.\n\nWith the release of Microsoft's excellent Visual Studio 2010 SharePoint Power Tools the CKSDev team have retired the Sandboxed Visual web part item template. For more information read Wouter's blog.", "updated": "2024-03-20T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/cksdevserver/2.4.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/cksdevserver/2.4.0.0", "licenseUrl": "http://cksdev.codeplex.com/license", "packageName": "cksdevserver", "displayName": "CKS Dev Server", "summary": "This project extends the Visual Studio 2010 SharePoint project system with advanced templates and tools. Using these extensions you will be able to find relevant information from your SharePoint.", "version": "2.4.0.0", "icon": "", "author": "Wes Hackett (CKSDev Team)", "downloadCount": 1741, "tags": ["SharePoint", "SP2007", "SP2010", "SP2013", "chocolatey", "cksdev"]}