{"description": "ClamAV® is an open-source (GPL) anti-virus engine used in a variety of situations, including email and web scanning, and endpoint security. It provides many utilities for users, including a flexible and scalable multi-threaded daemon, a command-line scanner and an advanced tool for automatic database updates.\n\n## Features\n\n* Command-line scanner.\n* Milter interface for sendmail.\n* Advanced database updater with support for scripted updates and digital signatures.\n* Virus database updated multiple times per day.\n* Built-in support for all standard mail file formats.\n* Built-in support for various archive formats, including ZIP, RAR, Dmg, Tar, GZIP, BZIP2, OLE2, Cabinet, CHM, BinHex, SIS and others.\n* Built-in support for ELF executables and Portable Executable files packed with UPX, FSG, Petite, NsPack, wwpack32, MEW, Upack and obfuscated with SUE, Y0da Cryptor and others.\n* Built-in support for popular document formats, including MS Office and MacOffice files, HTML, Flash, RTF and PDF.\n\n## Notes\n\n* This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T09:18:55Z", "galleryUrl": "https://community.chocolatey.org/packages/clamav/1.3.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/clamav/1.3.0", "licenseUrl": "https://github.com/Cisco-Talos/clamav/blob/main/COPYING.txt", "packageName": "clamav", "displayName": "ClamAV", "summary": "ClamAVÃ‚Â® is an open-source (GPL) anti-virus engine used in a variety of situations, including email and web scanning, and endpoint security. It provides many utilities for users, including a flexible and scalable multi-threaded daemon, a command-line scanner and an advanced tool for automatic database updates.", "version": "1.3.0", "icon": "https://cdn.jsdelivr.net/gh/pauby/ChocoPackages@f41d337/icons/clamav.png", "author": "The ClamAV Team", "downloadCount": 19254, "tags": ["foss", "cross-platform", "clamav", "antivirus"]}