{"description": "![ClickUp screenshot](https://cdn.statically.io/gh/asheroto/ChocolateyPackages/03093956/ClickUp-Official/screenshot.jpg)\n\n## Summary\n\nClickUp is an all-in-one productivity platform designed to consolidate and streamline your workflow. With an impressive array of functionalities housed in a user-friendly interface, ClickUp serves as a comprehensive solution for task management, project planning, and team collaboration.\n\n## Features\n\n- **Task Management:** With ClickUp, manage your tasks effectively and keep track of all your projects. From simple to-do lists to complex workflows, ClickUp has got you covered.\n- **Project Planning:** Use Gantt charts, Kanban boards, or a simple list view to see the big picture of your projects. Easily assign tasks, set deadlines, and monitor progress.\n- **Team Collaboration:** ClickUp is not just a task manager, it's a platform for collaboration. Share documents, chat with team members, set up meetings, and collaborate in real time.\n- **Multiple Views:** Catering to individual preferences, ClickUp supports multiple views such as list, board, box, and more. Each member can choose the view they find the most comfortable to work with.\n- **Integration:** ClickUp offers integration with a multitude of other services like Google Drive, Dropbox, Slack, and more. This means you can centralize your work even if it's spread across different platforms.\n- **Customizability:** From custom statuses to custom fields, ClickUp is fully adaptable to your team's needs and your project's requirements.\n\n## Notes\nThe ClickUp executable that is downloaded upon package installation uses the same URL for each version. That means that when ClickUp releases a new version, it breaks the checksum since the file is different. Because the EULA does not allow for distribution, the executable cannot be included in the package. Therefore, this package will break.\n\nThe package maintainer has a monitor that detects when the ClickUp version changes, and updates are usually released in a day or two following an update. However, approval times for Chocolatey packages can vary, so you may see a checksum error on this package when an update occurs.\n\n**Workarounds:**\n- Look under [Version History](https://community.chocolatey.org/packages/ClickUp-Official#versionhistory) and install the latest version with the `--version VERSION_NUMBER` argument.\n- Use the `--ignore-checksum` argument to install the latest approved version (ignore checksum not generally recommended).\n- Wait for the latest version to be approved.", "updated": "2024-03-23T21:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/ClickUp-Official/3.3.57", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ClickUp-Official/3.3.57", "licenseUrl": "https://clickup.com/terms", "packageName": "ClickUp-Official", "displayName": "ClickUp (official)", "summary": "ClickUp: An all-in-one productivity platform that centralizes task management, project planning, and team collaboration.", "version": "3.3.57", "icon": "https://cdn.statically.io/gh/asheroto/ChocolateyPackages/e7a0cb9e69990a17b97247459b260e0d5ab583f0/ClickUp/icon.png", "author": "ClickUp", "downloadCount": 849, "tags": ["clickup", "click", "up", "clickup.com", "project", "task", "organization", "organizer", "organize", "productivity", "tool", "management", "tracker", "collaboration", "teamwork"]}