{"description": "cloc counts blank lines, comment lines, and physical lines of source code in many programming languages.  Given two\nversions of a code base, cloc can compute differences in blank, comment, and source lines.  It is written entirely in\nPerl with no dependencies outside the standard distribution of Perl v5.6 and higher (code from some external modules\nis embedded within cloc) and so is quite portable.  cloc is known to run on many flavors of Linux, FreeBSD, NetBSD,\nOpenBSD, Mac OS X, AIX, HP-UX, Solaris, IRIX, z/OS, and Windows.\n\n## Features\n\n* Exists as a single, self-contained file that requires minimal installation effort---just download the file and run it\n* Can read language comment definitions from a file and thus potentially work with computer languages that do not yet exist\n* Allows results from multiple runs to be summed together by language and by project\n* Can produce results in a variety of formats: plain text, SQL, JSON, XML, YAML, comma separated values\n* Can count code within compressed archives (tar balls, Zip files, Java .ear files)\n* Has numerous troubleshooting options\n* Handles file and directory names with spaces and other unusual characters\n* Has no dependencies outside the standard Perl distribution\n* Runs on Linux, FreeBSD, NetBSD, OpenBSD, Mac OS X, AIX, HP-UX, Solaris, IRIX, and z/OS systems that have Perl 5.6 or higher\n* The source version runs on Windows with either ActiveState Perl, Strawberry Perl, Cygwin, or MobaXTerm+Perl plugin\n* On Windows one can run the Windows binary which has no dependencies\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@5666967194fd19b53cf4dbf35b22496b1997c1bc/automatic/cloc/screenshot.png)\n\n## Notes\n\n* Current versions of cloc provide 64-bit support only - for a 32-bit operating system use [cloc 1.84](https://chocolatey.org/packages/cloc/1.84).\n  \n  ```powershell\n  choco install cloc --version 1.84\n  choco pin add -n=cloc --version 1.84\n  ```\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T00:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/CLOC/2.00", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/CLOC/2.00", "licenseUrl": "https://github.com/AlDanial/cloc/blob/master/LICENSE", "packageName": "CLOC", "displayName": "Count Lines of Code (CLOC)", "summary": "Cloc counts blank lines, comment lines, and physical lines of source code in many programming languages", "version": "2.00", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@5666967194fd19b53cf4dbf35b22496b1997c1bc/icons/cloc.png", "author": "Al Danial", "downloadCount": 50562, "tags": ["loc", "sloc", "count", "lines", "code", "cloc"]}