{"description": "CMail is a freeware command line e-mail sending tool for Windows, primarily intended for sending scripted e-mail, but it is simple enough to be used interactively. If you are looking for an alternative to Blat with SSL support, or more control over message formatting, CMail may be a good choice.\n\nCMail is not intended to be a better Blat, it was developed to assist with testing mail server and content analysis software, and as such has evolved with a completely different feature set. While being very easy to use in its basic form, CMail provides advanced options for those who require them, allowing users to specify such things as the encoding mechanism for the message body and individual attachments, the types of authentication mechanisms to use, aliases for all recipients (similar software often doesn't support aliases, or can only send to a single user), and per-recipient Delivery Status Notification settings. Users can also control various aspects of the SMTP session, including enforcing the use of SSL/TLS where security is a consideration, setting the HELO/EHLO, adding custom headers, and mandating the use of IPv4 or IPv6.\n\n## Features\n\n- IPv6 support.\n- TLS/SSL via STARTTLS or SMTPS (SSL-enabled version). Built-in, stunnel not required.\n- Support for adding multipart/alternative HTML message bodies (UTF-8) and embedded images.\n- Delivery Status Notification and Message Disposition Notification (Read receipt) support.\n- SMTP authentication using CRAM-MD5, PLAIN, and LOGIN.\n- Message bodies using plain text, base64, or quoted printable encoding.\n- Unlimited attachments using base64, quoted printable, uuencoding or yEnc.\n- Wildcard attachment support to attach directory content.\n- Unlimited To/Cc/Bcc recipients, with aliases and DSN options for each if desired.\n- Read message body from command line, stdin or file.\n- Sending via SOCKS or HTTPS proxies.\n- Flexible configuration via files or the command line.\n- Written entirely in C - no need for .NET libraries, Java, or other prerequisites.\n- No installation required. Download, extract, use.\n- Free for private and commercial use.", "updated": "2024-03-23T19:03:32Z", "galleryUrl": "https://community.chocolatey.org/packages/cmail/0.8.10", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/cmail/0.8.10", "licenseUrl": "https://www.inveigle.net/cmail/faq.shtml", "packageName": "cmail", "displayName": "CMail", "summary": "A utility which is able to send email messages from the command line.", "version": "0.8.10", "icon": "", "author": "Inveigle.net", "downloadCount": 5774, "tags": ["cmail", "commandline", "email", "network", "console-only", "freeware"]}