{"description": "You need manually add path to CmdUtils to your PATH user environment variable.  \n\n    \tCmdUtils currently include:  \n\n    + Recycle, a safe replacement for the DEL command, that sends files to the recycle bin instead of deleting them. Recycle is also more flexible than DEL; you can specify multiple files at once (or use wildcards), and you can recycle whole directories at once (be careful!)  \n    + PropsFor, which displays the shell Properties dialog for all files (or folders, or drives) that you specify on the command line. PropsFor also accepts multiple files at once, either individually or as wildcards.  \n    + ContextMenu (context.exe), which displays the shell context menu for the specified file(s); from here, with one more step, you can get Properties, Quick View, or any other supported action for the specified file(s).  \n    + Bin (bin.exe), which manipulates the recycle bin. Caveat: it uses Windows functions that are not available unless you have Internet Explorer 4.0, Win98, or WinNT 5.0, and under Win98 they appear to be a bit buggy. So you can't even use bin unless you're running one of these recent Windows versions, and even then, if you run \"bin /empty\" and then cancel, \"bin /size\" may report that the bin is empty but this is not true, and \"bin /empty\" may not do anything at all. However \"bin /empty /force\" will still empty the recycle bin. This appears to be Windows' fault.  \n    + FixP, which fixes the command-line prompt under WinNT after you've run a 16-bit app. (It'll work under Win95, too, but it's totally unnecessary -- Win95 does this anyway.) Ever notice how, after you run a 16-bit app from a directory with a long filename, the prompt starts using the shortname? If you think this looks lame, just run fixp.  \n    + CmdUtils-Source.zip: full source code to all of the above.  \n\nFor more details, run each program with /? on the command line to list options and other information.", "updated": "2024-03-19T07:33:36Z", "galleryUrl": "https://community.chocolatey.org/packages/cmdutils/1.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/cmdutils/1.5", "licenseUrl": "", "packageName": "cmdutils", "displayName": "CmdUtils", "summary": "A collection of a few free utilities to make life at the Windows command line a bit easier and more flexible.", "version": "1.5", "icon": "https://cdn.rawgit.com/Kristinita/SashaChocolatey/master/icons/CmdUtils.png", "author": "Matt Ginzton", "downloadCount": 1259, "tags": ["cmdutils", "cmd", "recycle-bin"]}