{"description": "Code Contracts provide a language-agnostic way to express coding assumptions\nin .NET programs.\n\nThe contracts take the form of pre-conditions, post-conditions, and object\ninvariants.\nContracts act as checked documentation of your external and internal APIs.\nThe contracts are used to improve testing via runtime checking,\nenable static contract verification, and documentation generation.\nCode Contracts bring the advantages of design-by-contract programming to all\n.NET programming languages. We currently provide three tools:\n\n1. **Runtime Checking**. Our binary rewriter modifies a program by injecting\nthe contracts, which are checked as part of program execution.\nRewritten programs improve testability: each contract acts as an oracle,\ngiving a test run a pass/fail indication. Automatic testing tools, such as Pex,\ntake advantage of contracts to generate more meaningful unit tests by\nfiltering out meaningless test arguments that don't satisfy the pre-conditions.\n1. **Static Checking**. Our static checker can decide if there are any contract\nviolations without even running the program!\nIt checks for implicit contracts, such as null dereferences and array bounds,\nas well as the explicit contracts.\n1. **Documentation Generation**. Our documentation generator augments existing\nXML doc files with contract information.\nThere are also new style sheets that can be used with Sandcastle so that the\ngenerated documentation pages have contract sections.\n\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-16T11:19:04Z", "galleryUrl": "https://community.chocolatey.org/packages/codecontracts/1.9.10714.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/codecontracts/1.9.10714.2", "licenseUrl": "https://github.com/Microsoft/CodeContracts/blob/master/LICENSE.txt", "packageName": "codecontracts", "displayName": "CodeContracts", "summary": "Code Contracts provide a language-agnostic way to express coding assumptions in .NET programs.", "version": "1.9.10714.2", "icon": "https://cdn.rawgit.com/AdmiringWorm/chocolatey-packages/3925a4a8dbb9caffb458f64b133f22260c6eff8b/icons/codecontracts.png", "author": "RiSE", "downloadCount": 2082, "tags": ["code", "contracts", "admin", "CodeContracts", "static-analysis", "requires", "ensures", "invariant", "assume", "assert", "static-checker", "static-verification", "visual-studio"]}