{"description": "---\n\n### [choco://comicrack](choco://comicrack)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\nAs a reader ComicRack supports all the state of the art features you can expect: different display modes, full screen, information overlays, magnifier, color adjustments, automatic backcolor matching and a multi tab interface to quickly switch between eComics.\n\nAs a manager you can browse and search your eComics in the library, create folders and lists to organize them. You can customize the lists to show just the information you need and use advanced tools to tag and edit the information for your eComics. Or create Smart lists to display dynamic lists based on eComic info (never read, author, series etc.)\n\nLike with iTunes you can share your library across your home network and read your eComics on your Tablet/Notebook via wireless. And of course, it is your swiss army knife when batch converting between different formats. Ever wanted to create CBZs from your PDFs - now it is just a click away.\n\nComicRack is multilingual: English, German, French, Spanish, Portuguese, Chinese and other language packs are available.\n\n\nMain Features\n\nNative 32 bit and 64 bit versions\nSupports reading cbz/zip/cbr/rar/cbt/tar/cb7/7z/pdf/djvu comics.\nDatabase management (extended info storage, thumbnails, quick search, smart searches, custom lists, etc.)\nFull screen reading mode with two page display, various zoom modes, auto rotation (for tablet PCs), etc.\nSmart parsing of file names for good initial values (series, number, volume, year etc.)\nComic Library Network Sharing with optional password protection\nCustom display grouping, sorting, stacking and filtering\nMultiple views formats\nUser definable Keyboard shortcuts\nThumbnail generation with customization\nIn-viewer extended info editing\nBatch conversion to cbz/pdf/cbt/djvu of all supported import formats\nSynchronize your library with ComicRack for Android or ComicRack for the iPad\nAnd much, much more....\n \n\nSupported Formats\n\nReads: cbz, zip, cbr, rar, cbt, tar, cb7, 7z, pdf, cbw, djvu\nExports: cbz, cbt, cb7, pdf, djvu \n\n**CLIENTS:**\n[Android App](https://play.google.com/store/apps/details?id=com.cyo.comicrack.viewer.free) | [iOS App](https://apps.apple.com/us/app/comicrack/id660025721)\n\nPACKAGING NOTES: Use Control Panel to uninstall.\n    \n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-23T16:18:25Z", "galleryUrl": "https://community.chocolatey.org/packages/ComicRack/0.9.178.20201116", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ComicRack/0.9.178.20201116", "licenseUrl": "", "packageName": "ComicRack", "displayName": "ComicRack (Install)", "summary": "ComicRack is the best eComic reader and manager for Windows computers. It is an all-in-one solution to read and manage your eComic library.", "version": "0.9.178.20201116", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/comicrack/comicrack_icon.png", "author": "Alexander Bätz,  cYo Soft", "downloadCount": 7707, "tags": ["comicrack", "comic", "book", "reader", "cbr", "cbz", "home", "server"]}