{"description": "###A Plex Media Server channel.\n\nBrowse and view locally stored CBZ, CBR, CB7 comic book archives. It currently acts like a file browser, starting at the directory specified in the channels preferences.\n\nEach user of the channel will have their reading status saved for each comic. Comics can be marked as read/unread and can be resumed from your previous position.\n\n###Format Support\n\n* .CBZ - the ideal format for the channel. Consider converting archives to zip, it's much easier to work with.\n* .CBR - requires unrar.\n* .CB7 - requires 7-Zip (windows). or p7zip (linux, osx).\n* .zip, .rar, and .7z should also work.\n\n###Windows\n\n* unrar\n* 7-Zip\n* set channel preferences paths:\nC:\\Program Files (x86)\\WinRAR\\unrar.exe if you installed WinRAR, or C:\\wherever\\unrar.exe\nC:\\Program Files (x86)\\7-Zip\\7z.exe if you installed 7-Zip.\t\n\n###Plex Client Support\n\nworking: OpenPHT, PMP, Plex Web, Android, iOS\n\n###Channel Preferences\n\n* Comics Path: path to the root directory of where comic archives are stored.\n* Unrar Executable Path: path to unrar binary. leave blank if unrar is in $PATH.\n* 7-Zip Executable Path: path to 7z binary. leave blank if 7z is in $PATH.\n* Items per page: default: 50 number of directories/comics to show per page.\n* Number of pages to include before resume page: default: 5 when going to the resume option on a comic, the channel will start the list at the last viewed page. This is the number of pages prior to that page to include so you can get a recap.\n* Show directories on top: Put the directories at the start of the list when file browsing. (Windows style)\n* Enable channel updater: default: enabled disable this if you don't want the channel to check for updates.\n* Read Indicator: default: blank string to add to the start of a file to indicate it is read.\n* Unread Indicator: default: * string to add to the start of a file to indicate it is unread.\n* In Progress Indicator: default: > string to add to the start of a file to indicate it is in progress.\n* Prevent client image caching: default: disabled In order to keep track of your position in a comic, the channel runs code when it serves a page to the client. If the client holds a cached copy it won't make a request to the server and we can't track what page you are on.\nEnable this option to get the client to download a new copy of the page every time it's viewed.\nIf you don't have any issues with the resume features, you can leave this disabled to save bandwidth.", "updated": "2024-03-17T16:18:26Z", "galleryUrl": "https://community.chocolatey.org/packages/comicreader-plex/1.3.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/comicreader-plex/1.3.5", "licenseUrl": "", "packageName": "comicreader-plex", "displayName": "ComicReader for Plex", "summary": "Plex Media Server channel for comic archives.", "version": "1.3.5", "icon": "", "author": "Cory Parsons", "downloadCount": 1193, "tags": ["comicreader", "plex", "ubooquity", "cbz", "cbr", "cb7", "admin"]}