{"description": "The ContextConsole Shell Extension adds an \"Open Command Prompt\" menu item to the context menus (right-click menus) in Windows Explorer so that you can open a command prompt in the selected directory (or directories) or in the current directory that you are viewing.\n\n### Features\n* Open a command prompt in the current directory and in multiple directories at once.\n\n  You can open a command prompt in the directory that you are currently in by right-clicking on any empty screen space in the directory. This eliminates the need to navigate up a level in order to open a command prompt in the current directory, which was one of the biggest shortcomings of [Microsoft's Open Command Window Here PowerToy](http://www.microsoft.com/windowsxp/downloads/powertoys/xppowertoys.mspx).\n\n  You can also open multiple command prompts by selecting a group of directories and invoking the command prompt.\n\n* Support for elevated command prompts\n\n  On versions of Windows that have UAC (Windows Vista, Windows 7, etc.), the ContextConsole Shell Extension can be used to open elevated command prompts.\n\n* Tiny footprint\n\n  Compared to similar shell extensions, the ContextConsole Shell Extension has an extremely small memory and disk footprint (the 32-bit version consumes less than 16 KiB of disk space).\n\n* Free and open-source\n\n  The ContextConsole Shell Extension is open-source, licensed under a [BSD-style license](http://code.kliu.org/cmdopen/license.txt), so that anyone with some knowledge of C can easily build their own customized version of this shell extension.\n  \n* Compatibility: international support and 64-bit-compatible\n  \n  The user interface text has been translated into [many languages](http://code.kliu.org/cmdopen/#translations), so that it will blend in seamlessly with most systems. Additionally, this shell extension is natively Unicode and can thus support a wide range of directory names.\n\n  Both x86-32 and x86-64 systems are natively supported, so you can use this with the increasingly common 64-bit versions of Windows.\n  \n* Support for network paths\n\n  You can even open directories from [network paths](http://code.kliu.org/cmdopen/screenshots/network_prompt.png) (UNC paths).", "updated": "2024-03-21T11:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/contextconsole/2.1.0.20171024", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/contextconsole/2.1.0.20171024", "licenseUrl": "http://code.kliu.org/cmdopen/license.txt", "packageName": "contextconsole", "displayName": "Context Console Shell Extension", "summary": "Adds an \"Open Command Prompt\" contextual menu item.", "version": "2.1.0.20171024", "icon": "", "author": "Kai Liu", "downloadCount": 3400, "tags": ["contextconsole", "context", "menu", "cmd", "dos", "windows", "explorer", "admin"]}