{"description": "# Contasimple Desktop\n\n![Contasimple is available for desktop, web and mobile.](https://raw.githubusercontent.com/Contasimple/contasimple-desktop/master/images/Contasimple%203000x2000.png)\n\nContasimple is the leading invoicing, accounting and taxes application to manage your company on the cloud.\n\nContasimple lets you:\n\n- issue invoices/bills to your customers.\n- manage your invoicing and billing.\n- create estimates or delivery notes and convert those to invoices with a single click.\n- register your expenses on the books.\n- mange the collections and payments.\n- know the status of your business from the dashboard screen.\n- get to better understand your business with the reports.\n- store files on its virtual drive.\n- compute and fill the official tax forms (feature not available for all markets).\n- collect via direct debit payments (available for all SEPA countries).\n- keep track of your employees working hours.\n- etc.\n\nContasimple allows you to access your information anywhere anytime:\n\n- from the web (https://www.contasimple.com)\n- from the Contasimple Desktop client applications available for all major OSs (like Windows, Linux or Mac OS)\n- on the go from your phone (search for Contasimple on the Android and iOS app stores).\n\nThe application offers a free plan for all users and two paying plans for those users who require the most advanced features. Paying plans start from 7,95€/month.\n\nIf in doubt, just check it out and try it without any obligation, no credit card required. If the free plan works for you there's no need to pay, and if you require any of the paying plans, they are super affordable.\n\nCome and join the 250.000 users that rely on Contasimple to manage their business!\n\n---\n\nContasimple es la aplicación en la nube líder de facturación, contabilidad e impuestos.\n\nContasimple te permite:\n\n- emitir facturas de cliente.\n- gestionar tu facturación.\n- crear presupuestos y albaranes y convertirlos en facturas en un click.\n- gestionar tus cobros y pagos.\n- conocer el estado de tu negocio en todo momento desde la pantalla de Dashboard.\n- tener un mejor conocimiento de tu empresa gracia a su módulo de informes.\n- almacenar ficheros en su disco virtual.\n- calcular y rellenar los modelos de impuestos (funcionalidad no disponible en todos los mercados).\n- cobrar a tus clientes vía recibo bancario, y hacer todo el seguimiento hasta el pago o rechazo del mismo.\n- controlar las horas de trabajo de tu plantilla con el módulo de registro de la jornada laboral.\n- etc.\n\nContasimple te permite acceder a tu información en cualquier momento y desde cualquier lugar:\n\n- a través de la web (https://www.contasimple.com).\n- desde la aplicación Contasimple Desktop, disponible para los sistemas operativos más extendidos (Windows, Linux o Mac OS).\n- desde tu teléfono móvil (instálate la aplicación Contasimple para Android o iOS).\n\nLa aplicación ofrece un plan gratuito a todos los usuarios, y dos planes de pago para aquellos usuarios que quieran tener acceso a las funciones más avanzadas. Aun así, los planes de pago son super económicos, y empiezan en 7,95€/mes.\n\nSi dudas de si te puede servir o no, pruébala sin ningún compromiso (no te pediremos ningún dato de pago). Si el plan gratuito te va bien, úsala sin coste alguno para ti, y si finalmente necesitas alguna de las funcionalidades de los planes de pago, gracias a sus precios super económicos tampoco te será un gran problema.\n\n¡Únete a los 250.000 usuarios que confían en Contasimple para la gestión de su negocio!", "updated": "2024-03-07T23:48:40Z", "galleryUrl": "https://community.chocolatey.org/packages/contasimple-desktop/3.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/contasimple-desktop/3.1.0", "licenseUrl": "https://www.contasimple.com/terminos-y-condiciones-del-servicio.aspx", "packageName": "contasimple-desktop", "displayName": "Contasimple Desktop", "summary": "The invoicing, accouting and taxes application for freelancers and SMEs", "version": "3.1.0", "icon": "https://www.contasimple.com/Content/Images/Logos/contasimple_128_128.png", "author": "Contasimple S.L.", "downloadCount": 424, "tags": ["invoicing", "billing", "accounting", "taxes"]}