{"description": "Crinkler is a compressing linker for Windows, specifically targeted towards executables with a size of just a few kilobytes. Its main purpose is as a tool for producing small [demoscene](https://en.wikipedia.org/wiki/Demoscene) productions.\n\nUsage information and version history can be found in the manual.\n\nFor general discussion, questions and comments, use the [Pouët.net forum](http://www.pouet.net/prod.php?which=18158).\n\n## Distribution\n\nCrinkler is mainly being developed by Rune L. H. Stubbe (Mentor/TBC) and Aske Simon Christensen (Blueberry/Loonies). It is distributed under the [Zlib license](https://en.wikipedia.org/wiki/Zlib_License).\n\nYou are welcome to integrate Crinkler into your own tools or toolchains. If you do so, preferably base your work on a commit tagged by a release version. This way, the Crinkler version identifier written into output executables (two digits at offset 2 in the file) will match the actual contents produced by Crinkler.\n\n## Building\n\nBuild Crinkler using Visual Studio 2017 or later. The custom build rules for the assembly files require that `nasmw.exe` is in the executable path.\n\nThe data compressor itself is separated out into its own library, located in the `Compressor` project. This library enables tools to estimate how big a particular piece of data would be after being compressed by Crinkler. Take a look at the `CompressorExample` project for a description of its usage.", "updated": "2024-03-17T15:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/crinkler/2.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/crinkler/2.3", "licenseUrl": "https://github.com/runestubbe/Crinkler/blob/v2.3/LICENSE.txt", "packageName": "crinkler", "displayName": "Crinkler", "summary": "Crinkler is a compressing linker.", "version": "2.3", "icon": "", "author": "Aske Simon Christensen,  Rune L. H. Stubbe.,  Gil Dabah", "downloadCount": 188, "tags": ["crinkler", "linker", "link", "lld", "ld", "foss", "cli", "demoscene", "executables"]}