{"description": "![Screenshot example of Caladea font](https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Caladea-sample.svg/220px-Caladea-sample.svg.png)\n\t\nThe Chrome OS core fonts, also known as the Croscore fonts, are a collection of three TrueType font families: Arimo (sans-serif), Tinos (serif) and Cousine (monospace). These fonts are metrically compatible with Monotype Corporation’s Arial, Times New Roman, and Courier New, the most commonly used fonts on Microsoft Windows operating system, for which they are intended as open-source substitutes.\n\nGoogle licenses these fonts from Ascender Corporation under the Apache License 2.0.\n\nIn 2013, Google released an additional Crosextra (Chrome OS Extra) package, featuring Carlito (which matches Microsoft's Calibri) and **Caladea** (matching Cambria). These two fonts are respectively metric-adjusted versions of Lato and Cambo, both available on Google Fonts.\n\n**Caladea** (Google's Caladea font, google-crosextrafonts-caladea) is a modern, friendly serif font, metric-compatible with Microsoft Fonts Cambria font. Caladea comes in regular, bold, italic, and bold italic. The family covers Latin-Greek-Cyrillic (not a complete set, though) with about 2,000 glyphs. It has the same character coverage as Microsoft Fonts Cambria. This font is sans-serif typeface family based on Lato. Caladea is a default Cambria font replace in the LibreOffice Suite.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/crosextrafonts-caladea-font/readme.md)**\n\n***\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n***", "updated": "2024-03-21T23:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/crosextrafonts-caladea-font/2013.02.14", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/crosextrafonts-caladea-font/2013.02.14", "licenseUrl": "http://www.apache.org/licenses/LICENSE-2.0", "packageName": "crosextrafonts-caladea-font", "displayName": "Croscore Extra Fonts - Caladea (Install)", "summary": "Caladea is a Croscore extras font metriclly compatible with Cambria.", "version": "2013.02.14", "icon": "https://raw.githubusercontent.com/bcurran3/ChocolateyPackages/master/mylogos/ttf_icon.jpg", "author": "Carolina Giovagnoli, Andres Torresi,  Huerta Tipográfica", "downloadCount": 1013, "tags": ["chrome", "chromeos", "croscore", "caladea", "font", "ttf", "binaries"]}