{"description": "The Chrome OS core fonts, also known as the Croscore fonts, are a collection of three TrueType font families: Arimo (sans-serif), Tinos (serif) and Cousine (monospace). These fonts are metrically compatible with Monotype Corporation’s Arial, Times New Roman, and Courier New, the most commonly used fonts on Microsoft Windows operating system, for which they are intended as open-source substitutes.\n\nGoogle licenses these fonts from Ascender Corporation under the Apache License 2.0.\n\nThe fonts were originally developed by Steve Matteson as Ascender Sans and Ascender Serif, and were also the basis for the Liberation fonts licensed by Red Hat under another open source license. In July 2012, version 2.0 of the Liberation fonts, based on the Croscore fonts, was released under the SIL Open Font License.\n\n**Arimo** was designed by Steve Matteson as an innovative, refreshing sans serif design that is metrically compatible with Arial™. Arimo offers improved on-screen readability characteristics and the pan-European WGL character set and solves the needs of developers looking for width-compatible fonts to address document portability across platforms.\n\n**Cousine** was designed by Steve Matteson as an innovative, refreshing sans serif design that is metrically compatible with Courier New™. Cousine offers improved on-screen readability characteristics and the pan-European WGL character set and solves the needs of developers looking for width-compatible fonts to address document portability across platforms.\n\n**Tinos** was designed by Steve Matteson as an innovative, refreshing serif design that is metrically compatible with Times New Roman™. Tinos offers improved on-screen readability characteristics and the pan-European WGL character set and solves the needs of developers looking for width-compatible fonts to address document portability across platforms.\n\nExamples of the fonts can be found at:\n* https://fonts.google.com/specimen/Arimo\n* https://fonts.google.com/specimen/Cousine\n* https://fonts.google.com/specimen/Tinos\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/croscorefonts-font/readme.md)**\n\n***\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n***", "updated": "2024-03-21T01:34:08Z", "galleryUrl": "https://community.chocolatey.org/packages/croscorefonts-font/1.31.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/croscorefonts-font/1.31.0", "licenseUrl": "http://www.apache.org/licenses/LICENSE-2.0", "packageName": "croscorefonts-font", "displayName": "Croscore Fonts (Install)", "summary": "The Chrome OS core fonts, also known as the Croscore fonts, are a collection of three TrueType font families: Arimo (sans-serif), Tinos (serif) and Cousine (monospace).", "version": "1.31.0", "icon": "https://raw.githubusercontent.com/bcurran3/ChocolateyPackages/master/mylogos/ttf_icon.jpg", "author": "Steve Matteson,  Ascender Corporation", "downloadCount": 1105, "tags": ["smatteson", "chrome", "chromeos", "arimo", "cousine", "tinos", "font", "ttf", "binaries"]}