{"description": "**!!! Following the [shutting down](https://ctemplar.com/ctemplar-is-shutting-down/) of CTemplar, the package can no longer be maintained or downloaded. If you are using a previous version, updates will not be available. !!!**\n\t\n\tInspired in the ways of the medieval Knights Templar, this service was created to provide an anonymous and end-to-end encrypted email to anyone who needs their communications shielded from prying eyes. We at CTemplar recognize the value in cryptography and cryptocurrency, hence the name \"CTemplar\" or \"Crypto Templar\".\n\nOur mission is to provide an anonymous E2EE (End to End Encrypted) email. No one except you and your recipient can read the contents of your emails, not even us.\n\nWe are independently owned, funded, and the key parts of our codebase are publicly released under a permissive open-source license. The government and corporate grants and investment proposals we have seen have always been designed to violate our user’s privacy. Therefore, we actively refuse all investments or grants from governments and corporations.\n\nOur team is passionate about privacy and security. It is what we believe in and respect. With this, we welcome and invite you to be a part of the CTemplar email service for the best email protection you can access.\n\n\n**Please Note**: This is an automatically updated package. If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-21T22:48:31Z", "galleryUrl": "https://community.chocolatey.org/packages/ctemplar/2.5.75.20220817", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ctemplar/2.5.75.20220817", "licenseUrl": "https://github.com/CTemplar/webclient/blob/master/LICENCE", "packageName": "ctemplar", "displayName": "[Unmaintained] CTemplar", "summary": "Armored Email. Because privacy is a human right worth fighting for!", "version": "2.5.75.20220817", "icon": "https://cdn.jsdelivr.net/gh/CTemplar/webclient@master/src/assets/icons/icon.png", "author": "Templar Software Systems Ltd.", "downloadCount": 1529, "tags": ["ctemplar", "mail", "security", "e2ee", "anonymous"]}