{"description": "# CUETools\nCUETools is a tool for lossless audio/CUE sheet format conversion. The goal is to make sure the album image is preserved accurately. A lossless disc image must be lossless not only in preserving contents of the audio tracks, but also in preserving gaps and CUE sheet contents. Many applications lose vital information upon conversion, and don't support all possible CUE sheet styles. For example, foobar2000 loses disc pre-gap information when converting an album image, and doesn't support gaps appended (noncompliant) CUE sheets.\n# Supported formats\nSupports WAV, FLAC, APE, LossyWAV, ALAC, TTA, and WavPack audio input/output. Audio must be 16-bit, 44.1kHz samples stereo (i.e. CD PCM). Supports every CUE sheet style (embedded, single file, gaps appended/prepended/left out). It is also possible to process a set of audio files in a directory without a CUE sheet, or use a RAR archive as an input without unpacking it.\n# CUERipper\nCUERipper is a utility for extracting digital audio from CDs, an open-source alternative to EAC. It has a lot fewer configuration options, so is somewhat easier to use, and is included in CUETools package. It supports MusicBrainz and freeDB metadata databases, AccurateRip and CTDB.", "updated": "2024-03-23T16:03:31Z", "galleryUrl": "https://community.chocolatey.org/packages/cuetools/2.2.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/cuetools/2.2.5", "licenseUrl": "https://github.com/gchudov/cuetools.net/raw/master/License.txt", "packageName": "cuetools", "displayName": "CUETools (Portable)", "summary": "CUETools is a tool for lossless audio/CUE sheet format conversion. CUERipper is a utility for extracting digital audio from CDs.", "version": "2.2.5", "icon": "http://s3.cuetools.net/ctdb64.png", "author": "Gregory S. Chudov,  Moitah,  others", "downloadCount": 1074, "tags": ["opencl", "cuesheet", "cue", "lossless-compression-algorithm", "cd-ripper", "ALAC", "APE", "FLAC", "TTA", "WAV", "WavPack", "audio", "conversion", "convert", "cue-sheet", "cueripper", "lossless", "lossyWAV"]}