{"description": "## Features\n### Safety\nOption for a safer and more relaxed driving\nIf the maps are outdated, your navigation system may frequently provide you with improper instructions. Updated navigation helps safe driving by preparing for unexpected situations arising from changes in the road network. Anyone can encounter annoying mistakes in route planning that are often thought to be the fault of the navigation system. Actually, the most common reason for errors in route calculation is due to the outdated maps.\n\n### Time & Cost efficiency\nOptimized travel time & fuel consumption\nBy using updated maps the system saves you time by optimal route planning. You may also reduce the average fuel consumption of your vehicle.\n\n### Convenience\nComfort & efficiency by POI\nNot only the road network changes, but also the database of available places of interest (POI). It includes a list of gas stations, ATMs, pharmacies, restaurants, accommodation and many other places that you may need while traveling.\n\n## Content types\n### Maps\nRoads are constantly changing. Keep your map up-to-date and drive with peace of mind:\n\n- 1 free map update within 90 days of vehicle purchase – your factory-installed map may not be the latest one available. Update it for free as soon as you purchase your car.\n- Single time update - you can download and install the latest version of any chosen map for one time only.\n- Multiple updates – you can download and install the latest version of any chosen map and get 1 or 3 years of access to map updates (2 updates/year).\n\n### Premium Points Of Interest - POI\nExtend your existing POI categories. Choose from an even wider range of POIs and find hotels, tourist attractions, pharmacies, banks & ATMs, airports and parking garages. Literally whatever you need.\n\n### Speedcam Databases\nKnow in advance the location of speed cameras and get early warnings to avoid unpleasant and expensive surprises.`*\n\n*`*Availability of speed camera database is limited to one year and only to countries where regulations allow such usage.*\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/dacia-toolbox/screenshot.png)", "updated": "2024-03-22T03:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/dacia-toolbox/2024.02.26", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dacia-toolbox/2024.02.26", "licenseUrl": "https://dacia.welcome.naviextras.com/terms_of_site_en.html", "packageName": "dacia-toolbox", "displayName": "Dacia Media Nav Evolution Toolbox", "summary": "DACIA navigation system updater.", "version": "2024.02.26", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/dacia-toolbox/dacia-toolbox.png", "author": "NNG Software Developing and Commercial Llc.", "downloadCount": 1441, "tags": ["dacia-toolbox", "dacia", "navigation", "gps", "updater", "media", "nav", "evolution", "toolbox"]}