{"description": "Never Forget Another Password. Store them securely as you browse. Autofill them and log in instantly to your favorite websites.\n    \n    Store and manage your passwords securely as you browse the internet. With over 8 million users worldwide, Dashlane is the best password manager for simple, safe logins.\n\n    Dashlane's browser extension integrates seamlessly into your browsing experience. As you use and create passwords Dashlane saves them into a secure vault that only you can access. Dashlane then logs you in automatically to your saved accounts, ensuring you'll never forget another password.\n\n    “Dashlane is life-changingly great. And free. Get it.” - David Pogue, The New York Times\n\n    ##Dashlane Extension Features:#\n\n    ###SECURE PASSWORD MANAGER#\n    * Save and organize all of your passwords in one safe place\n    * Automatically log into websites in seconds\n    * Have unique, secure passwords for each of your accounts\n    * No need to remember, write down, or fill in your passwords\n\n    ###WE TAKE YOUR PASSWORD SECURITY SERIOUSLY#\n    * Dashlane protects your passwords with the industry’s strongest security encryption\n    * Choose your method for data storage: local-only or synced and backed up to the cloud\n\n    ###AWARD-WINNING PASSWORD MANAGER#\n    PC Mag “Editors’ Choice Award”\n    Webby Award “People’s Voice Best Mobile Services and Utilities App”\n    Kiplinger's \"Best Identity Theft Prevention Tools”\n    Inc.com’s “Best for Passwords and Checkouts”\n    Techlicious \"The Best Security Apps”\n    And many more…\n\n    ###FREE FOR LIFE ON A SINGLE BROWSER#\n\n    You can always use Dashlane for free. You can get even more with Premium.\n\n    Dashlane is free to download and manage passwords on a single web browser. Dashlane Premium gives you ultimate password convenience and security, with:\n    * Instant sync across the Dashlane Extension in all of your browsers to always keep passwords up to date, no matter where you are\n    * Use of Dashlane’s suite of apps across all of your devices, with expanded features such as our Digital Wallet and Secure Note storage\n    * Priority user support\n\n    For more information on Dashlane, see our Privacy Policy (https://www.dashlane.com/privacy) and Terms of Service (https://www.dashlane.com/terms)", "updated": "2024-03-23T17:18:31Z", "galleryUrl": "https://community.chocolatey.org/packages/dashlane-chrome/1.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dashlane-chrome/1.0.0", "licenseUrl": "", "packageName": "dashlane-chrome", "displayName": "Dashlane for Chrome", "summary": "Chrome extension which adds password manager dashlane.", "version": "1.0.0", "icon": "https://rawcdn.githack.com/jimgibbs/jimgibbs.github.io/931328aeba325dc1381c0f492df9eb0777159ed3/img/dashlane.png", "author": "dashlane.com", "downloadCount": 46610, "tags": ["dashlane", "chrome", "extension"]}