{"description": "---\n\n### [choco://data-lifeguard-diagnostic](choco://data-lifeguard-diagnostic)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Western Digital Data Lifeguard Diagnostic for Windows screenshot](http://support.wdc.com/images/kb/940_4.png)\n\nThis is a Windows version of the Data LifeGuard Diagnostics. It will test WD internal and external drives. In additional, it can provide you with the model and serial of WD drives attached to the system.\nSupported Operating Systems\n\nWindows 10\nWindows 8 32/64-bit versions\nWindows 7 32/64-bit versions\nWindows Vista 32/64 bit versions\nWindows XP 32/64-bit versions\n\n#### Instructions\n1. Download the Windows Data Lifeguard Diagnostics, .zip\n2.  Extract and run the program, WinDlg.exe. (Chocolatey does this for you!) If running Windows Vista (or later), you will need to Right-Click on the WinDlg.exe file and choose to Run As Administrator.\n3. Read and accept the license agreement to continue.\n4. On the main program screen, there are two windows. In the top window, you will see the drives in your system that are available for testing. The model number, serial number, capacity, and SMART status of each drive will be displayed. In the bottom window, the partition information for the selected drive will be displayed.\n5. Highlight the drive and select the icon on the top row to test or run SMART status.\n6. When you select the run tests icon, the \"DLGDIAG - Select an Option\" window appears.\n7. You will see the following options:\n* QUICK TEST - performs SMART drive quick self-test to gather and verify the Data Lifeguard information contained on the drive.\n* EXTENDED TEST - performs a Full Media Scan to detect bad sectors. Test may take several hours to complete depending on the size of the drive.\n* WRITE ZEROS - writes zeros to the drive with options of Full Erase and Quick Erase. File system and data will be lost.\n* VIEW TEST RESULT - displays the latest test results.\n8. Select the test you wish to perform and click the Start button.\n9. When the test completes, you will be notified with a pass/fail message. Click the Close button.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/data-lifeguard-diagnostic.portable/readme.md)**\n\n***\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n***", "updated": "2024-03-23T16:48:27Z", "galleryUrl": "https://community.chocolatey.org/packages/data-lifeguard-diagnostic/1.37", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/data-lifeguard-diagnostic/1.37", "licenseUrl": "", "packageName": "data-lifeguard-diagnostic", "displayName": "Western Digital Data Lifeguard Diagnostic for Windows (Install)", "summary": "Western Digital Data Lifeguard Diagnostic for Windows tests your Western Digital hard disks for errors.", "version": "1.37", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/data-lifeguard-diagnostic/data-lifeguard-diagnostic_icon.png", "author": "Western Digital", "downloadCount": 2273, "tags": ["western", "digital", "wd", "data", "lifeguard", "hdd", "diagnostic", "dlgdiag", "windlg"]}