{"description": "Date Reminder reminds you of recurring or nonrecurring events, like birthdays, bills to pay, appointments etc...\n    \nThe program can be run from the Startup folder with an option to show only, if there are any alerts for this day. If Date Reminder is kept in the System Tray (optional), if will also alert you after standby or hibernation.\n\nThe reminders are listed in chronological order, with recurring events showing only once (the next one). This gives you an instant view of the alerts (at top), as well as a full list of all reminders. Other view modes: Alerts only, History.\n\n![Example](https://www.horstmuc.de/img/remindere.png)\n\n## Features\n* Events may recur every year, month, week, day, or every 10 days, every 2 weeks, every 3 month etc.\n* For monthly or annual reminders you can preselect a specific day (e.g. \"first monday\") of the month\n* Reminders can be marked \"done\", i.e. \"dealt with\". Past events will remain in the list until they are marked \"done\".\n* A group symbol (column ::) is available to mark different types of events.\n* An advance notice marker can be set a number of days before an event.\n* An extra calendar box, sizable for one or more month, always highlights the date of the currently selected line.\n* Second text line with launching capability (shows in status bar): Double click to load a file, program, website etc., or just use it for additional text.\n* Date format according to the user's regional settings (a different format can be specified in the INI file).\n* The user interface is controlled by language files. English (default) and 20 other languages are included. Additional language files can be created. Unicode support.", "updated": "2024-03-21T23:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/date-reminder/3.38", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/date-reminder/3.38", "licenseUrl": "https://github.com/teknowledgist/Chocolatey-packages/tree/master/automatic/date-reminder/legal/LICENSE.md", "packageName": "date-reminder", "displayName": "Date Reminder", "summary": "Reminds you of recurring or nonrecurring events", "version": "3.38", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@16e5d69aa5628f18c46e0e183f664bdbf2af8538/Icons/date-reminder_icon.png", "author": "Horst Schaeffer", "downloadCount": 173, "tags": ["date-reminder", "calendar", "event", "notice", "alert", "freeware", "embedded"]}