{"description": "Professional solution for handling schema differences in Oracle\n\ndbForge Schema Compare for Oracle is a professional tool designed to work with database schemas. It compares them and provides detailed information about all mismatches. Schema Compare is one of the most demanded Oracle tools necessary for the correct DevOps processes. \n\nThis tool works with databases, snapshots, versioned snapshots, and script folders. It analyzes the schemas and each object with its properties. Users can identify how any changes impacted the schema, and then synchronize the databases automatically with the help of SQL*Plus scripts generated by the tool. \n\nYou can compare schemas in different Oracle databases. Comparison and synchronization tasks can be automated. All results are presented in a user-friendly interface, and you can also export the results as reports in Excel and HTML formats. \n\nThe tool allows for automating the tasks via the command-line interface to save time and eliminate the risks of errors caused by the human factor. \n\nSchema Compare is a part of the Studio for Oracle – an IDE for Oracle database developers and administrators. Also, this tool is available as a separate solution.", "updated": "2024-03-20T10:03:34Z", "galleryUrl": "https://community.chocolatey.org/packages/dbforge-ora-sc/4.5.226", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dbforge-ora-sc/4.5.226", "licenseUrl": "https://www.devart.com/using-website/eula.html", "packageName": "dbforge-ora-sc", "displayName": "dbForge Schema Compare for Oracle", "summary": "Professional solution for handling schema differences in Oracle", "version": "4.5.226", "icon": "https://cdn.jsdelivr.net/gh/DevartSoftware/devart-chocolatey@master/ProductsPng/dbforge-oracle-schemacompare.svg", "author": "Devart", "downloadCount": 1749, "tags": ["Oracle", "database", "database-management", "Tool", "rdbms", "Ide", "Windows", "management", "Report", "transfer", "migrate", "synchronize"]}