{"description": "A comprehensive solution for flawless SQL code writing\n\ndbForge SQL Complete is an all-around software tool for improving the speed and quality of code writing. It is excellent for database developers, managers, and admins. The solution integrates with SSMS and Visual Studio and provides enhanced code writing, editing, and refactoring options that aren't present in the default systems.\n\nThe code auto-completion functionality exceeds the standard IntelliSense capacities of SSMS and Visual Studio. In-built SQL Formatter and T-SQL Debugger allow for improving the overall code quality and matching the code standards. Applying code snippets and reusing past code modules let the users accelerate the speed of writing significantly.\n\nSQL Complete is a tool that helps to speed the coding routines at least twice for even the most complicated scripts and ensure producing the best-quality, error-free code. Such additional options as renaming, searching and finding invalid code/objects, troubleshooting T-SQL codes of any type, formatting profiles, etc. serve to bring accurate results effortlessly.\n\nAnother great feature is the possibility to search and visualize the data in the SSMS Results Grid. It lets you search for the required data across the Results grid, and you won't need to type queries. You can also generate the scripts from that grid directly. A helpful option of data aggregation helps you calculate sums and average values faster and easier than in spreadsheets.\n\nA helpful option is the possibility to restore previous sessions. It lets you restore the document sessions and the last closed documents, which can be vital if your SSMS crashes or you closed the document accidentally and did not save the changes. This way, you can minimize or avoid losses. The option of the execution warning helps you avoid the object or data deletion accidentally. Transaction reminders inform you about uncommitted transactions. It guarantees to preserve your work.\n\ndbForge SQL Complete is one of the most favored tools for all database specialists.", "updated": "2024-03-22T02:48:32Z", "galleryUrl": "https://community.chocolatey.org/packages/dbforge-sql-cmpl/6.15.20", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dbforge-sql-cmpl/6.15.20", "licenseUrl": "https://www.devart.com/using-website/eula.html", "packageName": "dbforge-sql-cmpl", "displayName": "dbForge SQL Complete", "summary": "A comprehensive solution for flawless SQL code writing", "version": "6.15.20", "icon": "https://cdn.jsdelivr.net/gh/DevartSoftware/devart-chocolatey@master/ProductsPng/dbforge-sql-sqlcomplete.svg", "author": "Devart", "downloadCount": 2898, "tags": ["MSSQL", "Database", "SQL", "Tools", "SQLServer", "TSQL", "Autocompletion", "IntelliSense", "Formatter", "Debugger", "Refactoring", "Productivity", "SSMS", "VisualStudio"]}