{"description": "A set of SSMS enhancements for complete performance \n\ndbForge SQL Tools is a set of 15 solutions integrated with SSMS to enhance its functionality and make it a complete solution. With these add-ons, users can get all the functionality that the SSMS IDE lacks in a habitual interface. It improves the existing capacities of TSQL code writing and refactoring, handling database objects, documenting the databases, implementing DevOps, and provides many more options. \n\nKey benefits of dbForge SQL Tools: \n\n* Set up CI procedures with all required steps covered. Prepare and perform T-SQL unit tests, and automate the database deployment. \n* Write, format, proofread and refactor the TSQL codes of any complexity. Such additional options as a visual query builder, auto-completion, code snippets, and formatting profiles let the users produce high-quality code for any database-related purpose much faster than before. \n* Search for database objects and decrypt them. Users can search for objects, data, and text. The tools also allow viewing and decrypting the SQL Server functions, triggers, views, and stored procedures, in a neat and accurate interface. \n* Document the databases. A separate mini-tool scans and documents the entire SQL Server database. The documentation files are available in several formats, with convenient navigation and search options. \n\nBy applying the dbForge SQL Tools package to SSMS, you are extending the default functionality of that Microsoft's IDE. Perform all tasks with one system. There is no need for searching any additional plug-ins for SSMS, as SQL Tools cover all the necessary enhancements in one set.", "updated": "2024-03-20T11:03:24Z", "galleryUrl": "https://community.chocolatey.org/packages/dbforge-sql-tools/6.5.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dbforge-sql-tools/6.5.2", "licenseUrl": "https://www.devart.com/using-website/eula.html", "packageName": "dbforge-sql-tools", "displayName": "dbForge SQL Tools", "summary": "A set of SSMS enhancements for complete performance", "version": "6.5.2", "icon": "https://cdn.jsdelivr.net/gh/DevartSoftware/devart-chocolatey@master/ProductsPng/dbforge-sql-sql-tools.svg", "author": "Devart", "downloadCount": 3748, "tags": ["MSSQL", "SQL", "Database", "Management", "Studio", "Tools", "SQLServer", "SSMS", "Admin", "DBA", "Developer"]}