{"description": "Professional solution for handling data differences in Oracle databases\n\ndbForge Data Compare for Oracle is a robust and user-friendly solution designed to compare the data in different Oracle databases. Its goal is to identify all mismatches in the data, report them in a convenient format, and synchronize the data, updating one database with the data from another one. This task is standard for the DevOps procedures, and the tool is essential for quality database management and development. \n\nThe tool compares two or more databases, both several versions of one database or different ones. It identifies all discrepancies in data and presents them for the user to view or export as XLS or HTML reports. After comparison, the tool can produce the SQL*Plus scripts for the data synchronization. It allows to replicate the data without errors and update the databases in production/staging with the data from the development stage. \n\nThe Data Compare tool is available as a separate solution or as a part of dbForge Studio for Oracle – a fully-featured IDE for performing all tasks on Oracle database development and management. You can test any product – the free trials are available.", "updated": "2024-03-20T14:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/dbforge-ora-dc/5.5.172", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dbforge-ora-dc/5.5.172", "licenseUrl": "https://www.devart.com/using-website/eula.html", "packageName": "dbforge-ora-dc", "displayName": "dbForge Data Compare for Oracle", "summary": "Professional solution for handling data differences in Oracle databases", "version": "5.5.172", "icon": "https://cdn.jsdelivr.net/gh/DevartSoftware/devart-chocolatey@master/ProductsPng/dbforge-oracle-datacompare.svg", "author": "Devart", "downloadCount": 779, "tags": ["Oracle", "database", "database-management", "Tool", "rdbms", "Ide", "Windows", "management", "Report", "transfer", "migrate", "synchronize", "Data"]}