{"description": "DCM is a toolkit that helps you identify and fix problems in your Dart and Flutter code. These problems can range from potential runtime bugs and violations of best practices to styling issues. DCM includes over 70 built-in rules to validate your code against various expectations, and you can customize these rules to fit your specific needs.\n\n## Rules\nRules are central to how DCM works. They are used to check whether your code meets certain expectations, and to specify what should be done if it doesn't. Rules can also be configured with additional options specific to that rule.\n      \nFor more information, see the [Rules](https://dcm.dev/docs/rules/) documentation.\n      \n## Metrics\nMetrics are another important aspect of DCM. They are used to measure the complexity of your code and identify areas that may be difficult to maintain or test. This can be particularly useful for larger projects, where it can be challenging to keep track of all the different contributions from various developers. Metrics can also provide instant feedback on pull requests for smaller projects, helping to ensure that code stays easy to maintain.\n      \nAll metrics are configurable.\n      \nFor more information, see the [Metrics](https://dcm.dev/docs/metrics/) documentation.\n      \n## Commands\nIn addition to providing rules and metrics, DCM also includes commands to help with codebase maintenance, such as identifying unused code, unused files, and unused localization.\n      \nFor more information, see the [CLI](https://dcm.dev/docs/cli/) documentation.\n      \n## Configuration\nDCM is designed to be flexible and configurable to fit your specific needs. You can choose to enable only metrics calculation, only rules, or both.\n      \nFor more information, see the [Configuration](https://dcm.dev/docs/configuration/) documentation.", "updated": "2024-03-23T00:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/dcm/1.15.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dcm/1.15.1", "licenseUrl": "https://dcm.dev/eula/", "packageName": "dcm", "displayName": "dcm", "summary": "DCM is a tool that helps improve the quality and consistency of Dart code by identifying and reporting problems, such as bugs and code that doesn't follow best practices. It also collects analytical data on the code through calculating code metrics and can be configured to set thresholds for these metrics.\n    \n      This executable requires a license to work. You can also request a trial version.", "version": "1.15.1", "icon": "https://raw.githubusercontent.com/CQLabs/choco-dcm/ed4646f4dda3bbea4b9f1b19c4d480377aa7a009/assets/logo-256.png", "author": "Dmitry Zhifarsky", "downloadCount": 1147, "tags": ["dcm", "Dart", "Flutter", "StaticAnalisys", "CodeMetrics"]}