{"description": "DCode™ is a FREE forensic utility for converting data found on desktop and mobile devices into human-readable timestamps. It is the most comprehensive tool available for decoding timestamps and is a must-have utility for your tool box.\n\nThe software was designed to assist forensic examiners in identifying and decoding timestamp data during a forensic investigation. It will also allow the reverse process where timestamps can be encoded into a number of different formats and data types.\nEncoding and Decoding Timestamp Data\n\n## Encoding and Decoding Timestamp Data\n\nDCode™ has support for 69 different timestamp formats from various operating systems and platforms. You can decode values in the form of Little-Endian Hexadecimal, Big-Endian Hexadecimal, 64-bit Integers, 32-bit Integers, Double-precision floating-point numbers and various text formats.\n\nDCode™ also supports time zone translation and will show UTC (Zulu) times and a converted local time based on the selected time zone. If you select the “K” identifier in the timestamp pattern, DCode™ will also display the time zone designator.\n\n## Time Zone Translation\n\nWhen the Select Time Zone button is clicked, the following window is displayed showing a breakdown of all the parameters for each Time Zone. You can also select the No Adjustment button. This allows each timestamp to be decoded without applying any translation.\n\n## Supported Timestamp Formats\n\nDCode™ can convert the following timestamps into a number of different input and output formats such as Numeric (Int32, Int64, Double-precision floating-point), Hexadecimal (Little-Endian), Hexadecimal (Big-Endian) and Text.\n\n- Apple Absolute Time (Seconds)\n- Apple Absolute Time (Nanosecond)\n- Apple HFS\n- Apple HFS+\n- Binary Coded Decimal (BCD) (2-digit Year)\n- Binary Coded Decimal (BCD) Extended (4-digit Year)\n- Binary Coded Decimal (BCD) Reverse Nibble\n- Chromium Time (Microseconds)\n- Chromium Time (Milliseconds)\n- Chromium Time (Seconds)\n- Gmail MIME Boundary\n- Google URL EI Parameter\n- GPS System Time\n- GPS Time\n- GSM Time\n- Microsoft Ticks\n- Motorola Timestamp\n- Microsoft FAT MS-DOS (32-bit) Timestamp\n- Microsoft FAT MS-DOS (40-bit) Timestamp\n- Microsoft MS-DOS (32-bit) wFatDate, wFatTime Timestamp\n- Nokia Series 30\n- Nokia Series 40\n- OLE Automation (64-bit Double)\n- Seagate Date Code\n- SYSTEMTIME Structure\n- Unix Seconds\n- Unix Milliseconds\n- Unix Microseconds\n- UUID (Guid) Timestamp\n- Windows Filetime\n- Windows Filetime [dwLow:dwHigh]\n- Windows Filetime Mime Boundary [dwHigh.dwLow]\n- Windows Filetime MSIE Cookie [dwLow,dwHigh]\n\n## Filtering Date Ranges\n\nTo quickly identify timestamp values which may be important, DCode™ allows you to set a date range which can be used as a filter your results. To configure a date range, select Tools » Options from the menu and select a From and To Date. Once the date range has been saved, you can activate the filter by selecting Tools » Filter Date Range from the menu (or click Ctrl + R). This will filter your results and will only display values where the date falls between your selected range.", "updated": "2024-03-21T03:33:36Z", "galleryUrl": "https://community.chocolatey.org/packages/dcode/5.5.21194.40", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dcode/5.5.21194.40", "licenseUrl": "", "packageName": "dcode", "displayName": "DCode", "summary": "A forensic utility for converting data found on desktop and mobile devices into human-readable timestamps.", "version": "5.5.21194.40", "icon": "https://rawcdn.githack.com/sustainablelobster/dfir-chocolatey-packages/ec1b461c51b2eaa95791c5375bf0c1eb56361ea6/icons/dcode.png", "author": "Digital Detective Group", "downloadCount": 453, "tags": ["dcode", "timestamp", "decode", "forensics", "dfir"]}