{"description": "Swiss-PdbViewer (aka DeepView) is an application that provides a user friendly interface allowing to analyze several proteins at the same time. The proteins can be superimposed in order to deduce structural alignments and compare their active sites or any other relevant parts. Amino acid mutations, H-bonds, angles and distances between atoms are easy to obtain thanks to the intuitive graphic and menu interface.\n    \nSwiss-PdbViewer (aka DeepView) has been developped since 1994 by Nicolas Guex. Swiss-PdbViewer is tightly linked to SWISS-MODEL, an automated homology modeling server developed within the [Swiss Institute of Bioinformatics](http://www.isb-sib.ch/) (SIB) at the [Structural Bioinformatics Group](http://www.biozentrum.unibas.ch/schwede/index.html) at the Biozentrum in Basel.\n\nWorking with these two programs greatly reduces the amount of work necessary to generate models, as it is possible to thread a protein primary sequence onto a 3D template and get an immediate feedback of how well the threaded protein will be accepted by the reference structure before submitting a request to build missing loops and refine sidechain packing.\n\nSwiss-PdbViewer can also read electron density maps, and provides various tools to build into the density. In addition, various modeling tools are integrated and residues can be mutated.\n\nFinally, as a special bonus, POV-Ray scenes can be generated from the current view in order to make stunning ray-traced quality images. An example can be found [here](http://spdbv.vital-it.ch/gallery.html).", "updated": "2024-03-08T11:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/deepview/4.10.0.20161116", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/deepview/4.10.0.20161116", "licenseUrl": "http://spdbv.vital-it.ch/disclaim.html", "packageName": "deepview", "displayName": "DeepView - Swiss PdbViewer", "summary": "Comparitive protein analysis", "version": "4.10.0.20161116", "icon": "https://cdn.rawgit.com/teknowledgist/Chocolatey-packages/master/Icons/DeepView_icon.png", "author": "Nicolas Guex,  Alexandre Diemand,  Manuel C. Peitsch,  and Torsten Schwede", "downloadCount": 1476, "tags": ["deepview", "pdbviewer", "chemistry", "protein", "modeling"]}