{"description": "Changing the Default Profile on Windows 7\nIt has become increasingly obvious to us in recent months that people are downloading and installing our User Profile Manager software just in order to use the “Set As Default Profile” feature on Windows 7. Presumably they are then uninstalling the software again afterwards…\n\nThe problem is that Windows 7 has greyed out the “Copy To…” feature in the “User Profiles” dialog box that admins have used for years to set up a default profile for users logging onto a Windows workstation.\n\n\nWhy Microsoft have done this is not altogether clear. Responses on the Microsoft’s support forums say things like “There were many issues with it in the prior OSes, even though those issues were not always apparent…” (Mmm… the old invisible problem problem) and that this is “due to the User Account Control (UAC) and other security settings of the user account…” - which doesn’t really ring true either. I suspect that the problem is more to do with the profile folder structure and its reliance on junction points which cannot simply be copied over. But whether this is the case or not, why didn’t Microsoft just fix it? The most likely answer to that is that they just didn’t think it was important enough to spend any time on – which betrays a certain disconnect between Microsoft and those tasked with installing Windows on company machines around the globe.\n\nHowever, installing User Profile Manager just to set the default profile is like going to a movie just to eat the popcorn. So what we’ve done is to take the \"set default profile\" code out of User Profile Manager and put it is a small command line utility – DefProf – that you can download for free.\n\nHow does it work?\nDefProf does not simply delete the old “Default” profile folder and copy over a profile that you specify. Instead it keeps the existing Default profile in place and empties it; this preserves the folder structure with all junctions points and folder security settings. DefProf then copies over the files and settings from another profile that you specify. Additionally, DefProf loads the registry for the specified profile and cleans it up so that any user specific settings (that we know about) are removed.\n\nIt is worth emphasizing here that DefProf uses the existing folder structure. This means that if you have already messed up the Default user profile folder, DefProf won't fix it.\n\nUsing DefProf\nUsing DefProf is very easy. Firstly you setup a profile to the way you want just like you always do. Say you create a ‘Setup’ account to do this, and Windows creates a C:\\Users\\Setup profile folder when you logon. When you’re done making the profile look the way you want, you open a Command Prompt as an Administrator and just type the folder name:\n\nc:\\>Defprof setup\n\nThat’s it!\n\nFeedback\nWe’ve done our testing, and DefProf seems to be working fine on Windows 7, 32 and 64-bit, and in a variety of languages. However, if you think we have missed anything please post a comment on the Forum and we'll do our best to fix it.", "updated": "2024-03-12T11:33:21Z", "galleryUrl": "https://community.chocolatey.org/packages/defprof/1.10", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/defprof/1.10", "licenseUrl": "https://www.forensit.com/Profwiz/END-USER LICENSE AGREEMENT.rtf", "packageName": "defprof", "displayName": "Defprof", "summary": "DefProf updates the Default Windows User Profile with the documents and settings from another user profile that you specify. You can use DefProf on Windows 7 where the \"Copy To\" button is greyed out in the \"User Profiles\" dialog box. For more details click here.\n\nInstallation\nJust copy DefProf onto your executable path, and type \"defprof\". You must have administrative privileges.\n\nUsage\nUsage: defprof profile_folder_name\n\nLet’s say you use a ‘setup’ user account to create a user profile that you want everyone logging onto a machine to inherit. When you logon as setup, Windows creates a C:\\Users\\setup profile folder. To make ‘setup’ the default profile, you just type defprof setup at a command prompt.", "version": "1.10", "icon": "https://rawcdn.githack.com/boubou/chocolatey/d6380ac5ce97cbf2465c9661e04256cc74f42723/packages/icons/defprof.png", "author": "ForensiT Ltd", "downloadCount": 1162, "tags": ["default", "user", "profile"]}