{"description": "NOTICE: This package will fail if the target system is not a Dell business platform with compatible WMI-ACPI firmware. If you are using a Dell business platform and it is still failing, try updating your firmware and re-attempting the install.\n    \n    The Dell Command | Monitor software application enables IT administrators to easily manage fleet inventory, monitor system health, modify BIOS settings, and remotely collect information for deployed Dell client systems. \n    Active system health state monitoring can help reduce the total cost of system ownership and is part of a holistic approach to managing all networked devices.\n    Dell Command | Monitor interfaces with leading enterprise management consoles that support industry standards. This approach helps to ensure that Dell systems can be managed by a broad array of existing enterprise management tools. \n    It also interfaces with the Dell Integration Suite for System Center 2012, Dell KACE K1000 Management Appliance , Dell OpenManage Essentials and our Client Management Pack for System Center Operations Manager (SCOM). \n    Finally, tight integration with Windows Management Instrumentation (WMI) allows customers to take advantage of the rich scripting capabilities for collecting information and customizing system settings. This product is provided at no additional charge to Dell customers.", "updated": "2024-03-23T21:33:37Z", "galleryUrl": "https://community.chocolatey.org/packages/dell-command-monitor/10.7.0.232", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dell-command-monitor/10.7.0.232", "licenseUrl": "https://www.dell.com/learn/us/en/uscorp1/terms-of-sale-consumer-license-agreements", "packageName": "dell-command-monitor", "displayName": "Dell Command | Monitor", "summary": "The Dell Command | Monitor software application enables IT administrators to easily manage fleet inventory, monitor system health, modify BIOS settings, and remotely collect information for deployed Dell client systems.", "version": "10.7.0.232", "icon": "https://rawcdn.githack.com/mrawesome139/chocolatey-packages/5f44f27918139fb2832875bc7f705e7b72ea1e39/icons/dell-command-monitor.png", "author": "Dell Inc Software Developers", "downloadCount": 9379, "tags": ["dell-command-monitor", "bios", "firmware", "wmi", "uefi", "sccm", "acpi"]}