{"description": "You can use Dell Command | Update to update a Dell system with the latest drivers, BIOS, firmware, and Dell software applications.\n\nDell Command | Update provides the following new features:\n\n- Support for installing base drivers on a system that contains only an operating system, network adapter, a compatible network adapter driver, and an installation of Dell Command | Update, using the Advanced Driver Restore feature.\n- Support for updating intra-component dependencies as shown in the Partner Development Kit (PDK) catalog.\n- Notification when system restore points are created.\n- Enhanced updates Schedule — You can configure Dell Command | Update to automatically check for updates on the system at specific intervals of time\n\nSupported on OptiPlex, Venue Pro Tablet, Precision, XPS Notebook and Latitude models that are running the following Windows operating systems: Windows 7,Windows 8, Windows 8.1 and Windows 10.\n\n### Package updates\n\nThis package is updated automatically by querying the Dell Version Control Catalog. There can sometimes be a short delay between the time new software version is released and when it is added to the catalog (which is also used by Dell applications to auto-update)", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/DellCommandUpdate/5.2.0.20240309", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/DellCommandUpdate/5.2.0.20240309", "licenseUrl": "https://www.dell.com/learn/us/en/uscorp1/terms-of-sale-consumer-license-agreements", "packageName": "DellCommandUpdate", "displayName": "Dell Command | Update", "summary": "Dell utility that allows you to automate driver, BIOS and firmware updates on your system", "version": "5.2.0.20240309", "icon": "https://rawcdn.githack.com/flcdrg/au-packages/359437f27e4f72676411967fe222e27cf1d94a27/dellcommandupdate/icons/dellcommandupdate.png", "author": "Dell Inc", "downloadCount": 10286687, "tags": ["dell", "command", "update", "admin"]}