{"description": "DELL EMC System Update (DSU) is a software designed to facilitate the application of updates on various Dell systems. Using DSU you can:\n\n1. Identify the available updates, select the relevant updates, and deploy the updates on multiple systems.\n2. Maintain consistency in terms of interface and versions across Operating Systems, Repositories, and Systems.\n\nDell EMC System Update (DSU) is a script optimized update deployment tool for applying Dell Update Packages (DUP) to Dell EMC PowerEdge servers.\n\n### Features\n\n- Robust set of Command Line (CLI) attributes\n- Both Linux and Windows versions with the same features and functionality\n- DSU for Windows and Linux works with the Dell Enterprise Catalog (or a custom catalog created using Dell Repository Manager)\n- Option to create a custom bootable ISO\n- DSU is the technology used by Dell EMC Repository Manager for the Smart Bootable ISO and Smart Deployment Scrip features.\n- DSU User Guide contains a complete list of CLI attributes and sample scripts.\n\nOnce DSU is installed on a system it will:\n\n- Inventory the PowerEdge server and determine what updateable components are installed\n- Determine which components have new updates available\n- Apply those updates\n\n### Supported Operating Systems\n\n#### Microsoft Windows\n\n- Microsoft Windows Server 2012 R2 (x86_64)\n- Microsoft Windows Server 2016 (x86_64)\n- Microsoft Windows Server 2019 (x86_64)\n\nSupported Platforms: Dell EMC PowerEdge 12G and greater Servers.", "updated": "2024-03-23T21:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/dell-system-update/2.0.2.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dell-system-update/2.0.2.3", "licenseUrl": "https://www.dell.com/learn/us/en/uscorp1/terms-of-sale-consumer-license-agreements", "packageName": "dell-system-update", "displayName": "Dell EMC System Update", "summary": "DELL EMC System Update (DSU) is a software designed to facilitate the application of updates on various Dell systems.", "version": "2.0.2.3", "icon": "", "author": "Dell Inc", "downloadCount": 18900, "tags": ["dell", "servers", "emc", "system"]}