{"description": "You can use Dell Command | Update to update a Dell system with the latest drivers, BIOS, firmware, and Dell software applications.\n\nDell Command | Update provides the following new features:\n\n- Support for installing base drivers on a system that contains only an operating system, network adapter, a compatible network adapter driver, and an installation of Dell Command | Update, using the Advanced Driver Restore feature.\n- Support for updating intra-component dependencies as shown in the Partner Development Kit (PDK) catalog.\n- Notification when system restore points are created.\n- Enhanced updates Schedule — You can configure Dell Command | Update to automatically check for updates on the system at specific intervals of time\n\nThis UWP package provides the Dell Command | Update Application and is supported on OptiPlex, Venue Pro Tablet, Precision, XPS Notebook and Latitude models that are running the following Windows operating system: Windows 10 > = RS1+ (build 14393) systems.\n\n*Note that this is not an upgrade to the non-UWP version. You will need to manually uninstall older versions of Dell Command | Update before installing this Windows 10/UWP version.*\n\n#### Package updates\n\nThis package is automatically updated by referencing the data feed provided by Dell. Should it be outdated by more than a few days please leave a comment below.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/dellcommandupdate-uwp/5.2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dellcommandupdate-uwp/5.2.0", "licenseUrl": "https://www.dell.com/learn/us/en/uscorp1/terms-of-sale-consumer-license-agreements", "packageName": "dellcommandupdate-uwp", "displayName": "Dell Command | Update for Windows 10 (UWP)", "summary": "Dell utility that allows you to automate driver, BIOS and firmware updates on your system for Windows 10", "version": "5.2.0", "icon": "https://rawcdn.githack.com/flcdrg/au-packages/359437f27e4f72676411967fe222e27cf1d94a27/dellcommandupdate/icons/dellcommandupdate.png", "author": "Dell Inc", "downloadCount": 1341309, "tags": ["dell", "command", "update", "admin", "uwp", "windows10"]}