{"description": "Denemo is a free music notation program for GNU/Linux, Mac OSX and Windows that lets you rapidly enter notation which it typesets using the [LilyPond][] music engraver. Music can be typed in at the [PC-Keyboard][], or played in via [MIDI controller][], or input acoustically into a microphone plugged into your computer’s soundcard.\n\n**Denemo uses LilyPond** which generates beautiful sheet music to the highest publishing standards. During input Denemo displays the staffs in a simple fashion, so you can enter and edit the music efficiently. The typesetting is done in the background while you work, and is generally flawless publication quality. Some final tweaks can be done on the typeset score [with the mouse][] if needed.\n\n**Unique to Denemo** are methods to enter music in a musical, rather than mechanical, manner. This can be used for transcribing scores.\n\n**Another great feature** is the ability to put links in the score to the original source document that you transcribed from. \n\n**Beginner to Professional:** Denemo can be used for a brief student homework all the way to a full-scale opera. Support is there for creating the widest range of notation – Tablature, Chord Charts, Fret Diagrams, Drums, transposing instruments, ossia, ottava, cue, title pages, table-of-contents, critical commentaries, footnotes quoting music, and more with LilyPond’s extensive syntax available for even more demanding uses.\n\n[LilyPond]: https://denemo.org/lilypond\n[PC-Keyboard]: https://vimeo.com/65174334\n[MIDI controller]: https://vimeo.com/65174334\n[with the mouse]: https://vimeo.com/64408182", "updated": "2024-03-21T16:03:40Z", "galleryUrl": "https://community.chocolatey.org/packages/denemo/2.6.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/denemo/2.6.0", "licenseUrl": "https://git.savannah.gnu.org/cgit/denemo.git/tree/COPYING", "packageName": "denemo", "displayName": "Denemo (portable)", "summary": "Denemo is a free (GPL) music notation editor.", "version": "2.6.0", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@aa97972034e6c985ec1e2b167a178f85b8ac1d10/Icons/denemo_icon.png", "author": "Matthew Hiller", "downloadCount": 36, "tags": ["denemo", "lilypond", "music", "score", "FOSS"]}