{"description": "###Don't you hate logging into a new computer to find all the normal Windows desktop icons missing? It drives me nuts!\n\n###WHAT'S THIS ALL ABOUT?\n\n**This is all about quick and easy scripted new computer configurations. I want ALL standard Windows Desktop icons available!** The icons are **so** useful for power users. So I made this Windows configuration package to simplify enabling the icons. Sure, there are other methods of doing this. I can go to settings and enable them, it doesn't take that long. I can use GPO, but not all my friends/family/customers are using domain joined computers. I used to import a .reg file. Since I do put Chocolatey on just about every box I touch... I decided it was time to move this functionality into a Chocolatey package for (almost) super simple configuration, well, really so I can add it to my setup scripts. Installing this package is probably too complex for the average person, but it should be of good use to those who script or automate a lot of installs using Chocolatey. This goes along with the mentality of my [Choco Package List Backup to Local and Cloud](https://chocolatey.org/packages/choco-package-list-backup) and [InstChoco](https://chocolatey.org/packages/InstChoco) packages. Check them out if you haven't already.\n\n####Features:\n* Add/Remove the desktop My Computer/This PC/\"Computer\" icon\n* Add/Remove the desktop User's Files icon\n* Add/Remove the desktop Network icon\n* Add/Remove the desktop Control Panel icon\n* Add/Remove the desktop Recycle Bin icon\n* Add/Remove the desktop OneDrive icon (possibly Win10 only since OneDrive comes with Windows 10)\n* Add/Remove all the above desktop icons at once\n\n####But wait, there's more! I'm also throwing in for free if you install now:\n* Rename the desktop Computer icon to the the computer's name OR rename it to the computer's name with the user's name\n\n###INSTALL INSTRUCTIONS:\nYou can set the desktop icons to show (YES) or not show (NO) by running **choco install desktopicons-winconfig --params \"'/IconName:YESorNO'\"**. Below is the list of icon names and features you can use as parameters:\n\n* AllIcons        - /AllIcons:YES or /AllIcons:NO\n* Computer        - /Computer:YES or /COMPUTER:NO\n* UserFiles       - /UserFiles:YES or /UserFiles:NO\n* ControlPanel    - /ControlPanel:YES or /ControlPanel:NO\n* Network         - /Network:YES or /Network:NO\n* RecycleBin      - /RecycleBin:YES or /RecycleBin:NO\n* OneDrive        - /OneDrive:YES or /OneDrive:NO\n* RenameComputer  - /RenameComputer:YES (rename the desktop Computer icon to computer name)\n* RenameComputer  - /RenameComputer:NO (rename the desktop Computer icon to \"This PC\")\n* RenameComputer2 - /RenameComputer2:YES(rename the desktop Computer icon to computer name with user name)\n* RenameComputer  - /RenameComputer2:NO (rename the desktop Computer icon to \"This PC\")\n\nYou're desktop will blink off and return as explorer is restarted at the end of the script so the changes are immediately available.\n\n###INSTALL EXAMPLES:\n* choco install desktopicons-winconfig --params \"'/AllIcons:YES'\"\n* choco install desktopicons-winconfig --params \"'/AllIcons:YES /RenameComputer:YES'\"\n* choco install desktopicons-winconfig --params \"'/Desktop:YES /UserFiles:YES /ControlPanel:NO /Network:NO /RecycleBin:YES /OneDrive:NO'\"\n\nYou can set any one icon to display or any mix of icons to display or not display. If you don't specify any parameters, nothing will change. Default = do nothing.\n\n**There is no upgrade path for this package. desktopicons-winconfig is a \"one and done\" package. It is recommended you uninstall this package after install (settings will NOT revert) so that you can install it again under a different user account if necessary (or reinstall using -force). Settings changes only effect the currently logged in user.**\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/desktopicons-winconfig/readme.md)**", "updated": "2024-03-20T17:33:26Z", "galleryUrl": "https://community.chocolatey.org/packages/desktopicons-winconfig/0.0.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/desktopicons-winconfig/0.0.1", "licenseUrl": "https://wiki.creativecommons.org/wiki/Public_domain", "packageName": "desktopicons-winconfig", "displayName": "Windows Desktop Icons (Config)", "summary": "desktopicons-winconfig let's you turn on/off Windows desktop icons easily in scripts.", "version": "0.0.1", "icon": "https://raw.githubusercontent.com/bcurran3/ChocolateyPackages/master/desktopicons-winconfig/desktopicons-winconfig_icon.png", "author": "bcurran3", "downloadCount": 3457, "tags": ["bcurran3", "windows", "desktop", "icons", "config"]}