{"description": "Git is a free and open source distributed version control and source code management (SCM) system designed to handle everything from small to very large projects with speed and efficiency.\n      Initially designed and developed by Linus Torvalds for Linux kernel development, Git has since been adopted by many other projects.\n      Git is easy to learn and has a tiny footprint with lightning fast performance. It outclasses other SCM tools with features like cheap local branching, convenient staging areas, and multiple workflows.\n\n      This package will also:\n      - add Git (both \\bin and \\cmd) to PATH\n      - set global Git configuration « core.autocrlf » to false\n      - fix message « WARNING: terminal is not fully functional » when running log or diff commands\n\n      NOTE: This is still Git version 1.8.1.2. This package has been improved from previous version so we needed to increase the version number from 1.8.1.2 to 1.8.1.20130420.\n      NOTE: Automatic uninstall procedure is included in this package, so you don't need to manually reverse whatever actions installer did.\n      NOTE: Phrase « Devbox » in a name of this package is used as signature to indicate high quality standards. Functionally, the package is the same as any other Chocolatey package.", "updated": "2024-03-21T22:03:25Z", "galleryUrl": "https://community.chocolatey.org/packages/Devbox-Git/1.8.1.20130422", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Devbox-Git/1.8.1.20130422", "licenseUrl": "http://www.gnu.org/licenses/old-licenses/gpl-2.0.html", "packageName": "Devbox-Git", "displayName": "Devbox Git", "summary": "Git is a powerful version control system aiming to be the fastest decentralized source code management tool on this planet.", "version": "1.8.1.20130422", "icon": "https://github.com/michfield/devbox-choco/raw/master/Devbox-Git/Devbox-Git.png", "author": "Johannes Schindelin,  msysgit Committers", "downloadCount": 1615, "tags": ["devbox", "vcs", "scm", "git", "version", "control", "msysgit"]}