{"description": "DIE is a cross-platform application, apart from Windows version there are also\navailable versions for Linux and Mac OS.\n\nMany programs of the kind (PEID, PE tools) allow to use third-party signatures.\nUnfortunately, those signatures scan only bytes by the pre-set mask, and it is\nnot possible to specify additional parameters. As the result, false triggering\noften occur. More complicated algorithms are usually strictly set in the program\nitself. Hence, to add a new complex detect one needs to recompile the entire\nproject. No one, except the authors themselves, can change the algorithm of\na detect. As time passes, such programs lose relevance without the constant support.\n\nDetect It Easy has totally open architecture of signatures. You can easily\nadd your own algorithms of detects or modify those that already exist. This\nis achieved by using scripts. The script language is very similar to JavaScript\nand any person, who understands the basics of programming, will understand easily\nhow it works. Possibly, someone may decide the scripts are working very slow.\nIndeed, scripts run slower than compiled code, but, thanks to the good optimization\nof Script Engine, this doesn't cause any special inconvenience. The possibilities\nof open architecture compensate these limitations.\n\nDIE exists in three versions. Basic version (DIE), Lite version (DIEL) and\nconsole version (DIEC). All the three use the same signatures, which are located\nin the folder db. If you open this folder, nested sub-folders will be found\n(Binary, PE and others). The names of sub-folders correspond to the types of files.\nFirst, DIE determines the type of file, and then sequentially loads all the signatures,\nwhich lie in the corresponding folder. Currently the program defines the following types:\n\n* MSDOS executable files MS-DOS\n\n* PE executable files Windows\n\n* ELF executable files Linux\n\n* MACH executable files Mac OS\n\n* Text files\n\n* Binary all other files\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/die/screenshot.png)", "updated": "2024-03-23T20:48:38Z", "galleryUrl": "https://community.chocolatey.org/packages/die/3.09", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/die/3.09", "licenseUrl": "https://raw.githubusercontent.com/horsicq/Detect-It-Easy/master/LICENSE", "packageName": "die", "displayName": "Detect It Easy", "summary": "Detect It Easy, or abbreviated DIE is a program for determining types of files.", "version": "3.09", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/die/die.png", "author": "horsicq", "downloadCount": 10798, "tags": ["die", "detect", "packer", "filetype"]}