{"description": "Are you frustrated by the limitations of Windows Explorer? Directory Opus is a complete replacement for Explorer, with far more power and functionality than any other file manager available today.\n\t\n![Directory Opus](https://cdn.statically.io/gh/nicolafarina/chocolatey-packages/401d100c/directoryopus/screenshot_01.png)\n\t\n[More screenshots](https://www.gpsoft.com.au/)\n\n### Windows XP support ended\nWith 12.20 release, due to installer change, Directory Opus will not install on Windows XP anymore: application can be run installing it on modern systems and then moving files to XP machines.\n\t\n### Commercial software\nSetup starts you with a trial version that can be upgraded to perpetual adding a purchased license key.\nYou can [buy here](https://www.gpsoft.com.au/).\n\t\t\n### New versions possible checksums error (no panic)\n**Authors do not provide specific URLs for each version, so the download URL in this package will always download the latest version. Please be patient if you get checksums failure, probably due to lag between official release and new Chocolatey package. I'll try to update as soon as possible, but you can try --ignore-checksums parameter to bypass the error or, better, warn me in comments section here or by opening a GitHub issue. Thank you.**", "updated": "2024-03-24T00:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/directoryopus/13.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/directoryopus/13.4", "licenseUrl": "https://docs.dopus.com/doku.php?id=licence:end_user", "packageName": "directoryopus", "displayName": "Directory Opus", "summary": "Directory Opus is an advanced file manager for Windows!", "version": "13.4", "icon": "https://cdn.statically.io/gh/nicolafarina/chocolatey-packages/401d100c/directoryopus/DOPUS-Logo-256x256.png", "author": "GPSoftware", "downloadCount": 17257, "tags": ["directoryopus", "dopus", "directory", "opus", "filemanager", "fileexplorer", "file", "explorer", "manager", "trial"]}