{"description": "DirSync Pro is a small, but powerful utility for file and folder synchronization. DirSync Pro can be used to synchronize the content of one or many folders recursively. Use DirSync Pro to easily synchronize files from your desktop PC to your USB-stick (/External HD/PDA/Notebook, ...). Use this USB-stick (/External HD/PDA/Notebook, ...) to synchronize files to another desktop PC.\n\nUsing DirSync Pro you can make incremental backups. In this way you'll spare lots of time because you don't have to copy all the files each time you want to update your backup; only new/modified/larger files would be copied. DirSync Pro provides some preconfigured modes (e.g. Mirror, Backup, Contribute, …) for common synchronization and backup tasks and some custom modes in which the user could set up the synchronization behaviour to meet specific wishes. Prior to synchronization, DirSync Pro perfoms an analysis on files and folders and detect any kind of changes to any file/directory in the source. If a file is for example modified, removed, deleted, renamed in the source DirSync Pro synchronizes the destination accordingly. DirSync Pro detects also changes to file meta data (e.g. DOS attributes, POSIX file ownerships/group/permissions) and could preserve them to the destination file/directories.\n\nDirSync Pro has a user-friendly User Interface which helps you configure many options to your needs. You can use DirSync Pro also through the command line which makes it very flexible for running in batches.\n\nDirSync Pro lets you define advanced filters based of filename patterns (textual and regular expression based), file sizes, modification dates, file paths and file meta data to include or exclude file/directories as desired.\n\nDirSync Pro has a powerful schedule engine which lets you schedule synchronization tasks on many different ways, minutely, hourly, daily, weekly and monthly. Advanced users may use tons of options available in DirSync Pro to suit the synchronization behaviour in details. DirSync Pro has many logging facilities which let you create detailed logs even per job.\n\nDirSync Pro provides a real-time synchronization option which watches the source directory continuously and synchronizes the changes into the destination directory if a file/directory is changed.\n\n[Detailed features](http://www.dirsyncpro.org/features.html)\n[Screenshots](http://www.dirsyncpro.org/screen-shots.html)\n[FAQ](http://www.dirsyncpro.org/faq.html)", "updated": "2024-03-22T12:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/dirsyncpro/1.53", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dirsyncpro/1.53", "licenseUrl": "https://www.gnu.org/licenses/gpl-2.0.html", "packageName": "dirsyncpro", "displayName": "Directory Synchronize Pro", "summary": "File and folder bi-directional synchronization and incremental backup", "version": "1.53", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/2ce2d40089b0a2bc24fcecd137584328feeb9fd2/icons/dirsyncpro.png", "author": "O. Givi", "downloadCount": 2220, "tags": ["backup", "sync", "directory", "java"]}