{"description": "---\n\n### [choco://disk-wipe](choco://disk-wipe)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of Disk Wipe](http://www.diskwipe.org/images/diskwipe_screen1.jpg)\n\n## What is Disk Wipe?\n\nDisk Wipe is Free, portable Windows application for permanent volume data destruction. With Disk Wipe you can erase all disk data and prevent recovery of those data. Formatting a hard drive with regular method leaves an open possibility to recover the data back. Many companies and users who just dumped their old hard drives in rubbish had found this the hard way. Disk Wipe solves this problem efficiently, using a powerful algorithms which fill the volume with useless rubbish binary data multiple times. The possibility of recovering information from drive formatted with Disk Wipe is almost non existent.\n\nDisk Wipe is released as Freeware under EULA Licence. Disk Wipe is free for personal or commercial use, without any restrictions. Disk Wipe does NOT contain adware or malware!\n\nDisk Wipe is free software, support it by telling others about it.\n\n## Features of Disk Wipe\n\n* Permanently wipes sensitive data on partitions and disk volumes.\n* Portable, no installation needed!\n* Uses several advanced shredding algorithms (Dod 5220-22.M, US Army, Peter Guttman) to securely wipe data.\n* Supports all popular Windows file systems, NTFS, Fat, Fat32.\n* It uses quick format prior to disk wiping for faster performance.\n* Works with USB sticks, SD cards and other portable memory devices.\n* Small, light, does not contain adware.\n* Respect the privacy of your information, does not try to connect to remote server and does not send any information over internet.\t\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-22T06:18:42Z", "galleryUrl": "https://community.chocolatey.org/packages/disk-wipe/1.7.0.20230719", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/disk-wipe/1.7.0.20230719", "licenseUrl": "https://github.com/bcurran3/ChocolateyPackages/blob/master/disk-wipe/tools/LICENSE.txt", "packageName": "disk-wipe", "displayName": "Disk Wipe (Portable)", "summary": "Disk Wipe is Free, portable Windows application for permanent volume data destruction.", "version": "1.7.0.20230719", "icon": "https://www.diskwipe.org/images/boxshot2.jpg", "author": "Wipe Soft", "downloadCount": 2476, "tags": ["disk", "wipe", "wiper", "util", "erase", "eraser", "DoD", "5220", "portable", "embedded"]}