{"description": "With powerful capabilities and user-friendly interface, DiskGenius Free Edition provides a robust solution for individuals and organizations to seek efficient disk management.\n\n### Popular Features\n* **Partition HDD Rapidly** - Quickly partition/repartition a hard drive, SSD or USB drive into multiple partitions via simple steps to separate OS from user data or configure dual-boot on your computer.\n* **Wipe HDD/Partition** - Permanently and completely erase all data stored on the hard drive or partition so that data cannot be recovered by any data recovery software or experts.\n* **Migrate Windows OS** - Transfer the existing installation of Windows to a new HDD or SSD, including system files, personalized settings, installed applications, and data without reinstallation.\n* **Image Hard Drive** - Create a complete and exact copy of the disk and store everything into an image file. All files, partitions and boot sectors will be contained within the image file.\n* **Check HDD/SSD Health** - It can provide valuable insights into the health of your hard drives, external hard drives or SSDs by viewing the S.M.A.R.T. attributes or checking bad sectors.\n* **Clone HDD to SSD** - Cloning a hard drive to a smaller or larger SSD is convenient when you want to upgrade to a faster storage device or enhance overall system performance.\n* **Resize Partition** - Partition sizes on your disk no longer suit your needs? Easily resize/extend/split partitions without losing data to utilize the available disk space more effectively.\n* **Allocate Free Space** - Merge unallocated or unused disk space to an existing partition without losing data or create a new partition to make better use of the space.\n* **Permanently Delete Files** - Securely and completely delete files and overwrite the file data with zeros or random characters to ensure that sensitive or confidential data is not recoverable.\n* **Read Ext4/3/2 Drive** - View and open files stored on Ext4, Ext3 and Ext2 drives without installing any drivers, format a partition to Ext4/3/2, clone or resize Ext4/3/2 drives in Windows.", "updated": "2024-03-23T23:33:25Z", "galleryUrl": "https://community.chocolatey.org/packages/diskgenius/5.5.1.1508", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/diskgenius/5.5.1.1508", "licenseUrl": "https://github.com/teknowledgist/Chocolatey-packages/blob/master/automatic/diskgenius/LICENSE.txt", "packageName": "diskgenius", "displayName": "DiskGenius (Free Edition)", "summary": "An all-in-one tool for data recovery, partition management, data backup, and disk utilities.", "version": "5.5.1.1508", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@2002ce7777e445cf6b291b59d50bd59887a1c9f4/Icons/diskgenius_icon.png", "author": "EASSOS Technology Co.,  Ltd.", "downloadCount": 4610, "tags": ["diskgenius", "disk", "drive", "partition", "sector", "format", "recovery", "wipe", "Freeware"]}