{"description": "DisplayCAL (formerly known as dispcalGUI) is a display calibration and profiling solution with a focus on accuracy and versatility (in fact, the author is of the honest opinion it may be the most accurate and versatile ICC compatible display profiling solution available anywhere). At its core it relies on ArgyllCMS, an open source color management system, to take measurements, create calibrations and profiles, and for a variety of other advanced color related tasks.\n\nCalibrate and characterize your display devices using one of many supported measurement instruments, with support for multi-display setups and a variety of available options for advanced users, such as verification and reporting functionality to evaluate ICC profiles and display devices, creating video 3D LUTs, as well as optional CIECAM02 gamut mapping to take into account varying viewing conditions. Other features include:\n\nSupport of colorimeter corrections for different display device types to increase the absolute accuracy of colorimeters. Corrections can be imported from vendor software or created from measurements if a spectrometer is available.\nCheck display device uniformity via measurements.\nTest chart editor: Create charts with any amount and composition of color patches, easy copy and paste from CGATS, CSV files (only tab-delimited) and spreadsheet applications, for profile verification and evaluation.\nCreate synthetic ICC profiles with custom primaries, white- and blackpoint as well as tone response for use as working spaces or source profiles in device linking (3D LUT) transforms.\n[Screenshots](http://displaycal.net/#screenshots)  \n[Supported instruments](http://displaycal.net/#instruments) \n[Forum](http://sourceforge.net/p/dispcalgui/discussion/932493/)", "updated": "2024-03-23T03:03:34Z", "galleryUrl": "https://community.chocolatey.org/packages/displaycal.portable/3.8.9.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/displaycal.portable/3.8.9.3", "licenseUrl": "https://displaycal.net/LICENSE.txt", "packageName": "displaycal.portable", "displayName": "DisplayCAL (Portable)", "summary": "DisplayCAL (formerly known as dispcalGUI) is a display calibration and profiling solution with a focus on accuracy and versatility (in fact, the author is of the honest opinion it may be the most accurate and versatile ICC compatible display profiling solution available anywhere)", "version": "3.8.9.3", "icon": "https://raw.githubusercontent.com/sippi90/chocolateyautomaticpackages/master/icons/displaycal.png", "author": "Florian Höch", "downloadCount": 3602, "tags": ["display", "calibration", "color", "management", "temperature", "brightness", "adjust"]}