{"description": "- Display Changer changes your monitor’s resolution.\n- Display Changer runs your application. (optional)\n- Display Changer restores the original resolution. (optional)\n\nDisplay Changer changes the display resolution, runs a program, then restores the original settings. It can also change the resolution permanently and rearrange monitors in a multiple-monitor setup. This is useful for games and home-theater computers. I wrote Display Changer because there are programs that require 640×480 with 256 colors or home-theater setups that want 1920×1080 with a 24 Hz refresh rate. Instead of changing Windows display settings manually, I wrote Display Changer to do it automatically.\n\nDisplay Changer changes your desktop width, height, color depth, and refresh rate (frequency) temporarily or permanently (via command line switches). Display Changer can run another application in a specific display resolution and return to the previous resolution when the application finishes. Command line switches let you alter only certain settings and choose the best refresh rate (or a specific one).\n\n\nThere are Windows and Console editions for both 32-bit and 64-bit Windows. The Windows edition is best for creating shortcuts that quickly switch to the display configuration you want. The Console edition is best to use in a batch file or script.\n\n## Pricing\nDisplay Changer is **free** for personal and educational use. If you’d like to use it in a commercial environment (e.g., to release with a product you sell, to release with a product you use internally, or to manage company computers), you must purchase a commercial license. In brief, a commercial license entitles your company to unlimited use of Display Changer.\n\n[Download the Commercial License](https://12noon.com/files/12noon_display_changer_license.pdf)", "updated": "2024-03-23T21:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/display-changer/4.4.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/display-changer/4.4.0", "licenseUrl": "https://12noon.com/?page_id=127", "packageName": "display-changer", "displayName": "Display Changer", "summary": "Display Changer changes the display resolution, runs a program, then restores the original settings.", "version": "4.4.0", "icon": "", "author": "12noon", "downloadCount": 2712, "tags": ["display-changer", "display", "resolution"]}