{"description": "DjVu is a web-centric format and software platform for distributing documents and images. DjVu can advantageously replace PDF, PS, TIFF, JPEG, and GIF for distributing scanned documents, digital documents, or high-resolution pictures. DjVu content downloads faster, displays and renders faster, looks nicer on a screen, and consume less client resources than competing formats. DjVu images display instantly and can be smoothly zoomed and panned with no lengthy re-rendering. DjVu is used by hundreds of academic, commercial, governmental, and non-commercial web sites around the world.\nDjVuLibre is an open source (GPL'ed) implementation of DjVu, including viewers, browser plugins, decoders, simple encoders, and utilities.\n\n## Features\n- a standalone viewer for X11 that is built with the Qt GUI toolkit, and a small program that makes the viewer behave like a plug-in for all major Web browsers on Unix (Netscape-4.x, Netscape-6.x, Mozilla, Galeon, Konqueror, and Opera).\n- a bunch of command line tools and scripts to create, manipulate and convert DjVu images and documents.\n- a C++ library around which all of the above is built. This library can be used to build new viewers, new utilities, new compression algorithms, and even new codecs. It could (should) also be used to enable popular open source packages to support DjVu (Gimp, ImageMagick,....).\n\nHere is a non exhaustive list of the commands included with DjVuLibre:\n- c44: a wavelet-based continuous-tone image encoder (à la JPEG-2000).\n- cjb2: single page encoder for bitonal images (black and white scans).\n- cpaldjvu: encoder for palettized images (a la GIF, but better).\n- bzz: a general-purpose data compressor (a la bzip2).\n- djvused: a powerful command interpreter for manipulating DjVu documents.\n- ddjvu: converts DjVu documents to PBM/PGM/PPM images.\n- djvudump: displays the structure of a DjVu file.\n- djvuextract: extracts chunks from a DjVu file.\n- djvumake: assemble chunks into a DjVu file\n- djvutxt: extract the hidden\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/djvu-libre/screenshot.png)", "updated": "2024-03-24T01:18:29Z", "galleryUrl": "https://community.chocolatey.org/packages/djvu-libre/3.5.28.412", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/djvu-libre/3.5.28.412", "licenseUrl": "http://djvu.sourceforge.net/licensing.html", "packageName": "djvu-libre", "displayName": "DjVuLibre", "summary": "DjVu is a web-centric format and software platform for distributing documents and images.", "version": "3.5.28.412", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/djvu-libre/djvu-libre.png", "author": "DjVuLibre Team.", "downloadCount": 7103, "tags": ["djvu-libre", "DjVu", "web-centric", "distribute", "distributing", "format", "software", "document", "image"]}