{"description": "DnsControl is an [opinionated][] platform for seamlessly managing your DNS configuration across any number of DNS hosts, both in the cloud or in your own infrastructure. It manages all of the domains for the Stack Overflow network, and can do the same for your.\n\n## Features\n\n- Maintain your DNS data as high-level DS, with macros, and variables for easier updates.\n- Eliminate vendor lock-in. Switch DNS providers easily, any time, with full fidelity.\n- Supports 10+ DNS Providers including BIND, AWS Route 53, Google DNS, and name.com\n- All the benefits of Git (or any VCS) for your DNS zone data. View history. Accept PRs.\n- Runs on Linux, Windows, Mac, or any operating system supported by Go.\n- Assign an IP address to a constant and use the variable name throughout the configuration. Need to change the IP address globally? Just change the variable and \"recompile.\"\n- Super extensible! Plug-in architecture makes adding new DNS providers and Registrars easy!\n- Reduce point of failure: Easily maintain dual DNS providers and easily drop one that is down.\n- Apply CI/CD principles to DNS: Unit-tests, system-tests, automated deployment.\n- Optimize DNS with SPF optimizer. Detect too many lookups. Flatten includes.\n- Enable/disable Cloudflare proxying (the \"orange cloud\" button) directly from your DNSControl files.\n- Keep similar domains in sync with transforms, macros, and variables.\n\n[opinionated]: https://stackexchange.github.io/dnscontrol/opinions", "updated": "2024-03-20T01:03:31Z", "galleryUrl": "https://community.chocolatey.org/packages/dnscontrol/2.9", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dnscontrol/2.9", "licenseUrl": "https://github.com/StackExchange/dnscontrol/blob/master/LICENSE", "packageName": "dnscontrol", "displayName": "DnsControl", "summary": "DnsControl is an opinionated platform for seamlessly managing your DNS configuration across any number of DNS hosts", "version": "2.9", "icon": "", "author": "Stack Overflow", "downloadCount": 2733, "tags": ["dnscontrol"]}