{"description": "DocFetcher is an Open Source desktop search application: It allows you to search the contents of files on your computer. — You can think of it as Google for your local files. \n    \n### Notable Features\n\n* **Crap-free interface**\n* **Private with `NO` data collection**\n* **Free and Open Source**\n* **Index only what you need**\n* **64-bit support**\n* **Unicode support**\n* **Archive support**: zip, 7z, rar, and tar.*. The file extensions for zip archives can be customized and it can handle an unlimited nesting of archives.\n* **Search in source code files**: The file extensions by which DocFetcher recognizes plain text files can be customized, so you can use DocFetcher for searching in any kind of source code and other text-based file formats. (This works quite well in combination with the customizable zip extensions, e.g. for searching in Java source code inside Jar files.)\n* **Outlook PST files**: DocFetcher allows searching for Outlook emails, which Microsoft Outlook typically stores in PST files.\n* **Detection of HTML pairs**: By default, DocFetcher detects pairs of HTML files (e.g. a file named \"foo.html\" and a folder named \"foo_files\"), and treats the pair as a single document. This feature may seem rather useless at first, but it turned out that this dramatically increases the quality of the search results when you're dealing with HTML files, since all the \"clutter\" inside the HTML folders disappears from the results.\n* **Regex-based exclusion of files from indexing**: You can use regular expressions to exclude certain files from indexing.\n* **Mime-type detection**: You can use regular expressions to turn on \"mime-type detection\" for certain files, meaning that DocFetcher will try to detect their actual file types not just by looking at the filename, but also by peeking into the file contents. This comes in handy for files that have the wrong file extension.\n* **Powerful query syntax**: In addition to basic constructs like OR, AND and NOT DocFetcher also supports, among other things: Wildcards, phrase search, fuzzy search (\"find words that are similar to...\"), proximity search (\"these two words should be at most 10 words away from each other\"), boosting (\"increase the score of documents containing...\")\n\n### Supported Document Formats\n\n* Microsoft Office (doc, xls, ppt)\n* Microsoft Office 2007 and newer (docx, xlsx, pptx, docm, xlsm, pptm)\n* Microsoft Outlook (pst)\n* OpenOffice.org (odt, ods, odg, odp, ott, ots, otg, otp)\n* Portable Document Format (pdf)\n* EPUB (epub)\n* HTML (html, xhtml, ...)\n* TXT and other plain text formats (customizable)\n* Rich Text Format (rtf)\n* AbiWord (abw, abw.gz, zabw)\n* Microsoft Compiled HTML Help (chm)\n* MP3 Metadata (mp3)\n* FLAC Metadata (flac)\n* JPEG Exif Metadata (jpg, jpeg)\n* Microsoft Visio (vsd)\n* Scalable Vector Graphics (svg)\n\n### Raising the memory (optional)\nDocFetcher has a default memory limit of 256 MB.  If you try to index a very, very large number of files, and/or if some of the indexed files are really huge, DocFetcher may hit that memory limit. This package (running as an administrator) will copy additional, optional launchers with larger memory limits into the application directory (typ. `C:\\Program Files (x86)\\DocFetcher`).  This will allow non-admins to easily start DocFetcher to use more memory and optionally create a shortcut to their launcher of choice.", "updated": "2024-03-23T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/docfetcher/1.1.25.20230104", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/docfetcher/1.1.25.20230104", "licenseUrl": "https://sourceforge.net/p/docfetcher/wiki/License/", "packageName": "docfetcher", "displayName": "DocFetcher (Install)", "summary": "An Open Source desktop search application for searching the contents of files on your computer.", "version": "1.1.25.20230104", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@8953eab7f1eb6bfc8a6180897f3db1c871ecfcc1/Icons/docfetcher_icon.png", "author": "DocFetcher Development Team", "downloadCount": 14686, "tags": ["docfetcher", "search", "content", "index", "FOSS", "embedded"]}