{"description": "DocFx is a documentation generation tool for API reference and Markdown files!\n\n*DocFX* is an API documentation generator for .NET, and currently it supports C# and VB.\nIt generates API reference documentation from triple-slash comments in your source code.\nIt also allows you to use Markdown files to create additional topics such as tutorials and how-tos, and to customize the generated reference documentation.\n*DocFX* builds a static HTML website from your source code and Markdown files, which can be easily hosted on any web servers (for example, *github.io*).\nAlso, *DocFX* provides you the flexibility to customize the layout and style of your website through templates.\nIf you are interested in creating your own website with your own styles, you can follow [how to create custom template](howto_create_custom_template.md) to create custom templates.\n\n### Features\n\n* Website from Source Code and Markdown - DocFX generates Documentation directly from source code (.NET, RESTful API, JavaScript, Java, etc...) and Markdown files.\n* Run Everywhere - DocFX runs on Linux, macOS, and Windows. The generated website can be deployed to any web host with no additional configurations, e.g. Github Pages, Azure Websites...\n* Easy Customization - DocFX provides a flexible way to customize templates and themes easily.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/docfx/2.59.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/docfx/2.59.4", "licenseUrl": "https://github.com/dotnet/docfx/blob/master/LICENSE", "packageName": "docfx", "displayName": "DocFX", "summary": "DocFX makes it extremely easy to generate your API reference, landing page, and how-to.", "version": "2.59.4", "icon": "https://cdn.rawgit.com/ferventcoder/chocolatey-packages/3d0ce42525e12ad5b9cd528e8cbab011d8db4737/icons/docfx.svg", "author": "Microsoft", "downloadCount": 690334, "tags": ["docfx", "markdown", "documentation", "codecomments", "GithubFlavoredMarkdown", "GFM", "DFM"]}