{"description": "Docker is an open platform for developers and sysadmins to build, ship, and run distributed applications. This package contains the docker engine for Windows to run Windows containers on Windows hosts.\n\nNOTE: Docker engine for Windows is is simply the service to run containers. You might want to have a look at the \"docker-desktop\" package for better usability.\n\nFrom v23 docker engine is installed into `$env:ProgramFiles\\docker` (the default docker location). A shim is still generated for the docker cli.\n\n### Package Specific\nThis package by default creates the group `docker-users` and adds the installing user to it, you can customise this with package parameters. In order to communicate with docker you will need to log out and back in.\n\n**Please Note**: The docker engine requires the Windows Features: Containers and Microsoft-Hyper-V to be installed in order to function correctly. You can install these with the chocolatey command:\n`choco install Containers Microsoft-Hyper-V --source windowsfeatures`\n\n#### Package Parameters\nThe following package parameters can be set:\n\n * `/DockerGroup:` - Name of the user group for using docker - defaults to \"docker-users\"\n * `/noAddGroupUser` - Prevent adding the current user to the DockerGroup\n * `/StartService` - Automatically start (or restart) the docker service after install (or upgrade)\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install docker-engine [other options] --params=\"'/DockerGroup:my-docker-group /noAddGroupUser'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n**Please Note**: If you change the DockerGroup having previously installed docker-engine, the `daemon.json` config file will not be overwritten, you will need to manually update it.", "updated": "2024-03-24T00:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/docker-engine/26.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/docker-engine/26.0.0", "licenseUrl": "http://www.apache.org/licenses/LICENSE-2.0", "packageName": "docker-engine", "displayName": "Docker Engine", "summary": "Docker is an open platform for developers and sysadmins to build, ship, and run distributed applications.", "version": "26.0.0", "icon": "https://cdn.statically.io/gh/AJDurant/choco-docker-engine/b09de0d9597f97a074b1c10c0a6589f86fa3a93f/docker.png", "author": "Docker Contributors", "downloadCount": 52276, "tags": ["docker", "devops", "containers"]}