{"description": "![screen shot of Donkey Kong Jr](http://pjsfreeware.synthasite.com/resources/dkjnr.png)\n\n******* Donkeykong jr. A remake of the classic arcade game by Nintendo ********\n\nDonkey Kong Jr. (c) PJ Crossley 2012\n\n\nDonkey Kong Jr.  is a 1982 platform game by Nintendo. It first appeared in arcades, and, over the course of the 1980s, was later released for a variety of platforms, \n\n### Plot:\nDonkey Kong, has been imprisoned in a cage. Donkey Kong's cage is guarded by Mario, Donkey Kong Jr. must save his father from Mario by putting the key or keys in the stage into all of the locks. Mario attempts to stop DK Jr. by releasing the many animals he controls to knock DK Jr. off the vines and platforms. DK Jr. defeats Mario if the player completes the fourth stage by putting all six keys in their locks, making the floor disappear. DK Jr. catches Donkey Kong while Mario falls onto the ground. Like in Donkey Kong, if the player completes the final stage, Donkey Kong Jr. restarts at the first stage with a higher level of difficulty.\n\nDK Jr can destroy an enemy by dropping fruit on them.\n\nkeyboard:\nArrow keys to move space to jump, or redefine your own keys from menu screen F5 toggle scanlines.\n\nYou can also use a Joypad/stick.\n\n\nA big thanks to rOcko for the cool musics.\n\nmore games at:  http://pjsfreeware.synthasite.com/\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/donkeykongjr/readme.md)**", "updated": "2024-03-08T21:33:23Z", "galleryUrl": "https://community.chocolatey.org/packages/donkeykongjr/2012.03.20", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/donkeykongjr/2012.03.20", "licenseUrl": "", "packageName": "donkeykongjr", "displayName": "Donkey Kong Jr (Portable)", "summary": "PJ Crossley's remake of the classic Donkey Kong Jr game.", "version": "2012.03.20", "icon": "http://pjsfreeware.synthasite.com/resources/Rendered5.jpg", "author": "PJ Crossley", "downloadCount": 938, "tags": ["pjcrossley", "donkey", "kong", "jr", "retro", "game", "portable"]}