{"description": "Especially when old Programs run on Windows-10 or Windows 8.1 / 7. Here's more aggressive power-saving features with new rules. \n\nBut not only that, it also prevents login off the computer, and the deactivation of the monitor or activation of the screen saver. \n\nOf course you can also manually disable all the options and then activate again, but with Don't Sleep one can save now many hand moves and also save time! And it's easier than ever. \n\nApart from the fact Don't Sleep has a timer that allows time control unblock, or shutdown the computer for a specified time.   \n\n## Key Features in Don't Sleep\n\n- Don't Sleep don't change the power saving options on the system\n- From-Tray feature: power off, reboot, log off,  restart ...\n- Schedule computer to shut down at a certain time\n- Set the timer to prevent standby in windows!\n- Please Sleep Feature in Don't Sleep!\n- Start parameter in Don't Sleep! \n\n### Other features and specifications:\n- Portable Windows Program!\n- Does not burden the CPU \n- Extreme tiny size \n- Easy to use \n- Multilingual \n\n**For what! Prevent system shutdown, Standby, Hibernate, Turn Off and Restart?**\n \nThe reason for the development of the program is that some programs with a longer runtime have not considered this new power-saving features on the windows OS. \n\nYou can also manually customize the window **power saving features** or disable all the options and then reactivate them again, but you can save the time when use  Don't Sleep. Don't Sleep can also serve as a general protection if you have started a background service or application and want to prevent turn off of the computer by itself, or other persons ergo accounts. \n\nDon't Sleep has a timer that allows you to disable blocking with a timed manner, or to shut down the computer at a certain time. This is a practical function that prevents the PC to running unnecessarily, since not every PC is equipped with a quality power supply that consumes 1Watt in standby mode.\n\n### How does the program work? \n\nDepending on the setting, Don't Sleep reports to the operating system that it has very important tasks to do if the screen saver is to be activated or the monitor is to be deactivated. Likewise, it notifies the system that it has the highest shutdown priority to prevent other programs from receiving the shutdown command before Don't\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/dontsleep.portable/screenshot.png)", "updated": "2024-03-23T17:33:37Z", "galleryUrl": "https://community.chocolatey.org/packages/dontsleep.portable/9.47", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dontsleep.portable/9.47", "licenseUrl": "http://www.softwareok.com/?seite=Microsoft/DontSleep/Eula", "packageName": "dontsleep.portable", "displayName": "Don't Sleep (Portable)", "summary": "Don't Sleep is a small portable Windows program to prevent system shutdown, Standby, Hibernate, Turn Off and Restart.", "version": "9.47", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/dontsleep.portable/dontsleep.portable.png", "author": "Nenad Hrg", "downloadCount": 9801, "tags": ["dontsleep.portable", "computer", "sleep", "control"]}