{"description": "## Overview\n\nDoom is fast. DOOM(4) is fast-ish.\n\n\nBy mixing the movement speed of the old Doom, with the jumping tricks of the new DOOM, this mod is aimed to be a very fast paced experience, therefore it can be quite challenging. Even though there are no hitscan-attacking monsters, their projectiles are \"not too fast\" at best, \"holy crap, where did that come from\" at worst. The projectile attacks are there to be dodge-able most of the time, so long as you are keeping an eye (and ear) on your surroundings. However, since this was created with the idea of also being playable on a mobile device via D-Touch, where movement and aiming are somewhat diminished, additional skills were added to fit whatever playing style you prefer. Whether you want a very easy experience with a ton of monsters, or a very difficult one with fewer enemies, it's all covered!\n\nThis mod is also completely designed with multiplayer in mind via Zandronum, and extensive care was taken to ensure it works as intended in said port.\n\nCoop with your squad and kick major ass butt.\n\nOr jump into Deathmatch with the completely rebalanced weapons and see who's better at piling corpses\n\n## Addons\n\n### [D4T Keys-n-Corpses](https://www.moddb.com/mods/death-foretold/addons/d4t-keysncorpses)\n\nAn addon that can replace the keycards with corpses holding the keys. (similar to what you see in Doom(2016)", "updated": "2024-03-23T15:33:27Z", "galleryUrl": "https://community.chocolatey.org/packages/doom4-death-foretold/2.5.0.20200628", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/doom4-death-foretold/2.5.0.20200628", "licenseUrl": "", "packageName": "doom4-death-foretold", "displayName": "Doom4: Death Foretold", "summary": "Doom2 mod", "version": "2.5.0.20200628", "icon": "https://cdn.statically.io/img/media.moddb.com/cache/images/downloads/1/186/185359/thumb_620x2000/D4T-.png", "author": "DBThanatos,  strongbelly", "downloadCount": 650, "tags": ["doom4-death-foretold", "doom", "doom4", "mod", "d4t"]}