{"description": "Doom the Way id Did is a 2011 megawad for Doom containing 27 new levels designed to mimic the mapping style of Sandy Petersen, John Romero and Tom Hall. The project was founded by Hellbent as a community project and later led by a core group consisting of Ellmo, Esselfortium, Xaser, Marnetmar, and Alfonzo who oversaw the map selection and finalization process. The project also features artwork by Kracov and an optional soundtrack by Mr. Freeze.\n\n     Doom the Way id Did's official development cycle lasted sixteen months (or forty-two months counting the very first incarnation of the project). The project was met with a warm reception upon its official release, which was intentionally scheduled on Doom's 18th anniversary. On February 2, 2012, an 1.1 update was released, bringing new art for the intermission maps, fixing a few map bugs and amending the credits list.\n\n     Because of the extremely large amount of maps submitted to the project, a second release for 'runner-up' maps that didn't make it into the final project is planned but has not begun official compilation. A sequel, Doom 2 the Way id Did, has been released; and an \"Ultimate Doom the Way id Did\" expansion has been released to the public in its \"release candidate\" state on December 2nd, 2018, and was later uploaded to the /idgames archive.\n\n     In addition to the Doom II sequel, three other spin-offs were released:\n     * Doom the Way id Did: The Lost Episodes — six episodes of maps submitted to Doom the Way id Did which did not make the final cut\n     * PhobosDeimos Anomaly — twelve maps submitted to Doom the Way id Did by the late Callum Guy Oliver (phobosdeimos1)\n     * No End In Sight — four episodes of maps created by three Doom the Way id Did contributors, either new or modified from Doom the Way id Did maps\n\n     Doom the Way id Did received one of the 2012 Cacowards.", "updated": "2024-03-21T20:18:48Z", "galleryUrl": "https://community.chocolatey.org/packages/doom1-maps-dtwid/1.1.0.20200628", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/doom1-maps-dtwid/1.1.0.20200628", "licenseUrl": "", "packageName": "doom1-maps-dtwid", "displayName": "Doom the Way id Did (Doom1 Megawad)", "summary": "doom1 maps", "version": "1.1.0.20200628", "icon": "https://cdn.statically.io/img/upload.wikimedia.org/wikipedia/en/5/57/Doom_cover_art.jpg", "author": "Sandy Petersen,  John Romero,  Tom Hall", "downloadCount": 565, "tags": ["doom1-maps-dtwid", "maps", "doom1", "wad"]}