{"description": "## FEATURES\n  * All original maps ported directly from Doom 64 with accurate texturing in UDMF format\n  * Remade Doom 64 MAP33 titlemap to be used as the actual TITLEMAP\n  * Custom intermission text screens recreating the originals with text lines that fade instead of type on\n  * New introduction text screen which tells the story so far from the game manual (can be skipped at any time to get right into the game)\n  * Fixing obvious bugs and mismatched or unaligned textures present on the original levels\n  * Only minor fixes made to maps (small things that improve the original maps visually or otherwise, but the maps will not deviate from the originals)\n  * Map order is matched to Doom 64's original order exactly\n  * Bonus \"fun\" maps are accessible from a hub style selection map\n  * Reward for completing Hectic is a Megasphere (what you would get from the death traps) and some early cells\n  * Titlemap has been made into a playable level also accessible from the fun map hub\n  * Testing map included where you can see every monster, weapon, item, and prop and pit monsters against each other in a 12v12 arena\n  * \"Fake sky-hack 3D geometry\" recreated by using actual 3D floors\n  * Doom 64 style \"split doors\" recreated using scripts and sound sequences\n  * MAP20 Breakdown's \"sliding door\" effect converted to Polyobjects\n  * Scrolling cloud skies made using hires cloud textures, skyboxes and translucent 3D floors\n  * All original cloud skies match up to the color and map slot they belong in from the original game\n  * Colored sector lighting as close to Doom 64 as possible in GZDoom, will be improved in the future!\n  * Freshly written scripts for every map, which accurately recreate original game events and puzzles\n  * Toggle option to choose between a fully revamped arsenal with smoother firing animations from Cage and Almonds or the original animations\n  * Toggle option to make bullet and shell casings drop from either animation set\n  * Original push-back and recoil (purely visual) effects added to most weapons\n  * Unmaker has been recreated to function identical to the original and uses cells for ammo\n  * Three Demon Keys and upgrades to the Unmaker function as in Doom 64\n  * Doom 64 HUD has been remade and incorporated replacing the normal Status Bar\n  * G/ZDoom's alternative HUD is left unchanged, and thus still available for use if you prefer the alt hud\n  * You can see which Demon Keys you have by checking the Automap\n  * Player viewheight and size adjusted to match with Doom 64's larger map and sprite scale\n  * Player speed and gravity adjusted to match Doom 64's properties\n  * All Doom 64 monsters are remade and adjusted to match Doom 64's original behavior\n  * All items, powerups, pickups, keys, weapons, ammo, and props are recreated\n  * No additional enemies, gore effects or crazy map effects are added\n  * Simple usage of dynamic lights to enhance atmosphere, but don't worry they aren't overbearing", "updated": "2024-03-23T01:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/doom-d64rtr/1.5.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/doom-d64rtr/1.5.0", "licenseUrl": "", "packageName": "doom-d64rtr", "displayName": "doom-d64rtr (Install)", "summary": "This project is a fan recreation of Doom 64 for the Nintendo 64 to the GZDoom engine. The goal of the project is be mostly accurate to the original game as well as add very minor improvements for that extra bit of polish. Think of this mod as being an enhanced version of Doom 64 for GZDoom. We have Doom 64 EX, Doom 64 Absolution TC, GZDoom64, and Brutal Doom 64. Why you ask? I was personally dissatisfied with the quality of the GZDoom64 project, and Brutal Doom 64 (while it is a great improvement) is along the same lines but changes too much and deviates from the original Doom 64 experience. And thus, this project was born.", "version": "1.5.0", "icon": "https://cdn.statically.io/img/media.moddb.com/cache/images/downloads/1/171/170502/thumb_620x2000/d64rtr_v15.png", "author": "Nevander", "downloadCount": 560, "tags": ["doom-d64rtr", "doom", "games", "d64", "retribution"]}