{"description": "doPDF is a free PDF printer that does what the name suggests, creates PDF files. Once installed it will allow you to convert any type of printable documents to PDF files. doPDF installs itself as a virtual PDF printer driver so after a successful installation will appear in your Printers and Faxes list and also in the list of All Programs. \n\n#### Main Features\n\n* **Predefined page size**: You can select a predefined page size for the resulting PDF file. (50 different formats available)\n* **PDF output presets**: You can choose to create high quality, larger PDF files or smaller files, depending on your needs.\n* **Automatic updates**: We always recommend using the latest version of doPDF and its integrated automatic update engine will keep your version current. Update checks can be scheduled daily, weekly or monthly, but you can also disable this feature.\n* **Searchable PDFs**: You can search for text within the created PDF file (and search engines will also index the text from the PDF).\n* **Add Document info**: Add document metadata information for the resulting PDF file that helps with indexing.\n* **Graphic scale**: The content of the resulting PDF can be shrunk to 1% of the original size, or enlarged up to 400%.\n* **Always use this folder**: You can have doPDF create and save the PDF file to the same folder each time, no matter where you open the original document from.\n* **Embed font subsets**: To ensure that the resulting PDF file will look exactly as originally intended, doPDF embeds by default the font subsets used in the original document.\n* **Open with PDF reader**: You can choose to have the PDF opened with the default PDF reader once it's converted.\n* **No GhostScript**:  Doesn’t require 3rd party programs to make PDF files such as GhostScript. \n* **Multi-language**: doPDF is the ONLY free pdf maker whose interface is currently available in 33 different languages.\n\n##### Microsoft Office plugins\nThe doPDF installer also installs Microsoft Office plugins.  They are removed on an uninstall of doPDF.\n\n##### Install without telemetry\nBy default, doPDF will install with anonymized telemetry enabled.  If you wish to disable it at install time, use the parameter `/NoTelemetry`\n\nExample: `choco install doPDF -y --params=\"'/NoTelemetry'\"`", "updated": "2024-03-23T20:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/doPDF/11.9.444", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/doPDF/11.9.444", "licenseUrl": "https://github.com/teknowledgist/Chocolatey-packages/blob/master/automatic/dopdf/LICENSE.txt", "packageName": "doPDF", "displayName": "doPDF (install)", "summary": "A free PDF printer", "version": "11.9.444", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@8601e74cccb54b4ce173530ea48705b03d3a8793/Icons/dopdf_icon.png", "author": "Softland", "downloadCount": 105427, "tags": ["dopdf", "pdf", "print", "notsilent"]}