{"description": "JetBrains dotCover is a .NET unit test runner and code coverage tool that integrates with Visual Studio.\n\nMake sure you know to what extent your code is covered with unit tests. dotCover calculates and reports statement-level code coverage in applications targeting .NET Framework, Silverlight or .NET Core.\n\n### Unit tests\n\nExecute and debug unit tests and run coverage analysis of unit tests in Visual Studio or using the command-line utility. dotCover supports many unit testing frameworks including MSTest, NUnit, xUnit, and MSpec.\n\n### Manual test sessions\n\nFor manual test sessions, dotCover shows what parts of code were called during the session and which parts were not reached. Using coverage analysis data, you can easily get to the source code of the tested application.\n\n### Detecting hot spots\n\nDetect potential risk areas at a glance with Hot Spots view, which shows the most complex methods with the least coverage. Get your coverage analysis off to a good start with intuitive graphical presentation.\n\n### Seamless integration with Visual Studio\n\ndotCover integrates with Visual Studio, giving you the advantage of analyzing and visualizing code coverage without leaving the code editor. It supports Visual Studio 2010, 2012, 2013, 2015 and 2017.\n\n### Continuous testing\n\ndotCover can figure out on-the-fly which unit tests are affected by your latest code changes, and automatically re-runs the affected tests for you.\n\nThe continuous testing mode can be switched on for any unit test session: this way you can choose which tests you want to run continuously and which to run in a traditional way.\n\n#### Package Parameters\n\nThe following package parameters can be set:\n\n * `/PerMachine` - install machine-wide (instead of per-user)", "updated": "2024-03-23T12:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/dotCover/2023.3.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dotCover/2023.3.4", "licenseUrl": "https://www.jetbrains.com/resharper/buy/index.jsp?product=ultimate", "packageName": "dotCover", "displayName": "JetBrains dotCover", "summary": ".NET unit test runner and code coverage tool", "version": "2023.3.4", "icon": "https://raw.githubusercontent.com/jetbrains/chocolatey/master/dotCover/logo.png", "author": "JetBrains", "downloadCount": 80175, "tags": ["jetbrains", "developer", "admin"]}