{"description": "Effective memory usage in .NET applications with dotMemory Unit\n\nIf you run tests with a standalone unit test runner (rather than Visual Studio) or want to make memory tests a part of your continuous integration builds, then you need a standalone dotMemory Unit launcher - the dotMemoryUnit.exe command-line tool.\n\ndotMemoryUnit.exe works as a mediator - it runs a particular standalone unit test runner and provides the support for dotMemory Unit calls in the running tests.\n\n### Check for objects\n\nChecking for objects of a certain type is the main way to locate memory leaks in your code. With dotMemory Unit, you can specify a set of objects by almost any condition, calculate their number and size, and use this information in your assertions.\n\n### Check memory traffic\n\nWhen you need to simply evaluate the amount of memory allocated in a test, you can use the AssertTraffic attribute. This flexible attribute allows you to filter traffic data by object type, interface, or namespace.\n\n### Compare snapshots\n\nLike in the dotMemory profiler, you can use checkpoints not only for traffic amount assertions, but also for many kinds of snapshot comparisons.\n\n### Continue analysis in dotMemory\n\nSome memory issues will still require further manual investigation in dotMemory. Just set the rules when you want this done, and a workspace for further analysis in dotMemory will be created automatically.", "updated": "2024-03-20T20:03:32Z", "galleryUrl": "https://community.chocolatey.org/packages/dotmemory-unit/3.2.20220510", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dotmemory-unit/3.2.20220510", "licenseUrl": "https://www.jetbrains.com/legal/docs/toolbox/user/", "packageName": "dotmemory-unit", "displayName": "dotMemory Unit Standalone Launcher", "summary": "Effective memory usage in .NET applications with dotMemory Unit", "version": "3.2.20220510", "icon": "https://raw.githubusercontent.com/jetbrains/chocolatey/master/dotMemory/logo.png", "author": "JetBrains", "downloadCount": 663, "tags": ["dotmemory", "unit", "testing", "jetbrains"]}