{"description": "dotMemory allows you to analyze memory usage in a variety of .NET and .NET Core applications: desktop applications, Windows services, ASP.NET web applications, IIS, IIS Express, arbitrary .NET processes, and more.\n\n### Easily control profiling process\n\nUse timeline view to monitor memory consumed by your application in real time. Collect info on allocations as you need it.\n\n### Collect profiling data\n\nGet snapshots with a single click without stopping your profiling session, add them to compare or browse memory traffic during a particular timeframe.\n\n### Auto-detect issues\n\nThanks to multiple powerful built-in inspections, most common memory issues are detected with a single click, no manual effort required. Just get a snapshot and be guided to optimizing memory usage.\n\n### Analyse deeper\n\nFor in-depth analysis, dotMemory offers many different criteria to apply to memory usage data, so you can view data from thousands of different angles, and drill-down, dice, slice or pivot as you wish.\n\n### Determine traffic\n\nAnalyse memory traffic in a particular timeframe to know the cause of excessive allocations and garbage collections. Determine how objects were allocated and collected and what methods stay behind these allocations\n\n#### Package Parameters\n\nThe following package parameters can be set:\n\n * `/PerMachine` - install machine-wide (instead of per-user)", "updated": "2024-03-23T14:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/dotMemory/2023.3.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dotMemory/2023.3.4", "licenseUrl": "https://www.jetbrains.com/resharper/buy/index.jsp?product=ultimate", "packageName": "dotMemory", "displayName": "JetBrains dotMemory", "summary": ".NET Memory Profiler", "version": "2023.3.4", "icon": "https://rawcdn.githack.com/jetbrains/chocolatey/02759bff4a63b0cee2df2554abdea4f0aa122ee7/dotMemory/logo.png", "author": "JetBrains", "downloadCount": 67642, "tags": ["jetbrains", "developer", "admin"]}