{"description": "Free .NET decompiler and assembly browser\n### Decompile .NET assemblies to C# ###\n\ndotPeek is a free-of-charge standalone tool based on ReSharper's bundled decompiler. It can reliably decompile any .NET assembly into equivalent C# or IL code.\n\nThe decompiler supports multiple formats including libraries (.dll), executables (.exe), and Windows metadata files (.winmd).\ndotPeek can decompile any .NET assemblies\n\n### Export decompiled code to Visual Studio projects\n\nAs soon as you've decompiled an assembly, you can save it as a Visual Studio project (.csproj). This can potentially save a lot of time if you need to restore lost source code from a legacy assembly.\n\n### Download source code and debug third-party code\n\ndotPeek can identify local source code based on PDB files, or fetch source code from source servers such as Microsoft Reference Source Center or SymbolSource.\n\ndotPeek can also perform as a symbol server and supply Visual Studio debugger with the information required to debug assembly code.\n\n### Navigation and Search\n\ndotPeek inherits a lot of features from ReSharper. These include contextual and context-insensitive navigation, usage search, as well as different code structure and hierarchy views.\n\n### Find usages of any symbol\n\nUse Find Usages to search for all usages of a symbol, be it a method, property, local variable or a different entity. The Find Results tool window lets you group usages, navigate between them, and open them in the code view area.\n\n### Jump to a type, symbol or anything\n\nWhenever you put a caret on a symbol in the code view area, dotPeek offers a plethora of contextual navigation options that are all available via Navigate To drop-down menu.\n\n### Navigate to related code\n\ndotPeek indexes all assemblies in your assembly list, as well as all assemblies that they reference, and provides features to quickly jump to specific code. For instance, Go to Everything allows searching for an assembly, namespace, type, member, or a recently opened file.\n\n#### Package Parameters\n\nThe following package parameters can be set:\n\n * `/PerMachine` - install machine-wide (instead of per-user)", "updated": "2024-03-23T23:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/dotPeek/2023.3.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dotPeek/2023.3.4", "licenseUrl": "https://www.jetbrains.com/decompiler/download/license.html", "packageName": "dotPeek", "displayName": "JetBrains dotPeek", "summary": "Free .NET decompiler and assembly browser", "version": "2023.3.4", "icon": "https://raw.githubusercontent.com/jetbrains/chocolatey/master/dotPeek/logo.png", "author": "JetBrains", "downloadCount": 279448, "tags": ["jetbrains", "developer", "admin", "visualstudio"]}