{"description": "dotTrace helps you detect performance bottlenecks in a variety of .NET and .NET Core applications: WPF and Universal Windows Platform, ASP.NET, Windows and WCF services, Silverlight and unit tests.\n\n### Analyze any performance issues\n\nGet accurate data on calls execution time. In the timeline profiling mode, get the same call time data but bound to a timeline. Use timeline data to analyze performance issues where the order of events matters, such as UI freezes, excessive garbage collection, uneven workload distribution, inefficient file I/O, and others.\n\n### Profile SQL queries and HTTP requests\n\nFind out how a particular query affects application performance and why this query is running slow.\n\nIf you develop a web application, learn how it processes incoming HTTP requests.\n\n### Profile static methods and unit tests\n\nYou can instantly get comprehensive profiling data without having to build your solution, run the profiler and perform a usage scenario. Just add a static method alongside the code that you're optimizing, and profile it!\n\nIf you employ unit testing in your project, dotTrace helps you profile any test in just a few clicks. In addition, dotTrace offers a special TeamCity plugin which you can use to profile integration tests on your CI server and prevent performance regressions.\n\n### Profile and analyze results right in Visual Studio\n\nWith dotTrace you can profile, view performance timelines, analyze call stacks, and perform many more profiling actions without leaving your IDE.\n\nYou can even navigate to a method declaration from a hot spot in the call tree!\n\n#### Package Parameters\n\nThe following package parameters can be set:\n\n * `/PerMachine` - install machine-wide (instead of per-user)", "updated": "2024-03-23T12:03:33Z", "galleryUrl": "https://community.chocolatey.org/packages/dotTrace/2023.3.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dotTrace/2023.3.4", "licenseUrl": "https://www.jetbrains.com/resharper/buy/index.jsp?product=ultimate", "packageName": "dotTrace", "displayName": "JetBrains dotTrace", "summary": ".NET Performance Profiler", "version": "2023.3.4", "icon": "https://raw.githubusercontent.com/jetbrains/chocolatey/master/dotTrace/logo.png", "author": "JetBrains", "downloadCount": 78709, "tags": ["jetbrains", "developer", "admin"]}