{"description": "Doulos SIL is a Unicode-based font family that supports the wide range of languages that use the Latin and Cyrillic scripts, whether used for phonetic or orthographic needs. Linguists appreciate the wide range of characters and symbols useful in their work. This font makes use of state-of-the-art font technologies to support complex typographic issues, such as the need to position arbitrary combinations of base glyphs and diacritics optimally.\n\n#### Well-established design\nThis Doulos SIL font is essentially the same design as the SIL Doulos font first released by SIL in 1992. The design has been changed from the original in that it has been scaled down to be a better match with contemporary digital fonts, such as Times New Roman®. Read more about its design(http://software.sil.org/doulos/design/).\n\n#### IPA support\nDoulos SIL is a Unicode-encoded serif font similar to Times New Roman. Besides having a comprehensive inventory of glyphs needed for almost any Roman- or Cyrillic-based writing system, it also contains the entire inventory of the International Phonetic Alphabet (IPA). The font supports advanced OpenType and Graphite typographic features useful for multilingual texts, including careful diacritic positioning and small caps. \n\n#### Complete character set\nThe Latin and Cyrillic scripts are used to write thousands of languages around the world. Doulos SIL provides comprehensive support for these writing systems, and includes a wide range of additional characters and symbols useful for linguistics and literacy work.", "updated": "2024-03-09T04:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/doulossil/5.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/doulossil/5.0", "licenseUrl": "https://scripts.sil.org/ofl", "packageName": "doulossil", "displayName": "Doulos SIL (font)", "summary": "Complete support for the International Phonetic Alphabet", "version": "5.0", "icon": "https://cdn.rawgit.com/teknowledgist/Chocolatey-packages/master/Icons/doulossil_icon.png", "author": "SIL International", "downloadCount": 776, "tags": ["doulossil", "doulos", "sil", "font", "unicode", "serif", "latin", "cyrillic", "phonetic", "orthographic", "typography", "glyphs", "diacritics", "oss", "embedded"]}