{"description": "Drawpile is a networked drawing program that allows multiple people to sketch on the same image simultaneously. It is developed as a Free/Libre Open Source project and is available at no cost.\n\nThe goal of the project is to produce a simple, easy to use multiplatform collaboration tool. Drawpile supports the OpenRaster file format and thus works well with other Free painting applications such as Mypaint, Krita and GIMP.\n\n## Brushes and layers\nBrush parameters can be adjusted quickly from the tool box. Five tool slots allow you to prepare brush presets and switch between them quickly. Drawpile supports pressure sensitive Wacom tablets, but can also simulate pen pressure based on stroke distance and velocity.\n\nMultiple layers are supported. Layer parameters, such as transparency and blending mode, are adjustable and individual layers can be locked to prevent users from drawing on them or exclusive access can be granted to select users.\n\n## Recording and playback\nA drawing session can be recorded for later playback. Skipping ahead and backwards is possible, and interesting positions can be bookmarked for quick access. A recording can also be filtered to remove undone actions, pauses or individual events.\n\n## Online sessions\nDrawpile has a built-in server for easily hosting sessions. For more advanced usage, a dedicated server is also available. The dedicated server can host multiple sessions, as well as persistent sessions that can be rejoined even after all users have left.\n\n## Animation\nDrawpile also has basic support for creating simple animations, with features such as onionskin layer view mode, animation preview window and animated GIF export.\n\n## Package Parameters\nThe following package parameter can be set:\n\n* `-ia /DIR=\"x:\\dirname\"` - Overrides the default install directory. A fully qualified pathname must be specified.\n\n**Please Note**: This is an automatically updated package. If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T02:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/drawpile/2.1.20", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/drawpile/2.1.20", "licenseUrl": "https://github.com/callaa/Drawpile/blob/master/COPYING", "packageName": "drawpile", "displayName": "Drawpile", "summary": "Drawpile is a Free software collaborative drawing program that allows multiple users to sketch on the same canvas simultaneously.", "version": "2.1.20", "icon": "https://avatars3.githubusercontent.com/u/25749259", "author": "Calle Laakkonen", "downloadCount": 14799, "tags": ["drawpile", "drawing", "collaboration", "collaborative", "paint", "graphics", "admin"]}