{"description": "When you need to organize files, DropIt can eliminate much of the drudgery of searching and manually opening folders and moving files around.\n\nDrop a group of different files and folders on the floating DropIt image and it sorts them to defined destination folders, compresses or extracts them, opens them with associated programs or performs other defined actions.\n\nYou can define how filter your files (by name, directory, size, date, properties, content or regular expressions) and associate one of the 20 available actions to perform (Move, Copy, Compress, Extract, Rename, Delete, Split, Join, Encrypt, Decrypt, Open With, Upload, Send by Mail, Create Gallery, Create List, Create Playlist, Create Shortcut, Copy to Clipboard, Change Properties and Ignore). You can also organize your associations in profiles and automatically scan monitored folders at a defined time interval.\n\n#### Supported Actions\n\nCurrently DropIt allows to perform the following 20 actions on your files and folders:\n\n* Move: to move files/folders to the defined destination folder (for example to organize images by date and properties).\n* Copy: to copy files/folders to the defined destination folder.\n* Compress: to compress files/folders in one of the supported destination archive formats (ZIP, 7Z, Self-Extracting EXE).\n* Extract: to extract supported archives in the defined destination folder (7Z, APM, ARJ, BZIP2, CAB, CHM, CPIO, DEB, DMG, EXE, FAT, FLV, GZIP, HFS, ISO, JAR, LHA, LZH, LZMA, MBR, MSI, MSLZ, NFTS, NSIS, ONEPKG, RAR, RPM, SMZIP, SQX, SWF, TAR, UDF, VHD, WIM, XAR, XZ, Z, ZIP).\n* Rename: to rename files/folders with the defined new name (using abbreviations to customize it).\n* Delete: to delete files/folders with the defined method: Directly Remove (files are removed, but they could be restored using a recovery tool), Safely Erase (files are overwritten with the “DoD 3-pass” wiping method, to make them unrecoverable), Send to Recycle Bin (files are sent to recycle bin and are still available from there).\n* Split: to split files/folders in parts with a defined size.\n* Join: to recombine files/folders previously split (automatically trying to load missing parts).\n* Encrypt: to encrypt files/folders in the defined destination folder (to protect your personal data).\n* Decrypt: to decrypt files/folders in the defined destination folder (previously encrypted with DropIt).\n* Open With: to open files with the defined destination program (parameters supported).\n* Upload: to upload files/folders to a server using FTP or SFTP protocols.\n* Send by Mail: to attach files/folders to a mail and send them using SMTP protocol.\n* Create Gallery: to create a image gallery in the destination folder (HTML). In particular you can create galleries with several themes like Brochure, Circles, Default, Pile, SquareHeads and many others.\n* Create List: to create a list of files/folders in one of the supported destination file formats (HTML, PDF, XLS, TXT, CSV, XML). In particular you can create HTML lists with several themes like Arrowistic, Casablanca, DeepGreen, Default, Precision and many others.\n* Create Playlist: to create a playlist of files in one of the supported destination file formats (M3U, M3U8, PLS, WPL).\n* Create Shortcut: to create file/folders shortcuts in the destination folder.\n* Copy to Clipboard: to copy the desired file information to the system Clipboard.\n* Change Properties: to change file date, time and attributes.\n* Ignore: to ignore files/folders and skip them during process.", "updated": "2024-03-23T09:48:54Z", "galleryUrl": "https://community.chocolatey.org/packages/dropit.install/8.5.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dropit.install/8.5.1", "licenseUrl": "https://www.gnu.org/licenses/gpl-2.0.html", "packageName": "dropit.install", "displayName": "DropIt (Install)", "summary": "Flexible tool to automate processing and organizing files and folders", "version": "8.5.1", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/bdb8f2b28d0c7ddd767ae0a1ed97a1c06366215d/icons/dropit.png", "author": "Lupo PenSuite Team", "downloadCount": 6877, "tags": ["automation", "file-management", "organizer", "clean", "move", "sort", "admin"]}