{"description": "DSpeech is a TTS (Text To Speech) program with functionality of ASR (Automatic Speech Recognition) integrated. It is able to to read aloud the written text and choose the sentences to be pronounced based upon the vocal answers of the user. It is specifically designed to quickly and directly provide the functions and improved practical usefulness that are requested by this kind of program. In the meantime, the invasiveness and resource consumption is minimal.\n(DSpeech does not install itself, is very light, starts in a second and doesn't write anything to the registry). Some notable features of DSpeech are:\n\n1. Allows you to save the output as a .WAV, .MP3, AAC, WMA or OGG file.\n2. Allows you to quickly select different voices, even combine them, or juxtapose them in order to create dialogues between different voices.\n3. DSpeech integrates a vocal recognition system that, through a simple script language, allows you to create interactive dialogues with the user.\n4. Allows you to configure the voices in an independent way.\n5. Thanks to apposite TAGs, it allows you to dynamically change the features of the voices during the playback (speed, volume and frequency), to insert pauses, emphasize specific words, or even to spell them out.\n6. Allows you to capture and reproduce the content of the ClipBoard.\n7. DSpeech is compatible with all vocal engines (SAPI 4-5 compliant).\n8. AI dialog system. Not really useful, but amusing. It does not work in every language.\n9. It's able to dub movies; this feature synchronizes the reading subtitles (in the standard SRT format) with the playback of a movie. Player supported are Media Player Classic and later, and VideoLAN VLC Player.", "updated": "2024-03-24T00:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/dspeech/1.73.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dspeech/1.73.1", "licenseUrl": "https://en.wikipedia.org/wiki/Freeware", "packageName": "dspeech", "displayName": "DSpeech", "summary": "TTS software for Windows", "version": "1.73.1", "icon": "https://cdn.rawgit.com/sigitm/chocolatey-packages/master/icons/dspeech.png", "author": "D-Software by Dimio", "downloadCount": 9409, "tags": ["dspeech", "speech", "tts", "texttospeech", "sapi"]}