{"description": "DuckieTV is an application that takes care of TV-Show addicts by providing a personalized TV-Show calendar. DuckieTV makes sure the information is always up-to-date and gives you an integrated blocking-resistant torrent search to help you get to the right download as easy as possible.\n\nWith the integrated DuckieTorrent client you can connect DuckieTV to your local Torrent client and be updated on the download progress without switching applications. Support is available for clients of BiglyBT, Deluge, Ktorrent, qBittorrent, rTorrent, Tixati, Transmission, µTorrent/BitTorrent and Vuze.\n\nAs of v0.60 DuckieTV also is also finally becoming a worthy SickBeard competitor by introducing an automatic downloading of shows that have aired and translations into 15 languages (English, Deutch, Español, Français, Italiano, 日本, 한국어, Nederlands, Norsk bokmål, Português, Русский, Română, Slovenščina, Svenska, 简体中文).\n\n![screenshot](https://raw.githubusercontent.com/JourneyOver/chocolatey-packages/master/readme_imgs/duckietv.png)", "updated": "2024-03-23T08:33:55Z", "galleryUrl": "https://community.chocolatey.org/packages/duckietv/1.1.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/duckietv/1.1.5", "licenseUrl": "https://github.com/SchizoDuckie/DuckieTV/blob/angular/LICENSE.md", "packageName": "duckietv", "displayName": "DuckieTV", "summary": "DuckieTV is the TV-Show calendar you've been waiting for. A personalized calendar that tracks the shows you like that can search on multiple torrent sites", "version": "1.1.5", "icon": "https://cdn.rawgit.com/JourneyOver/chocolatey-packages/575bc31abcf0249da6533821231a854255a2cc4e/icons/duckietv.png", "author": "SchizoDuckie", "downloadCount": 169563, "tags": ["tv", "series-database", "calendar", "angularjs", "javascript", "episodes", "search-engine", "torrent-client", "remote-control", "angular", "nwjs", "qbittorrent", "series", "trakt", "automation", "utorrent", "js", "admin"]}