{"description": "Dukto is a program that lets you transfer all kinds of files and text to several devices, regardless of their operating systems. In short, you can transfer any file to and from Windows computers, Linux computers, and smartphones using the Android operating system.\n\nTo be able to use Dukto it's very important that you have the app installed on the two devices that you want to use in the file exchange. Luckily, the Android version takes up very little space and has an interface that's equally comfortable.\n\nSending and receiving files on both devices is very simple. You just have to select the device that you want to send the file to, and then choose the files. In a matter of seconds (as long as you have Internet access, of course) the files will be transferred to the other device. The same process applies for sending text.\n\nDukto is an excellent tool for transferring text and files that lets you share all kinds of documents in a matter of seconds. It's a magnificent alternative for anyone who's looking for an effective solution for sharing files between Windows and Android.\n\n## Features\n\n- Simple user interface\n- No server or internet connection needed\n- Zero configuration\n- Clients auto-discovery\n- High speed file transfer\n- Multi-OS native support\n- Cross platform: Windows (XP or later), OS X (10.6.x or later), Linux (packaged for Ubuntu and Fedora), Symbian (for Nokia touch phones)\n- Multi files and folders transfer\n- Transfers log\n- Send and receive text snippets (eg. useful for sending URLs)\n- Open received files directly from the application\n- Windows 7 taskbar integration with progress and transfer indicator\n- Show your IP addresses on the IP connection page\n- Full Unicode support\n- Metro style UI\n- Free and open source", "updated": "2024-03-20T14:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/dukto/6.0.0.20192215", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dukto/6.0.0.20192215", "licenseUrl": "https://choosealicense.com/licenses/gpl-2.0", "packageName": "dukto", "displayName": "Dukto R6", "summary": "Dukto is an easy file transfer tool designed for LAN use", "version": "6.0.0.20192215", "icon": "https://cdn.rawgit.com/majkinetor/chocolatey/master/dukto/icon.png", "author": "Emanuele Colombo", "downloadCount": 27426, "tags": ["filesharing", "lan", "foss", "cross-platform", "network"]}