{"description": "dupeGuru Picture Edition (PE for short) is a tool to find duplicate pictures on your computer. dupeGuru PE is a big brother of dupeGuru. It works like dupeGuru, but is specialized for duplicate pictures matching. dupeGuru PE runs on Windows, Mac OS X and Linux.\n\ndupeGuru PE is efficient. Not only can dupeGuru PE find exact matches, but it can also find duplicates among pictures of different kind (PNG, JPG, GIF etc..) and quality. On Mac OS X, dupeGuru PE can scan your iPhoto library.\n\ndupeGuru PE is customizable. You can tweak its matching engine to find exactly the kind of duplicates you want to find. The Preference page of the help file lists all the scanning engine settings you can change.\n\ndupeGuru PE is safe. Its engine has been especially designed with safety in mind. Its reference directory system as well as its grouping system prevent you from deleting pictures you didn't mean to delete.\n\nCompare any picture format. dupeGuru PE supports JPG, PNG, TIFF, GIF and BMP formats. All these formats can be compared together. The Mac OS X version of dupeGuru PE also supports PSD and RAW (CR2 and NEF) formats.\n\nYour iPhoto and Aperture libraries are supported.\n\nDo whatever you want with your duplicates. Not only can you delete duplicates files dupeGuru finds, but you can also move or copy them elsewhere. There are also multiple ways to filter and sort your results to easily weed out false duplicates (for low threshold scans).\n\nSupported languages: English, French, German, Chinese (Simplified), Czech, Italian, Armenian, Russian, Ukrainian, Brazilian, Vietnamese.\n\n[Documentation](http://hardcoded.net/dupeguru/help/en/)\n[User support forum](http://forum.hardcoded.net/1/)\n[Source code](https://github.com/hsoft/dupeguru)", "updated": "2024-03-23T09:18:55Z", "galleryUrl": "https://community.chocolatey.org/packages/dupeguru-pe/2.10.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dupeguru-pe/2.10.1", "licenseUrl": "https://raw.githubusercontent.com/hsoft/dupeguru/master/LICENSE", "packageName": "dupeguru-pe", "displayName": "dupeGuru Picture Edition", "summary": "Find duplicate pictures on your computer", "version": "2.10.1", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/640f71b3c3e4c89b85daa06c2f3b74433afcf17e/icons/dupeguru-pe.png", "author": "Virgil Dupras", "downloadCount": 2355, "tags": ["graphic", "deduplication"]}