{"description": "Duplicacy is a new generation cross-platform cloud backup tool based on the idea of [Lock-Free Deduplication](https://github.com/gilbertchen/duplicacy/wiki/Lock-Free-Deduplication).  \n\nThis repository hosts source code, design documents, and binary releases of the command line version of Duplicacy.  There is also a Duplicacy GUI frontend built for Windows and Mac OS X available from https://duplicacy.com.\n\nThere is a special edition of Duplicacy developed for VMware vSphere (ESXi) named [Vertical Backup](https://www.verticalbackup.com) that can back up virtual machine files on ESXi to local drives, network or cloud storages.\n\n## Features\n\nThere are 3 core advantages of Duplicacy over any other open-source or commercial backup tools:\n\n* Duplicacy is the *only* cloud backup tool that allows multiple computers to back up to the same cloud storage, taking advantage of cross-computer deduplication whenever possible, without direct communication among them.  This feature literally turns any cloud storage server supporting only a basic set of file operations into a sophisticated deduplication-aware server.  \n\n* Unlike other chunk-based backup tools where chunks are grouped into pack files and a chunk database is used to track which chunks are stored inside each pack file, Duplicacy takes a database-less approach where every chunk is saved independently using its hash as the file name to facilitate quick lookups.  The lack of a centralized chunk database not only makes the implementation less error-prone, but also produces a highly maintainable piece of software with plenty of room for development of new features and usability enhancements.\n\n* Duplicacy is fast.  While the performance wasn't the top-priority design goal, Duplicacy has been shown to outperform other backup tools by a considerable margin, as indicated by the following results obtained from a [benchmarking experiment](https://github.com/gilbertchen/benchmarking) backing up the [Linux code base](https://github.com/torvalds/linux) using Duplicacy and 3 other open-source backup tools.\n\n[![Comparison of Duplicacy, restic, Attic, duplicity](https://github.com/gilbertchen/duplicacy/blob/master/images/duplicacy_benchmark_speed.png \"Comparison of Duplicacy, restic, Attic, duplicity\")](https://github.com/gilbertchen/benchmarking)\n\n## Getting Started\n\n* [A brief introduction](https://github.com/gilbertchen/duplicacy/wiki/Quick-Start)\n* [Command references](https://github.com/gilbertchen/duplicacy/wiki)\n* [Building from source](https://github.com/gilbertchen/duplicacy/wiki/Installation)\n\n## Storages\n\nDuplicacy currently provides the following storage backends:\n\n* Local disk\n* SFTP\n* Dropbox\n* Amazon S3\n* Wasabi\n* DigitalOcean Spaces\n* Google Cloud Storage\n* Microsoft Azure\n* Backblaze B2\n* Google Drive\n* Microsoft OneDrive\n* Hubic\n* OpenStack Swift\n* WebDAV (under beta testing)\n* pcloud (via WebDAV)\n* Box.com (via WebDAV)\n\nPlease consult the [wiki page](https://github.com/gilbertchen/duplicacy/wiki/Storage-Backends) on how to set up Duplicacy to work with each cloud storage.\n\nFor reference, the following chart shows the running times (in seconds) of backing up the [Linux code base](https://github.com/torvalds/linux) to each of those supported storages:\n\n\n[![Comparison of Cloud Storages](https://github.com/gilbertchen/duplicacy/blob/master/images/duplicacy_benchmark_cloud.png \"Comparison of Cloud Storages\")](https://github.com/gilbertchen/cloud-storage-comparison)\n\n\nFor complete benchmark results please visit https://github.com/gilbertchen/cloud-storage-comparison.", "updated": "2024-03-22T20:18:42Z", "galleryUrl": "https://community.chocolatey.org/packages/duplicacy/3.2.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/duplicacy/3.2.3", "licenseUrl": "https://github.com/gilbertchen/duplicacy/blob/master/LICENSE.md", "packageName": "duplicacy", "displayName": "duplicacy", "summary": "Duplicacy: A lock-free deduplication cloud backup tool", "version": "3.2.3", "icon": "https://raw.githubusercontent.com/belidzs/chocolatey-duplicacy/master/images/duplicacy.png", "author": "Acrosync LLC", "downloadCount": 2363, "tags": ["duplicacy", "backup"]}