{"description": "![Screenshot of Duplicati](http://www.duplicati.com/images/news/2016-03-20-New-UI.jpg)\n\nDuplicati is a free, open source, backup client that securely stores encrypted, incremental, compressed backups on cloud storage services and remote file servers. It works with:\n\n* Amazon S3\n* OneDrive\n* Google Drive (Google Docs)\n* Rackspace Cloud Files\n* HubiC\n* Backblaze (B2)\n* Amazon Cloud Drive (AmzCD)\n* Swift / OpenStack\n* WebDAV\n* SSH (SFTP)\n* FTP\n* and more\n\nDuplicati is licensed under LGPL and available for Windows, OSX and Linux (.NET 4.5+ or Mono required).\n\n###Features\n\n* Duplicati uses AES-256 encryption (or GNU Privacy Guard) to secure all data before it is uploaded.\n* Duplicati uploads a full backup initially and stores smaller, incremental updates afterwards to save bandwidth and storage space.\n* A scheduler keeps backups up-to-date automatically.\n* Integrated updater notifies you when a new release is out\n* Encrypted backup files are transferred to targets like FTP, Cloudfiles, WebDAV, SSH (SFTP), Amazon S3 and others.\n* Duplicati allows backups of folders, document types like e.g. documents or images, or custom filter rules.\n* Duplicati is available as application with an easy-to-use user interface and as command line tool.\n* Duplicati can make proper backups of opened or locked files using the Volume Snapshot Service (VSS) under Windows or the Logical Volume Manager (LVM) under Linux. This allows Duplicati to back up the Microsoft Outlook PST file while Outlook is running.\n* Filters, deletion rules, transfer and bandwidth options, etc\n\n###Many Backends\nDuplicati works with standard protocols like FTP, SSH, WebDAV as well as popular services like Microsoft OneDrive, Amazon Cloud Drive \" S3, Google Drive, box.com, Mega, hubiC and many others.\n\n\n###Features\nBackup files and folders with strong AES-256 encryption. Save space with incremental backups and data deduplication. Run backups on any machine through the web-based interface or via command line interface. Duplicati has a built-in scheduler and auto-updater.\n\n\n###Free software\nDuplicati is free software and open source. You can use Duplicati for free even for commercial purposes. Source code is licensed under LGPL. Duplicati runs under Windows, Linux, MacOS. It requires .NET 4.5 or Mono.\n\n\n###Strong encryption\nDuplicati uses strong AES-256 encryption to protect your privacy. You can also use GPG to encrypt your backup.\n\n\n###Built for online\nDuplicati was designed for online backups from scratch. It is not only data efficient but also handles network issues nicely. E.g. interrupted backups can be resumed and Duplicati tests the content of backups regularly. That way broken backups on corrupt storage systems can be detected before it’s too late.\n\n\n###Web-based user interface\nDuplicati is configured by a web interface that runs in any browser (even mobile) and can be accessed - if you like - from anywhere. This also allows to run Duplicati on headless machines like a NAS (network attached storage).\t\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/duplicati.portable/readme.md)**", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/duplicati.portable/2.0.3.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/duplicati.portable/2.0.3.3", "licenseUrl": "https://github.com/duplicati/duplicati/blob/master/LICENSE.txt", "packageName": "duplicati.portable", "displayName": "Duplicati (Portable)", "summary": "Duplicati - Free backup software to store encrypted backups online.", "version": "2.0.3.3", "icon": "http://www.duplicati.com/images/duplicati-fb-share-v1.png", "author": "Kenneth Skovhede and Rene Stach", "downloadCount": 8744, "tags": ["duplicati", "cloud", "backup", "admin"]}