{"description": "As the original DVD Flick project is abandoned, this is a fork of this project to continue with basic support.\n\nDVD Flick aims to be a tool to convert various PC video formats to a DVD that can be played on pretty much any standalone DVD player. Its main target audience is people who know at least the basics about DVDs and video and audio files.\n\nDVD Flick aims to be a simple but at the same time powerful DVD Authoring tool. It can take a number of video files stored on your computer and turn them into a DVD that will play back on your DVD player, Media Center or Home Cinema Set. You can add additional custom audio tracks, subtitles as well as a menu for easier navigation.\n\n## Features\n- Burn near any video file to DVD\n- Support for over 45 file formats\n- Support for over 60 video codecs\n- Support for over 40 audio codecs\n- Easily add a menu\n- Add your own subtitles\n- Easy to use interface\n- Burn your project to disc after encoding\n- Completely free without any adware, spyware or limitations\nFor a more detailed list of features, see the [Features](http://www.dvdflick.net/features.php) page.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/dvdflick-v2/screenshot.png)", "updated": "2024-03-20T13:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/dvdflick-v2/1.3.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/dvdflick-v2/1.3.1.0", "licenseUrl": "https://www.gnu.org/licenses/old-licenses/gpl-2.0.txt", "packageName": "dvdflick-v2", "displayName": "DVD Flick v2", "summary": "DVD Flick aims to be a simple but at the same time powerful DVD Authoring tool. It can take a number of video files stored on your computer and turn them into a DVD that will play back on your DVD player, Media Center or Home Cinema Set.", "version": "1.3.1.0", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/dvdflick-v2/dvdflick-v2.png", "author": "DVD Flick Team.", "downloadCount": 758, "tags": ["dvdflick-v2", "DVD", "Authoring", "tool"]}