{"description": "![Screenshot of eduActiv8](https://www.eduactiv8.org/wp-content/uploads/2017/09/cross_platform-1.jpg)\n\n###eduActiv8 – Educational Activities for Kids\n\neduActiv8 (formerly pySioGame) is a free cross-platform Open Source educational program for children.\n\nThe program currently consists of over 100 short educational activities ranging from sets of flashcards presenting new knowledge as well as “simulation” activities where kids can experiment with variables and see how things change to better understand certain concepts, to good old drill activities in a form of interactive worksheets to allow the practice of newly attained skills by moving virtual objects around the screen to some extent making use of learning through play.\n\neduActiv8 is suitable for children in primary school but can be easily used before that with some guidance from parents/teachers. Currently, the activities within the program mainly focus on basic concepts of maths (learning numbers, addition, subtraction, multiplication and division, fractions, patterns, symmetry, time and much more) but also there are some language exercises (alphabet and some word activities) and general logic games and memory training exercises, puzzles, colour games, etc.\n\nThe program runs on Windows™, MacOS™, and Linux.\n\nSadly the attempt to build eduActiv8 for Android has been dropped due to an inability to provide a 64-bit version of this software which is going to be a requirement from the next year (unfortunately the support for software used to package eduActiv8 for Android has ended a long time ago), but there are works underway to use another game engine in order to redesign some of the activities and publish them for mobiles to support the development of this project.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/eduactiv8/readme.md)**\n\n***\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n***", "updated": "2024-03-21T07:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/eduactiv8/3.80.411", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/eduactiv8/3.80.411", "licenseUrl": "https://raw.githubusercontent.com/imiolek-ireneusz/eduActiv8/master/LICENSE", "packageName": "eduactiv8", "displayName": "eduActiv8 (Portable)", "summary": "iimiolek eduActiv8 (formerly pySioGame) is a free cross-platform Open Source educational program for children.", "version": "3.80.411", "icon": "https://cdn.rawgit.com/imiolek-ireneusz/eduActiv8/master/res/icon/ico256.png", "author": "Ireneusz Imiolek", "downloadCount": 933, "tags": ["eduactiv8", "kids", "educational", "game", "foss", "cross-platform", "binary"]}