{"description": "Electrum-LTC is a simple, but powerful Litecoin wallet. A twelve-word security passphrase (or “seed”) leaves intruders stranded and your peace of mind intact. Keep it on paper, or in your head... and never worry about losing your litecoins to theft or hardware failure. No waiting, no lengthy blockchain downloads and no syncing to the network.\n\n## Features\n\n- **Use instantly:** Electrum doesn't download the blockchain or require your computer to sync with the network. instead, it is maintained on a tamper-proof, remote server.\n- **Safe:** Your unique twelve word pass-phrase and private keys are never sent to the Electrum-LTC servers. All information received from the server is verified using [Simplified Payment Verification (SPV)](https://en.bitcoin.it/wiki/Thin_Client_Security#Header-Only_Clients).\n- **Forgiving:** Never be concerned about losing your wallet! With your unique twelve-word seed, you can always recover and restore your wallet... even if you sustain the worst of hardware and software failures.\n- **Cold storage:** Use Electrum-LTC to generate and manage your security offline wallets, enable you to take some or all of your funds completely offline.\n- **Accessible:** Export your private keys to other Litecoin clients, at your convenience.", "updated": "2024-03-18T11:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/electrum-ltc.install/4.2.2.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/electrum-ltc.install/4.2.2.1", "licenseUrl": "https://github.com/pooler/electrum-ltc/blob/master/LICENCE", "packageName": "electrum-ltc.install", "displayName": "Electrum-LTC (Install)", "summary": "Electrum-LTC is a simple, but powerful Litecoin wallet.", "version": "4.2.2.1", "icon": "https://cdn.jsdelivr.net/gh/AdmiringWorm/chocolatey-packages@98aeaf411ee4176a4f99ade7bf5c076e2b7ee64c/automatic/electrum-ltc/icons/electrum-ltc.png", "author": "Electrum Technologies GmbH", "downloadCount": 5563, "tags": ["electrum-ltc", "admin", "cryptocurrency", "wallet", "litecoin"]}