{"description": "## Electrum.portable\nElectrum is an easy to use Bitcoin wallet. It protects you from losing coins in a backup \nmistake or computer failure, because your wallet can be recovered from a secret phrase that \nyou can write on paper or learn by heart. There is no waiting time when you start the client, \nbecause it does not download the Bitcoin blockchain.\n\n### Features:\n* Instant on: Your client does not download the blockchain. It uses a network of specialized servers that index the blockchain.\n* Forgiving: Your wallet can be recovered from a secret seed.\n* Safe: Your seed and private keys are encrypted on your hard drive. They are never sent to the servers.\n* Low trust: Information received from the servers is verified using SPV. Servers are authenticated using SSL\n* No downtimes: Your client is not tied to a particular server; it will switch instantly if your server is down.\n* Ubiquitous: You can use the same wallet on different computers, they will synchronize automatically.\n* Cold Storage: Sign transactions from a computer that is always offline. Broadcast them using a machine that does not have your keys.\n* Reachable: You can export your private keys into other Bitcoin clients.\n* Established: Electrum is open source and was first released in November 2011.\n\n### Package-specific issue\nIf this package isn't up-to-date for some days, [Create an issue](https://github.com/tunisiano187/Chocolatey-packages/issues/new/choose)\n\nSupport the package maintainer and [![Patreon](https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@d15c4e19c709e7148588d4523ffc6dd3cd3c7e5e/icons/patreon.png)](https://www.patreon.com/tunisiano)", "updated": "2024-03-22T12:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/electrum.portable/4.5.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/electrum.portable/4.5.4", "licenseUrl": "https://raw.githubusercontent.com/spesmilo/electrum/master/LICENCE", "packageName": "electrum.portable", "displayName": "Electrum (Portable)", "summary": "Lightweight Bitcoin client", "version": "4.5.4", "icon": "https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@7cc8d197a0daa3297060d92a75902352d1cce156/icons/electrum.png", "author": "Electrum Developers", "downloadCount": 19412, "tags": ["bitcoin", "btc", "blockchain", "wallet", "cryptocurrency"]}