{"description": "**Embree**: High Performance Ray Tracing Kernels 3.6.0-beta.0 % Intel Corporation\n\n## Embree Overview\nIntel® Embree is a collection of high-performance ray tracing kernels, developed at Intel. The target users of Intel® Embree are graphics application engineers who want to improve the performance of their photo-realistic rendering application by leveraging Embree's performance-optimized ray tracing kernels. The kernels are optimized for the latest Intel® processors with support for SSE, AVX, AVX2, and AVX-512 instructions. Intel® Embree supports runtime code selection to choose the traversal and build algorithms that best matches the instruction set of your CPU. We recommend using Intel® Embree through its API to get the highest benefit from future improvements. Intel® Embree is released as Open Source under the [Apache 2.0 license](http://www.apache.org/licenses/LICENSE-2.0).\n\nIntel® Embree supports applications written with the Intel® SPMD Program Compiler (ISPC, https://ispc.github.io/) by also providing an ISPC interface to the core ray tracing algorithms. This makes it possible to write a renderer in ISPC that automatically vectorizes and leverages SSE, AVX, AVX2, and AVX-512 instructions. ISPC also supports runtime code selection, thus ISPC will select the best code path for your application.\n\nIntel® Embree contains algorithms optimized for incoherent workloads (e.g. Monte Carlo ray tracing algorithms) and coherent workloads (e.g. primary visibility and hard shadow rays).\n\nThe single-ray traversal kernels of Intel® Embree provide high performance for incoherent workloads and are very easy to integrate into existing rendering applications. Using the stream kernels, even higher performance for incoherent rays is possible, but integration might require significant code changes to the application to use the stream paradigm. In general for coherent workloads, the stream mode with coherent flag set gives the best performance.\n\nIntel® Embree also supports dynamic scenes by implementing high-performance two-level spatial index structure construction algorithms.\n\nIn addition to the ray tracing kernels, Intel® Embree provides some [Embree Tutorials](https://github.com/embree/embree#embree-tutorials) to demonstrate how to use the [Embree API](https://github.com/embree/embree#embree-api).\n\n## Supported Platforms\nEmbree supports Windows (32-bit and 64-bit), Linux (64-bit), and macOS (64-bit). The code compiles with the Intel® Compiler, GCC, Clang, and the Microsoft Compiler.\n\nUsing the Intel® Compiler improves performance by approximately 10%. Performance also varies across different operating systems, with Linux typically performing best as it supports transparently transitioning to 2MB pages.\n\nEmbree is optimized for Intel CPUs supporting SSE, AVX, AVX2, and AVX-512 instructions, and requires at least a CPU with support for SSE2.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/embree/screenshot.png)", "updated": "2024-03-17T04:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/embree/4.3.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/embree/4.3.1", "licenseUrl": "https://raw.githubusercontent.com/embree/embree/master/LICENSE.txt", "packageName": "embree", "displayName": "Intel® Embree", "summary": "Intel® Embree is a collection of high-performance ray tracing kernels, developed at Intel.", "version": "4.3.1", "icon": "", "author": "Intel Corporation", "downloadCount": 2241, "tags": ["embree", "high", "performance", "ray", "tracing", "kernel", "intel", "corporation"]}