{"description": "The Emsisoft Emergency Kit contains a collection of programs that can be used without software installation to scan for malware and clean infected computers: Emsisoft Emergency Kit Scanner and Emsisoft Commandline Scanner.\n\nEmsisoft Emergency Kit Scanner\n\nThe Emsisoft Emergency Kit Scanner includes the powerful Emsisoft Scanner complete with graphical user interface. Scan the infected PC for Viruses, Trojans, Spyware, Adware, Worms, Dialers, Keyloggers and other malicious programs.\nEmsisoft Commandline Scanner\n\nThis scanner contains the same functionality as the Emergency Kit Scanner but without a graphical user interface. The commandline tool is made for professional users and is perfect for batch jobs.\n\nTo run the Emsisoft Commandline Scanner, perform the following actions:\n\n- Open a command prompt window (Run: cmd.exe)\n- Switch to the drive of the USB Stick (e.g.: f:), then to the folder of the executable files (e.g.: cd run)\n- Run the scanner by typing: a2cmd.exe\n\nNext you will see a help page describing all available parameters.\n\nThe following parameter is an example of scanning drive c:\\ with Memory, Traces (Registry) scan enabled, and archive support active. Detected Malware is moved to quarantine.\n\na2cmd.exe /f=\"c:\\\" /m /t /a /q=\"c:\\quarantine\\\"\n\n**NOTE**: This package is automatically updated. If it is out of date and there is no newer package submitted, please use the `Contact Maintainers` functionality to alert me.", "updated": "2024-03-23T17:33:37Z", "galleryUrl": "https://community.chocolatey.org/packages/emsisoft-emergency-kit/2023.10.0.12134", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/emsisoft-emergency-kit/2023.10.0.12134", "licenseUrl": "https://www.emsisoft.com/en/company/terms/", "packageName": "emsisoft-emergency-kit", "displayName": "Emsisoft Emergency Kit", "summary": "A scanner that can be used to scan and clean infected computers.", "version": "2023.10.0.12134", "icon": "https://cdn.jsdelivr.net/gh/mikeee/ChocoPackages/icons/emsisoft-emergency-kit.png", "author": "Emsisoft Ltd", "downloadCount": 172002, "tags": ["emsisoft", "eek", "admin", "anti-spyware", "anti-malware", "malware-remover", "real-time-protection", "virus", "emergency", "kit", "scanner"]}