{"description": "## Package Parameters\n* `/DesktopShortcut` - Place a shortcut to the application on the desktop.\n* `/AddToPath` - Add the application's install folder to System PATH.\n\n## About\n\nEmulsion is a image viewer with the focus on the following features:\n* Fast\n* Light and Dark interface modes\n* Cursor Anchored Zoom\n* Pixel Art Friendly\n* Seconds To Install\n\nRefer to the [website](https://arturkovacs.github.io/emulsion-website/) for a more in-depth overview.\n\nEmulsion is targeting Windows, Mac, and Linux although it is currently only being tested on Linux and Windows. A note for Linux users: Wayland support is limited, so for example expect high CPU usage and the title text not being shown. However X is fully supported.\n\nTo build the software, obtain the latest stable release of [Rust](https://www.rust-lang.org/) and after navigating to the source directory simply run the command `cargo build --release` using your preferred command line interface.\n\nContribution is welcome. Feel free to post feature requests, bug reports, and make pull requests.\n\n## Notes on cargo features\n\nAll packages on the website come with avif support; however it is not a default feature as the dependecies are not trivial to set up. If you are bulding from source (eg using `cargo install`) and would like emulsion to open avif files, I recommend taking a look at the [release workflow](.github/workflows/release-packages.yml) for steps to install the avif development dependencies.\n\nWhen installing Emulsion through the Windows installer, Emulsion will have networking enabled and will by default check for updates. However none of the other versions have networking and neither does the default feature-set. This also means that Emulsion will not have networking dependent capabilities when invoking\n```\ncargo install emulsion\n```\n\nTo enable such features when installing with cargo, run\n```\ncargo install emulsion --features=networking\n```\n\n## Reporting bugs\n\nIf Emulsion closed unexpectedly please locate the `\"panic.txt\"` file at `%localappdata%\\emulsion\\data`\n\nWhen posting a bug report please upload the contents of this file to GitHub. If you deem it too large just paste the last panic entry between the rows of equal signs. If there's no `\"panic.txt\"` file, describe the scenario in which you experienced the faulty behaviour, and steps to reproduce it if you believe that could help.", "updated": "2024-03-23T19:03:32Z", "galleryUrl": "https://community.chocolatey.org/packages/emulsion/10.4.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/emulsion/10.4.0", "licenseUrl": "https://github.com/ArturKovacs/emulsion/blob/v10.4/LICENSE.txt", "packageName": "emulsion", "displayName": "Emulsion", "summary": "A fast and minimalistic image viewer", "version": "10.4.0", "icon": "https://cdn.statically.io/gh/ArturKovacs/emulsion/a724bde5/resource_dev/emulsion.svg", "author": "Artúr Kovács", "downloadCount": 2507, "tags": ["images", "photos", "gui", "programmable", "rust", "foss"]}