{"description": "## Unlock the Power of Pascal\nThe next generation of EVGA Precision has arrived with EVGA Precision XOC. This software allows you to fine tune your NVIDIA graphics card, maximizing cooling and performance. This new version of Precision is built for the latest NVIDIA graphics cards and combines the best of EVGA Precision and EVGA OC Scanner to give you never before seen overclocking features and built in automatic tuning.\n## New Feature: EVGA LED SYNC!\nSync your EVGA RGB Graphics Card, CLC Cooler or Chassis together with EVGA LED SYNC, now built into EVGA Precision XOC.\n## Exclusive features for EVGA graphics cards! These features will automatically enable on an EVGA graphics card:\n- DirectX 12 OSD Support – See the on screen display on DirectX 12 games.\n- EVGA GeForce 10 Series Only - EVGA OC ScannerX Integration – Automatically find your optimal voltage/frequency curve!\n- K-Boost Function – Maximize your clocks with this exclusive feature.\n- Select EVGA Cards - RGB LED control (on EVGA GeForce GTX 1080/1070 FTW)\n## Key Features\n- Full support for NVIDIA GeForce GTX graphics cards\n- Dynamically set independent voltage/frequency points for ultimate control\n- Linear mode gives you one click overclocking\n- Use the Scan mode to find the optimal voltage/frequency curve for your card!\n- Full support for Microsoft DirectX 12 (EVGA card required)\n- OSD interface with RGB color support\n- GPU, Memory and Voltage Control\n- Custom Fan Control/Fan Curve\n- Profiling system allowing up to 10 profiles with hotkey\n- In game screenshot hotkey supports BMP and JPG\n- Much more!\n## System Requirements\n- GeForce GTX graphics card (EVGA card required for full version)\n- Microsoft Windows 10, 8.1, 8, 7, Vista\n*(11/2/17) Precision XOC version 6.2.2 is not fully compatible with EVGA Flow Control. If Flow Control is open when using the LED Sync feature, your EVGA CLC will not be detected in the LED Sync menu. If this happens, close EVGA Precision XOC and Flow Control, then restart EVGA Precision XOC to resolve the issue.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/evga-precision-xoc/screenshot.png)", "updated": "2024-03-21T22:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/evga-precision-xoc/6.2.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/evga-precision-xoc/6.2.7", "licenseUrl": "https://www.evga.com/precisionxoc", "packageName": "evga-precision-xoc", "displayName": "EVGA Precision XOC", "summary": "This software allows you to fine tune your NVIDIA graphics card, maximizing cooling and performance.", "version": "6.2.7", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/evga-precision-xoc/evga-precision-xoc.png", "author": "EVGA® Corporation", "downloadCount": 1259, "tags": ["evga-precision-xoc", "tune", "NVIDIA", "graphic", "card", "cooling", "performance"]}