{"description": "Enable Viacam (eViacam) is a mouse replacement software that moves the pointer as you move your head.\n\nIt works on standard PC equipped with a webcam. No additional hardware is required. \n\n## Features\n* **Hands-free**: Control your computer with intuitive head movements. No need to use your hands!\n* **Wireless**: Works with any good quality webcam. No cables, no dots, no additional hardware required.\n* **Simple and Intuitive**: Simple installation, intuitive use. The integrated configuration wizard gets you started easily.\n* **Customizability**: Pointer speed, motion acceleration and smoothness, dwelling time, and many other variables can be adjusted to fit the user's needs.\n* **User autonomy**: Specifically designed to eliminate the need for assistance after installation.\n\n#### Useful note\n[Precision Gaze Mouse](https://precisiongazemouse.org/) is a one-click, FOSS application which provides and interesting approach for hands-free computer control. You can combine its eye-tracking technology with eViacam's face-tracking to get the best of both worlds: the speed of gaze tracking, and the precision of head tracking. You can instantly move the mouse pointer by just looking to the desired position and then use the movements of your head to reach the right spot with precision. [This page](https://precisiongazemouse.org/manual/#eviacam-instructions) describes how to set up it with eViacam.", "updated": "2024-03-18T04:33:31Z", "galleryUrl": "https://community.chocolatey.org/packages/eviacam/2.1.0.20210123", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/eviacam/2.1.0.20210123", "licenseUrl": "https://github.com/cmauri/eviacam/blob/master/COPYING", "packageName": "eviacam", "displayName": "Enable Viacam", "summary": "Head-movement as mouse replacment via webcam", "version": "2.1.0.20210123", "icon": "https://cdn.jsdelivr.net/gh/cmauri/eviacam@5212fe3bf4b1495a820af8a7eccbeb1849ca2120/src/resources/eviacam.png", "author": "Cesar Mauri Loba", "downloadCount": 1506, "tags": ["eviacam", "camera", "accessibility", "mouse", "emulation", "OSS", "embedded"]}