{"description": "![Screenshot of Exchange EDB Viewer](http://www.nucleustechnologies.com/ntimages/FreeTools/ExchangeEDBViewer.png)\n\nKernel Exchange EDB Viewer is a free tool that assists system administrators in opening EDB files without the installation of MS Exchange Server. This Exchange Mailbox Viewer tool allows to view mailboxes as well as public folders stored in EDB files. With this free-to-download solution, you can:\n\n* View the Exchange data on stand-alone workstations.\n* Open healthy as well as corrupted EDB files.\n* View user mailboxes and public folders.\n* Access EDB files through the network.\n* Search for specific items in user mailboxes and public folders.\n* Filter the mailbox data based on various criteria.\n* Open any number of EDB files absolutely free of cost.\t\n\n###Key Features of Software\nKernel Exchange EDB Viewer is an advanced and professional software for opening EDB files of MS Exchange Server. Some of the prominent features of the tool include:\n\n* An EDB explorer tool available to download and use for absolutely free of cost.\n* Assists in opening MS Exchange Server EDB files quickly and flawlessly.\n* A stand-alone tool for opening EDB files such that MS Exchange Server doesn't need to be installed on the computer system to view the data stored in EDB files.\n* Allows users to open EDB files created using any available version of MS Exchange Server.\n* Offers an easy-to-use, self-descriptive, user-friendly Graphical User Interface.\n* Lets users search EDB files available on the hard disk drive.\n* Lets users save information like Serial Number, Item Type, Attachment Existence, Date and Time of recovered items in HTML format.\n* Facilitates users viewing the calendar entries in 1 day, 5 days, 7 days, and 31 days formats.\n* Displays preview of the selected email items.\n* Round-the-clock technical support available.\n\n* MS Outlook should be installed with a profile", "updated": "2024-03-22T16:03:26Z", "galleryUrl": "https://community.chocolatey.org/packages/exchange-edb-viewer/15.9", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/exchange-edb-viewer/15.9", "licenseUrl": "", "packageName": "exchange-edb-viewer", "displayName": "Kernel Exchange EDB Viewer (Install)", "summary": "Free Exchange EDB Viewer", "version": "15.9", "icon": "http://www.nucleustechnologies.com/ntimages/logo.png", "author": "Kernel / Lepide Software", "downloadCount": 931, "tags": ["kernel", "lepide", "microsoft", "exchange", "edb", "viewer", "admin"]}