{"description": "Exercism takes place in two places: the discussions happen on the website, and you work on exercises locally. The CLI bridges the gap, allowing you to fetch exercises and submit solutions to the site.\n\nExercism is all about having conversations about code. In order to start having those conversations, you need to\ninstall the exercism command line client. The exercism command line client is the all-in-one tool for fetching\nand submitting code.  Exercism provides a launching point for this to occur. Here's how it works:\n\n1. You fetch some challenges in the form of README documents. These include associated test suites.\n2. Then write code in order to make the tests pass.\n3. Submit the code and begin the conversation with others.\n\nBy repeating this process you will:\n\n* Share while discussing how YOU solved the problem.\n* Learn from others as you discover how they solved the same problem.\n* Gain experience through repeated practice solving problems.\n\nThis is a stand-alone binary, which means that you don't need to install any particular language or environment in order to use it. To install, download the archive that matches your operating system and architecture, unpack the archive, and put the binary somewhere on your path. You will need to configure the CLI with your [Exercism API](http://exercism.io/account/key) Key before submitting. For more detailed instructions, see the [CLI page on Exercism](http://exercism.io/cli).", "updated": "2024-03-22T23:03:29Z", "galleryUrl": "https://community.chocolatey.org/packages/exercism-io-cli/3.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/exercism-io-cli/3.1.0", "licenseUrl": "https://raw.githubusercontent.com/exercism/cli/master/LICENSE", "packageName": "exercism-io-cli", "displayName": "Exercism.io CLI", "summary": "A Go based command line tool for exercism.io.", "version": "3.1.0", "icon": "https://cdn.rawgit.com/Spinarooni/chocolatey-packages/master/exercism-io-cli/exercism.png", "author": "Katrina Owen", "downloadCount": 29186, "tags": ["exercism", "code", "review", "learning"]}