{"description": "ExifToolGUI is a GUI front-end for [exiftool](https://chocolatey.org/packages/exiftool) to view metadata information with some editing features.\n\nThere are many tools for viewing/editing metadata inside image files. In my opinion, ExifTool by Phil Harvey, is the best I've found so far. Here's why:\n\n* it shows more metadata tags than any other tool,\n* it allows to edit almost any metadata tag,\n* it is very secure to use, is regularly updated and has the best possible support.\n\nThe only downside for many potential users is the fact, that ExifTool is a \"command-line\" utility. That means, there's no Graphic User Interface (GUI), so all work must be done by typing commands inside \"Command Prompt\" window. Such approach gives ExifTool great flexibility, but is somehow difficult to use -especially for those, who don't use ExifTool regularly.\n\nSo, I've decided to make some simple ExifTool GUI for my private use. There are already some GUI's that make use of ExifTool, but some of them are not flexible enough (for my needs) and/or have somehow limited use. When making ExifToolGUI, the main goal was:\n\n* view all metadata that ExifTool recognizes,\n* ability to edit most frequently used metadata tags,\n* batch capability (where appropriate), means: you can select multiple files and modify them at once.\n\nBasic idea behind GUI is, to keep it simple! Thus, only those options are implemented, which I believe, are essential for majority of users.\n\n#### Community\n* [Forum](https://exiftool.org/forum/index.php?topic=2750.0)\n\n#### Documentation\n* [Manual](https://exiftool.org/gui/)\n* [Metadata articles](https://exiftool.org/gui/articles/)", "updated": "2024-03-23T21:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/exiftoolgui/5.16.20230730", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/exiftoolgui/5.16.20230730", "licenseUrl": "http://wikipedia.org/wiki/Freeware", "packageName": "exiftoolgui", "displayName": "ExifToolGUI", "summary": "GUI front-end for exiftool", "version": "5.16.20230730", "icon": "https://cdn.jsdelivr.net/gh/TakataSanshiro/Chocolatey-Packages@master/exiftoolgui/icon.png", "author": "Bogdan Hrastnik", "downloadCount": 9539, "tags": ["metadata", "exif", "frontend", "freeware"]}