{"description": "---\n\n### [choco://expandrive](choco://expandrive)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n**ExpanDrive** is a fast network drive and browser for cloud storage.\nSecurely access the cloud from any application, including Finder and Explorer.\n\n### Built into Finder and Explorer\nExpanDrive adds cloud storage like Google Drive, Dropbox, Amazon S3, SFTP, Box, OneDrive and Sharepoint to Finder and Explorer. Don’t bother with an extra app just to move data around. ExpanDrive connects cloud storage to every application on your computer including Office 365, Photoshop, and VS Code.\n\n### Smart Offline Sync \nChoose files for offline access and work without an internet connection. Synchronization to the cloud takes place automatically when you’re back online. Other files are accessed on-demand from the cloud, taking no disk space.\n\n### Hello, Linux \nMajor storage providers have left you behind and we’re here to help. ExpanDrive adds native cloud storage access into Linux for all major Linux distributions, including Ubuntu, Mint, CentOS, Redhat, and more.\n\n### Integrated Search \nExpanDrive hooks into Spotlight Search on Mac and Windows file search. Quickly search your remote storage for whatever you’re looking for. The integrated storage browser has additional support for blazing-fast server side search.\n\n### Multi-user file locking \nExpanDrive now propagates lock files in Microsoft Office documents across the cloud. If a user is editing an Office document, other users will only be able to open that document read-only until the editing user closes it.\n\n### File Version Management \nEasily access older versions of files on cloud storage backends that support versioning, including Box, Dropbox, S3, Google Drive, OneDrive and Sharepoint.\n\n### Connect to any Cloud\nConnect to all major cloud storage providers, or your own server. With a single app you can connect to:\n* Dropbox\n* Google Drive and Google Team Drives \n* Amazon Drive\n* Box \n* OneDrive and OneDrive for Business \n* Sharepoint\n* Nextcloud \n* Wasabi\n* Backblaze B2\n* SFTP/FTP, WebDAV\n* SMB/Windows File Sharing\n\n#### ExpanDrive runs unlicensed and fully featured for 7 days giving you a chance to try everything out. Once the trial period ends you'll need to buy a license or you will be limited to 20 minutes of use.\n#### Single User license is $49.95, lifetime upgrades is +$29.95\n\n[ExpanDrive Blog](http://www.expandrive.com/blog/)", "updated": "2024-03-23T15:33:27Z", "galleryUrl": "https://community.chocolatey.org/packages/expandrive/2021.08.03", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/expandrive/2021.08.03", "licenseUrl": "http://www.expandrive.com/license-terms/", "packageName": "expandrive", "displayName": "ExpanDrive (Trial)", "summary": "Fast Network Drive for Cloud Storage", "version": "2021.08.03", "icon": "https://cdn.statically.io/gh/asheroto/ChocolateyPackages/cb02782b/ExpanDrive/icon.png", "author": "ExpanDrive,  Inc.", "downloadCount": 10009, "tags": ["expandrive", "cloud", "backup", "box", "amazon", "dropbox", "google", "openstack", "onedrive", "sftp", "webdav", "nextcloud", "wasabi", "backblaze", "sharepoint", "cross-platform", "trial"]}