{"description": "ffe is a simple, powerful Windows® front-end for FFmpeg, designed for rapid testing of its many multimedia conversion\nparameters, enabling you to save lots of slightly different versions of a file very, very quickly; in other words,\n\"find the best settings\". You basically throw in video files, set the output format, and click \"Do It!\", at which point \nFFmpeg leaps into action.\n\nFFmpeg, by Fabrice Bellard, et al., is a quite incredible command-line-only multimedia converter, capable of converting \na truly vast number of input and output media formats, and depending on which binary you use, supports either a HUGE \nnumber of control parameters, or a REALLY HUGE number of control parameters.\n\nYou can basically convert anything to anything, whilst doing crazy stuff like mixing MP3 audio tracks with H264 video,\nand adding ID3 tags to AVI files. Big fun. Of course, it allows you do do things the correct way, too. No limits.\n\nWhile converting, the console output from FFmpeg can be viewed live inside ffe, and when complete, the entire process log \nis available for viewing/searching.\n\nffe - FFmpeg front-end for windows. it's just made an MP3 of a 'classic' track!\n\nffe uniquely uses MATOF™ technology to automatically update the output file name (and extension) to match your encoding\nparameters; you can tweak-and-go, working at a rapid pace, without obliterating any of your previous tests. And then know\nexactly what parameters were used to encode each and every one of them, all without making notes.", "updated": "2024-03-19T11:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/ffe/1.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ffe/1.1", "licenseUrl": "http://corz.org/windows/software/ffe/", "packageName": "ffe", "displayName": "ffe", "summary": "ffmpeg front-end for Windows", "version": "1.1", "icon": "http://corz.org/windows/software/ffe/img/ffe-ffmpeg-front-end-logo_corz.png", "author": "corz.org", "downloadCount": 1821, "tags": ["ffmpeg", "libavcodec", "audio", "video", "convert"]}