{"description": "Fiddler is a Web Debugging Proxy which logs all HTTP(S) traffic between your computer and the Internet.\nFiddler allows you to inspect all HTTP(S) traffic, set breakpoints, and \"fiddle\" with incoming or outgoing data. Fiddler includes a powerful event-based scripting subsystem, and can be extended using any .NET language.\n\nFiddler is freeware and can debug traffic from virtually any application, including Internet Explorer, Mozilla Firefox, Opera, and thousands more.\n\n## Features\n- **Web Debugging**\nDebug traffic from PC, Mac or Linux systems and mobile (iOS and Android) devices. Ensure the proper cookies, headers and cache directives are transferred between the client and server. Supports any framework, including .NET, Java, Ruby, etc.\n- **HTTP/HTTPS Traffic Recording**\nUse Fiddler to log all HTTP(S) traffic between your computer and the Internet. Debug traffic from virtually any application that supports a proxy (IE, Chrome, Safari, Firefox, Opera and more).\n- **Web Session Manipulation**\nEdit web sessions easily:just set a breakpoint to pause the processing of the session and permit alteration of the request/response. Compose your own HTTP requests and run them through Fiddler.\n- **Security Testing**\nDecrypt HTTPS traffic and display and modify web application requests using a man-in-the-middle decryption technique. Configure Fiddler to decrypt all traffic, or only specific sessions.\n- **Performance Testing**\nFiddler lets you see the \"total page weight\", HTTP caching and compression at a glance. Isolate performance bottlenecks with rules such as \"Flag any uncompressed responses larger than 25kb\".\n- **Customizable Free Tool**\nBenefit from a rich extensibility model, ranging from simple FiddlerScript to powerful extensions which can be developed using any .NET language. [See full list of ready-made add-ons.](https://www.telerik.com/fiddler/add-ons)\n\n## Notes\n- Fiddler installs for the current user so you need to execute the `choco install fiddler` command with the user account you intend to use FIddler with. If this account does not have admin rights, you could use the [Non-Administrative install](https://chocolatey.org/install#non-administrative-install) flavor of Chocolatey.\n- The default install directory is *`%LOCALAPPDATA%`\\Programs\\Fiddler*. If you prefer to install Fiddler somewhere else, please use the `--install-arguments \"/D=install path\"` parameter.\n\n## Package parameters\n- `--install-arguments \"/D=install path\"` - (optional) Sets the install directory.\n**Example:**\n`choco install fiddler --install-arguments \"/D=C:\\Custom Install Directory\"`\n**Result:** Fiddler is installed in the *C:\\Custom Install Directory* location.", "updated": "2024-03-23T23:33:25Z", "galleryUrl": "https://community.chocolatey.org/packages/fiddler/5.0.20211.51073", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/fiddler/5.0.20211.51073", "licenseUrl": "https://www.telerik.com/purchase/license-agreement/fiddler", "packageName": "fiddler", "displayName": "Telerik Fiddler Web Debugger", "summary": "The free web debugging proxy for any browser, system or platform.", "version": "5.0.20211.51073", "icon": "https://raw.githubusercontent.com/telerik/fiddler-docs/master/images/fiddler.png", "author": "Progress", "downloadCount": 502784, "tags": ["fiddler", "web", "debugger", "http", "https", "ftp"]}