{"description": "### Note: Open Source ELK Stack does not work with agents that are based on Elastic Paid License. The apache 2.0 license (OSS) packages are limited in what it can support with ELK.\n\n## Filebeat - OSS is open-source, based on Apache2.0 License which is for open source ELK Stack.\n\nFilebeat is a lightweight shipper for forwarding and centralizing log data. Installed as an agent on your servers, Filebeat monitors the log files or locations that you specify, collects log events, and forwards them either to Elasticsearch or Logstash for indexing.\n\nForget using SSH when you have tens, hundreds, or even thousands of servers, virtual machines, and containers generating logs. Filebeat helps you keep the simple things simple by offering a lightweight way to forward and centralize logs and files.\n\nFilebeat comes with internal modules (Apache, Cisco ASA, Microsoft Azure, NGINX, MySQL, and more) that simplify the collection, parsing, and visualization of common log formats down to a single command.", "updated": "2024-03-23T09:34:34Z", "galleryUrl": "https://community.chocolatey.org/packages/filebeat-oss/8.12.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/filebeat-oss/8.12.0", "licenseUrl": "https://github.com/elastic/beats/tree/8.12/licenses/APACHE-LICENSE-2.0.txt", "packageName": "filebeat-oss", "displayName": "Filebeat - OSS", "summary": "Filebeat-OSS application is a free based on Apache2.0 license and intended for legacy open-source of logstash and elasticsearch servers. Filebeat is a lightweight shipper for forwarding and centralizing log data. Installed as an agent on your servers, Filebeat monitors the log files or locations that you specify, collects log events, and forwards them either to Elasticsearch or Logstash for indexing.", "version": "8.12.0", "icon": "https://rawcdn.githack.com/mkopnsrc/chocolatey-packages/081b33ffc1bb251042f21277ba060fdea727dad7/icons/elastic-beats.png", "author": "ElasticSearch", "downloadCount": 18691, "tags": ["filebeat", "filebeat-oss", "beats", "elastic", "kibana", "logbeats", "open-source"]}