{"description": "The FileSpy is a GUI application for the FSpy.sys or MSpy.sys, a monitoring filter driver shipped with the WDK. \n\tIts functionality is similar to the famous Filemon tool from Mark Russinovich (http://www.sysinternals.com). \n\tFileSpy is an aplication written as support to the developers, who need to monitor file system activity. \n\t\nComparing to Filemon, it contains some more functions:\n\t\n- Extended logging of IRP and Fast I/O requests\n- Advanced filtering by path, process, IRP code, Fast I/O code or operation result\n- Ability to monitor \"exotic\" file systems and network redirectors using is ability to attach by device name\n- Ability to watch requests from newly created processes\n- Ability to monitor newly mounted volumes (e.g. USB drives)\n- Ability to monitor FSD control devices. It is possible to see the IRP_MN_MOUNT_VOLUME request\n- Ability to sort requests by issuing time or completion time\n- Watching documented (and even some undocumented) IOCTL requests, with online decoding (device type, method etc.)\n- FileSpy can be executed even by normal authenticated user, if the kernel mode service is already running\n- User can choose driver (legacy FS filter FSpy.sys, minifilter MSpy.sys or minifilter FileTrace.sys)\n- Filespy can be executed before user logon.\n- Filespy can log changes to the NTFS volume using USN Journal. \n\n#### Package Parameters\nThe following package parameters can be set:\n\n * `/NOSTART` - Do not add a start menu item\n * `/DesktopIcon` - Add a desktop shorcut\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install packageID [other options] --params=\"'/ITEM:value /ITEM2:value2 /FLAG_BOOLEAN'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.", "updated": "2024-03-17T06:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/filespy/4.1.0.522", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/filespy/4.1.0.522", "licenseUrl": "", "packageName": "filespy", "displayName": "FileSpy", "summary": "Filemon for FSD and filter developers", "version": "4.1.0.522", "icon": "https://cdn.statically.io/gh/TheCakeIsNaOH/chocolatey-packages/2376f252/Icons/FileSpy.png", "author": "Ladislav Zezula", "downloadCount": 542, "tags": ["filespy"]}