{"description": "File Converter is a very simple tool which allows you to convert and compress one or several file(s) using the context menu in windows explorer. And it's FREE!\n\nThe interface is designed to be as light as possible to keep the application pleasant to use.\n\nIt supports a lot of different file formats:\n\nCategory \t| Supported output formats\t| Compatible input formats\n----------------|-------------------------------|----------------------------------------------------------------------------\n  Audio\t\t| flac, aac, ogg, mp3, wav\t| 3gp, aiff, ape, avi, bik, cda, flac, flv, m4a, mkv, mov, mp3, mp4, oga, ogg, wav, webm, wma, wmv\n  Video\t\t| webm, mkv, mp4, ogv, avi, gif\t| 3gp, avi, bik, flv, gif, m4v, mkv, mp4, mpeg, mov, ogv, webm, wmv\n  Image\t\t| png, jpg, ico, webp\t\t| bmp, exr, ico, jpg, jpeg, png, psd, svg, tiff, tga, webp, pdf, doc, docx, odt, odp, ods, ppt, pptx, xls, xlsx\n  Document       | pdf \t\t\t\t| doc, docx, odt, odp, ods, ppt, pptx, xls, xlsx, bmp, exr, ico, jpg, jpeg, png, psd, svg, tiff, tga\n\n**You need to have Microsoft Office installed in order to convert Office documents.**\n\n*Note: If your source file is a video, the conversion to an audio format will extract the audio part of the video.*\n\n*Note 2: The mkv and mp4 output file format encodes video using H.264 encoder for video and AAC encoder for audio.*\n\n*Note 3: The avi output file format encodes video using Xvid encoder for video and Mp3 encoder for audio.*", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/file-converter/2.0.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/file-converter/2.0.2", "licenseUrl": "https://github.com/Tichau/FileConverter/blob/master/LICENSE.md", "packageName": "file-converter", "displayName": "File Converter", "summary": "File Converter is a very simple tool which allows you to convert one or several file(s) using the context menu in windows explorer.", "version": "2.0.2", "icon": "https://rawcdn.githack.com/Tichau/FileConverter/64aa1750b99faf82db4136181c1288d60227aab9/Resources/Icons/ApplicationIcon.svg", "author": "Tichau", "downloadCount": 257597, "tags": ["file-converter", "file", "converter"]}