{"description": "FinalBuilder provides a graphical IDE and command line to create, debug, and run software build projects. FinalBuilder includes many actions to perform tasks at all stages of the continuous software delivery cycle.\n\nThe package will download and install FinalBuilder with the default settings. Obtaining a 30 day trail license for each new installation is required. After the trial period a full licence is required from our [store] (https://www.finalbuilder.com/store).\n\n### Built In Actions\nOver 700 actions are included for common software delivery tasks. Notiable groups of these actions include;\n\n* Build logic - If..Then, Try..Catch..Finally, Switch, While, Iterator, and Async\n* Version control - AccuRev, CVS, Git, ClearCase, JediVCS, Mercurial, TFS, Plastic SCM, PureCM, Perforce, QVCS, Subversion, Surround, and Sourcegear Vault\n* Compilers - Visual Studio .Net, Delphi, Java, and Visual Basic\n* Build - Ant, NAnt, MSBuild, and Maven\n* Testing - NUnit, MbUnit, MSTest\\VSTest, TestComplete, AQTest, and Typemock\n* Installer - InnoSetup, InstallAware, Wise, InstallAnywhere, GP Install, NullSoft, InstallShield, Advanced Installer, Setup Factory, Wix, and MSI\n* Deployment -  Web Deploy, EC2, IIS, FTP, and SFTP\n* Configuration - .Net, HyperV, VWWare, XML, Windows OS, and IIS\n\n### Custom Scripting\nAll actions provide customisation through settings as well as scripting events. These events allow custom scripted behaviour to be performed. Supported languages for scripts are JScript, VBScript, PowerShell, and IronPython.\n\n### Custom Actions - Action Studio\nCustom actions are used for large or complex custom scripting requirements. These custom actions can be backed by scripting logic or C# implementations. Custom action styles that can be written include;\n\n* Standard Actions - Simple actions that don't call an external tool.\n* Execute Actions - Actions that call an external tool to perform the desired task.\n* Iterator Actions - Tasks that require their repetition to be simplified in builds.", "updated": "2024-03-21T15:48:27Z", "galleryUrl": "https://community.chocolatey.org/packages/finalbuilder/8.0.0.3310", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/finalbuilder/8.0.0.3310", "licenseUrl": "https://www.finalbuilder.com/finalbuilder/license", "packageName": "finalbuilder", "displayName": "FinalBuilder (Install)", "summary": "FinalBuilder provides a graphical IDE to create, debug, and run software build projects. FinalBuilder includes many actions to perform tasks at all stages of the continuious software delivery cycle.", "version": "8.0.0.3310", "icon": "https://www.finalbuilder.com/images/finalbuilder/FinalBuilder-Icon-256.png", "author": "VSoft Technologies Pty. Ltd.", "downloadCount": 27721, "tags": ["finalbuilder", "automation", "IDE", "build", "cmd", "CLI", "trial"]}