{"description": "# What is FAR?\n- FAR is a tool for search and replace operations over multiple files. You can apply ordinary \"word by word\" replacement, or choose to use fully featured regular expressions.\n- FAR automatically creates backups (unless you deselect this option) and is designed to operate on files dispersed over entire directory trees.\n- For your comfort you may define search strings that span multiple lines by just typing multiple lines - no obscure construct like \"$\\r?(?s:.)^\" is required.\n- FAR wants to be this application that you only need once a year - but then you badly need it.\n\n# Why so FAR?\n- FAR has been created out of the need to change the layout of a website with hundreds of html pages. While all editors know \"find and replace\", and many support regular expressions, there is only a few that allows to:\n- Change a selection of files from different directories at once.\n- Allow search (and replace) patterns that span multiple lines.\n- Eventually FAR seeks to be fully platform independent. Being written in Java, it runs where Java runs.\n\n# How FAR Then?\n- Future development will be guided by user feedback and personal experience. Searching in archives is the next major milestone. The capabilities of the build in text viewer might be extended as well, but all this shall be guided by two major concerns: stability and usability.\n\n# Who is FAR?\n- FAR has been written by Olivier Wehner. I am a Java developer and I can't help it - I have no other hobbies.", "updated": "2024-03-22T19:03:31Z", "galleryUrl": "https://community.chocolatey.org/packages/findandreplace/2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/findandreplace/2.0", "licenseUrl": "http://findandreplace.sourceforge.net/", "packageName": "findandreplace", "displayName": "FindAndReplace", "summary": "FAR is a tool for search and replace operations over multiple files. You can apply ordinary \"word by word\" replacement, or choose to use fully featured regular expressions.", "version": "2.0", "icon": "https://cdn.rawgit.com/puddlewitt/chocolatey-packages/master/manual/findandreplace/far-logo.gif", "author": "olivierwehner", "downloadCount": 8302, "tags": ["utility", "findandreplace", "far"]}