{"description": "**A tool to install, manage and use Progressive Web Apps (PWAs) in Mozilla Firefox.**\n\nProgressive Web Apps (PWAs) are web apps that use web APIs and features along with progressive enhancement strategy to bring a native app-like user experience to cross-platform web applications. Although Firefox supports many of Progressive Web App APIs, it does not support functionality to install them as a standalone system app with an app-like experience.\n\nThis project creates a custom modified Firefox runtime to allow websites to be installed as standalone apps and provides a console tool and browser extension to install, manage and use them.\n\n## Features\n\n* Command-line tool to install, manage and run Progressive Web Apps in Firefox.\n* Extension to set up native programs, and install, manage and run PWAs and their profiles directly from the main Firefox browser.\n* Isolated Firefox installation and profile(s) that stores the PWAs.\n* Installed PWAs have their own start/app menu entry and taskbar icon, and live in their own window.\n* Installed PWAs have tabs and address bar for a better app-like feel.\n* Support for installing all websites as Progressive Web Apps.\n* Support for all Firefox addons/extensions and built-in Firefox features.\n* Support for automatic (user-triggered) installation and patching of installation and profile(s).\n\n## Notes\n\n* This package contains only the native part of the PWAsForFirefox project. You should also install the browser extension if you haven't already. You can download it from the [Firefox Add-ons](https://addons.mozilla.org/firefox/addon/pwas-for-firefox/) website.\n* This is an automatically updated package. If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T00:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/firefoxpwa/2.11.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/firefoxpwa/2.11.1", "licenseUrl": "https://github.com/filips123/PWAsForFirefox/blob/main/LICENSE", "packageName": "firefoxpwa", "displayName": "Progressive Web Apps for Firefox", "summary": "A tool to install, manage and use Progressive Web Apps (PWAs) in Mozilla Firefox (native component)", "version": "2.11.1", "icon": "https://rawcdn.githack.com/wiki/filips123/PWAsForFirefox/images/icon.png", "author": "filips", "downloadCount": 9351, "tags": ["pwas-for-firefox", "firefoxpwa", "firefox", "progressive-web-app", "webapp", "web", "foss", "open-source", "cross-platform"]}