{"description": "Adding Multiple Sites to Cloudflare via Automation\n\t If you need to add multiple sites (10+) to Cloudflare at once, you can do so via the Cloudflare API. Adding multiple sites can be useful when you:\n\t\tHave multiple domains mapping back to a single, canonical domain - e.g. domains in different countries (.com.au, .co.uk, etc) that you want to have protected by Cloudflare\n\t\tAre an agency or IT consultancy, and manage multiple domains on behalf of your customers (note: you should consider the Cloudflare Partner program)\n\t\tYou're moving an existing set of sites over to Cloudflare\n\tUsing the API will allow you to add multiple sites quickly and efficiently, especially if you are already familiar with how to change your name-servers or add a DNS record.\n\n\tAdd domains via flarectl (Cloudflare's CLI tool)\n\tYou can also add domains using flarectl, Cloudflare's official CLI\n\tYou'll need to set your API credentials first:\n\t\texport CF_API_EMAIL=you@example.com\n\t\texport CF_API_KEY=abc123def456ghi789\n\t... and then run the following command in flarectl:\n\t\tfor domain in $(cat domains.txt); do flarectl zone create --zone=$domain --jumpstart=false; done\n\tAfter this, you can get the name-servers for each domain via \"flarectl zone list\":\n\t\tfor domain in $(cat domains.txt); do flarectl zone info --zone=$domain; done", "updated": "2024-03-15T15:03:27Z", "galleryUrl": "https://community.chocolatey.org/packages/flarectl/0.46.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/flarectl/0.46.0", "licenseUrl": "https://github.com/cloudflare/cloudflare-go/blob/master/LICENSE", "packageName": "flarectl", "displayName": "flarectl, Cloudflare's official CLI.", "summary": "If you need to add multiple sites (10+) to Cloudflare at once, you can do so via the Cloudflare API. You can also add domains using flarectl, Cloudflare's official CLI.", "version": "0.46.0", "icon": "https://www.cloudflare.com/static/07c330059a6e7ba8289566756ba405aa/dns-hero-illustration.svg", "author": "Cloudflare", "downloadCount": 188, "tags": ["flarectl", "cloudflare", "cli", "tool"]}