{"description": "## License\n[Trial version license](https://wiki.eltima.com/software-licenses/fd-trial/full-fd-trial.html)\n\n## Features\n### Decompile SWF and convert to FLA\nConvert SWF to FLA within seconds! Flash Decompiler Trillix is the only application capable of converting SWF to FLA with high speed, high quality and hundreds of additional features. It is the ultimate tool to recover your lost FLA files - being the market leader since 2003! Decompile SWF files and obtain source code FLA in seconds. It supports batch conversion, so you can leave a bunch of different tasks to it and do any other things while our application is working.\nFlash Decompiler supports [Adobe Flash](https://www.swf-flv-player.com/adobe-flash-player.html) Professional CS6 & CC and conversion of SWF files with a standard Flash preloader (e.g. files with TLF texts)!\n\n### Extract SWF Elements\nFlash Decompiler Trillix comes in handy when you don't need to re-do the whole SWF file, just some of its elements. You can easily export some separate elements of a Flash file and save them to your hard drive. Images, sounds, texts, links, morphs, fonts, shapes, sprites, buttons and ActionScript can be exported in a variety of formats to let you gain the best results possible.\n\n### Edit Flash & Flex Files\nFlash Decompiler Trillix opens a wide range of new creative opportunities when it comes to editing Flash movies. A unique feature - SWF Editor lets you easily edit existing images, sounds, texts, links, colors and lines of any [Flash movie](https://www.swf-flv-player.com/free-flash-players.html). SWF files are edited on the go - alter any of its elements, save and watch the result immediately!\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/flash-decompiler-trillix/screenshot.png)", "updated": "2024-03-23T16:48:27Z", "galleryUrl": "https://community.chocolatey.org/packages/flash-decompiler-trillix/5.3.1400", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/flash-decompiler-trillix/5.3.1400", "licenseUrl": "https://wiki.eltima.com/software-licenses/fd-trial/full-fd-trial.html", "packageName": "flash-decompiler-trillix", "displayName": "Flash Decompiler Trillix", "summary": "The supreme tool to convert SWF to FLA and decompile Flash (supports Flash up to CS6 CC and ActionScript 3.0).", "version": "5.3.1400", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/flash-decompiler-trillix/flash-decompiler-trillix.png", "author": "Eltima Software", "downloadCount": 563, "tags": ["flash-decompiler-trillix", "decompile", "flash", "SWF", "convert", "FLA", "trial"]}