{"description": "BlueMaxima's Flashpoint is a webgame preservation project dedicated to preserving as many experiences from web\nplatforms, including but not limited to Adobe Flash,  as possible, so that they aren't lost to time.\n\nFlashpoint utilizes a strong selection of open-source software. By combining the power of Apache, a custom-built\nlauncher, and our own application called the Flashpoint Secure Player, we can play web-based media in a quick,\nuser-friendly environment without leaving permanent changes or security holes on your computer.\n\nFlashpoint Core is a distribution of the Flashpoint Launcher (FPL) that is tailored specifically to project\ncontributors and contains example entries for each platform.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@86ac92e13a884fe35add4e73d5bd253da10613a6/automatic/flashpoint-core/screenshot.png))\n\n## Package Parameters\n\nThe following package parameter can be set:\n\n* `/AddToDesktop` - this puts a shortcut on your desktop to Flashpoint.\n\nThese parameters can be passed to the installer with the use of `--params`.\nFor example: `--params \"/AddToDesktop\"`.\n\nTo have Chocolatey remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n## Notes\n\n* Flashpoint Core is targeted at project contributors.  If you are just looking to access the preserved content you are\nmost likely looking for [Flashpoint Infinity](https://chocolatey.org/packages/flashpoint-infinity).\n* You may be prompted by the Windows Firewall to allow the Apache HTTP Server on first execution\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T02:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/flashpoint-core/11.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/flashpoint-core/11.0", "licenseUrl": "https://github.com/FlashpointProject", "packageName": "flashpoint-core", "displayName": "Flashpoint Core - BlueMaxima's Flashpoint Core Distrbution", "summary": "An open-source desktop application used to browse, manage and run applications from the Flashpoint project", "version": "11.0", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@71d741b5e9171786eff61aea63d42c7c6ef286c6/icons/flashpoint.png", "author": "Flashpoint Contributors", "downloadCount": 856, "tags": ["flashpoint", "core", "flashpoint-core", "flash", "preservation", "sandbox", "electron", "bluepoint"]}