{"description": "Wireless, encrypted file transfer over automatically configured ad hoc networking. No network infrastructure required (access point, router, switch). Just two laptops (Mac, Linux, and Windows supported) with wireless chips in close range.\n\nDon't have a flash drive? Don't have access to a wireless network or don't trust one? Need to move a file larger than 2GB between different filesystems but don't want to set up a file share? Try it out!\n\n# Screenshots:\n\n![Picture demonstration of the Windows version](https://cdn.statically.io/gh/spieglt/FlyingCarpet/c407983/pictures/winDemo.png) \n![Picture demonstration of the macOS version](https://cdn.statically.io/gh/spieglt/FlyingCarpet/c407983/pictures/macDemo.png)\n![Picture demonstration of the GNU/Linux version](https://cdn.statically.io/gh/spieglt/FlyingCarpet/c407983/pictures/linuxDemo.png)\n\n# Features:\n\n+ Cross-platform: Linux, Mac, and Windows.\n+ Transfer multiple files at once, without losing progress if the transfer is interrupted or canceled.\n+ Speeds over 120mbps (with laptops close together).\n+ Does not use Bluetooth or your local network, just wireless chip to wireless chip.\n+ Files encrypted in transit.\n+ Large files supported (<10MB RAM usage while transferring a 4.5GB file).\n+ No installation required and no dependencies needed.\n+ Interoperable GUI and CLI versions.\n\n# Restrictions:\n\n+ The Mac version is a standard `.app` bundle, the Linux version is an executable that writes dependencies to a temp location and runs from there, and the Windows version is a `.zip` with an `.exe` and other dependencies inside. I'm working on a better solution for Windows. It was a standalone `.exe` when I was using wxWidgets but this has not been possible since moving to Qt. PRs welcome.\n+ 64-bit only. Supported Operating Systems: macOS 10.12+, Windows 7+, and Linux Mint 18. I only have access to so many laptops, so if you've tried on other platforms please let me know whether it worked. \n+ Disables your wireless internet connection while in use (does not apply to Windows when receiving).\n+ On Mac: You may have to right-click and select \"Open\" if your settings don't allow running unsigned applications. \n+ On Windows: Click \"More info\" and \"Run anyway\" if you receive a Windows SmartScreen prompt. You may also need to disable WiFi Sense.\n+ I need help testing on Linux and supporting non-Debian-based distributions! Currently only confirmed to work on Mint 18, and only on wireless cards/drivers that support ad hoc networking with `nmcli`.\n+ Flying Carpet should rejoin you to your previous wireless network after a completed or canceled transfer. This will not happen if the program freezes, crashes, or if the windows is closed during operation.\n\n# Planned features:\n\n+ Mobile versions, integrating functionality from https://github.com/claudiodangelis/qr-filetransfer.\n\nLicenses for third-party tools and libraries used can be found in the \"3rd_party_licenses\" folder.", "updated": "2024-03-10T06:48:32Z", "galleryUrl": "https://community.chocolatey.org/packages/flyingcarpet/8.0.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/flyingcarpet/8.0.1", "licenseUrl": "https://github.com/spieglt/FlyingCarpet/blob/v8.0.1/LICENSE.txt", "packageName": "flyingcarpet", "displayName": "Flying Carpet", "summary": "Encrypted file transfer over ad hoc WiFi. No network infrastructure required, just two laptops in close range. Linux, Mac, and Windows.", "version": "8.0.1", "icon": "https://cdn.statically.io/gh/Starz0r/ChocolateyPackagingScripts/527a15a/assets/flyingcarpet.png", "author": "Theron Spiegl", "downloadCount": 1245, "tags": ["foss", "cli", "admin", "linux", "mac", "macos", "windows", "encrypted", "wifi", "ad-hoc", "go", "qt", "cross-platform", "wireless", "file-transfer"]}