{"description": "FOCA is a tool used mainly to find metadata and hidden information in the documents it scans. These documents may be on\nweb pages, and can be downloaded and analysed with FOCA.\n\nIt is capable of analysing a wide variety of documents, with the most common being Microsoft Office, Open Office, or\nPDF files, although it also analyses Adobe InDesign or SVG files, for instance.\n\nThese documents are searched for using three possible search engines: Google, Bing, and DuckDuckGo. The sum of the\nresults from the three engines amounts to a lot of documents. It is also possible to add local files to extract the\nEXIF information from graphic files, and a complete analysis of the information discovered through the URL is conducted\neven before downloading the file.\n\nWith all data extracted from all files, FOCA matches information in an attempt to identify which documents have been\ncreated by the same team and what servers and clients may be infered from them.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@a5529e7b188f10bb91d6dafe44560118ade9030a/automatic/foca/screenshot.png)\n\n## Features\n\nFOCA includes a server discovery module, whose purpose is to automate the servers search process using recursively\ninterconnected routines. The techniques used to this end are:\n\n* **Web Search:** searches for hosts and domain names through URLs associated to the main domain. Each link is analyzed\nto extract from it new host and domain names.\n* **DNS Search:** each domain is checked to ascertain which are the host names configured in NS, MX, and SPF servers to\ndiscover new host and domain names.\n* **IP resolution:** each host name is resolved by comparison to the DNS to obtain the IP address associated to this\nserver name.\n* **PTR Scanning:** to find more servers in the same segment of a determined address, IP FOCA executes a PTR logs scan.\n* **Bing IP:** for each IP address discovered, a search process is launched for new domain names associated to that IP\naddress.\n* **Common names:** this module is designed to carry out dictionary attacks against the DNS.\n* **DNS Prediction:** used for those environments where a machine name has been discovered that is reason to suspect\nthat a pattern is used in the naming system.\n* **Robtex:** the Robtex service is one of many services available on the Internet to analyze IP addresses and domain\nnames. FOCA uses it in its attempt to discover new domains by searching the information available in Robtext on the\nlatter.\n\n## Package Parameters\n\nThe following package parameter can be set:\n\n* `/AddToDesktop`   - add a desktop shortcut for FOCA. By default the shortcut will be added for all users\n* `/AddToStartMenu` - add a start menue entry for FOCA. By default the shortcut will be added for all users\n* `/User`           - where the user parameter is specified any shortcuts created (`/AddToDesktop`, `/AddToStartMenu`)\nwill only be added for the current user\n\neg. `choco install -y foca --package-parameters=\"/AddToDesktop /AddToStartMenu /User\"`\n\nTo have Chocolatey remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n## Notes\n\n* A SQL Server 2014 or greater database is required.\n* When starting the FOCA will check if there is a SQL Server instance available. If none is found, FOCA will prompt a\nwindow for introducing a connection string.\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\nIf you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-16T03:48:38Z", "galleryUrl": "https://community.chocolatey.org/packages/foca/3.4.7.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/foca/3.4.7.1", "licenseUrl": "https://github.com/ElevenPaths/FOCA/blob/master/LICENSE.txt", "packageName": "foca", "displayName": "FOCA - Fingerprinting Organizations with Collected Archives", "summary": "Tool to find metadata and hidden information in documents", "version": "3.4.7.1", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@a5529e7b188f10bb91d6dafe44560118ade9030a/icons/foca.png", "author": "Eleven Paths", "downloadCount": 2335, "tags": ["metadata", "documents", "information", "security", "infosec", "forensics"]}