{"description": "Folder Size FREEWARE will analyze your hard drives and display the file sizes and folder sizes so that you can easily check the distribution of your disk space. The application will display the sizes of the folders and files and also the percentage of the total disk size that they occupy. The neat report can be sorted in order to identify the largest folders and the largest files. You can easily figure out which files or folders have filled up your drive space as Folder Size will also scan the sizes of all the subfolders. The application can scan your entire hard drive in minutes due to its optimized scan algorithms and list details on the tree size and file sizes. The progressive scan will let you continue the scan from the point of interruption.\nBesides scanning an entire hard drive Folder Size can also scan a single folder in order to save time. This tool will help you to easily cleanup your disk by listing all the file sizes and folder sizes in a neat report.\n\nFolder Size can list backup folders, system folders and also the system volume information folder - all missing disk space will be revealed instantly.\n\n## Features\n\n- Find and display all file sizes and folder sizes.\n- Scan entire storage device or a chosen folder.\n- Display the file sizes and folder sizes in different charts - Bar Chart, Pie Chart etc.\n- Detailed information for all the file sizes and folder sizes listed in table:\n  - Name\n  - Folder size or File Size\n  - File size or folder size percentage from the parent folders size\n  - Files count inside the folder\n  - Subfolders count\n  - Creation time\n  - Last modification time\n  - Last access time\n  - Folder owner and group\n- File and folder reports:\n  - Largest Files\n  - Largest Folders\n  - Largest Files And Folders\n  - Oldest Files\n  - Oldest Folders\n  - Oldest Files And Folders\n  - Newest Files\n  - Newest Folders\n  - Newest Files and Folders\n  - Longest Paths and Longest File Names\n- Sort option based on all the different criteria listed above - folder name, folder size, file size etc.\n- Scan folder using Drag And Drop\n- Command line option to scan a folder's tree size -scan \"folder path\"\n- \"Scan with Folder Size\" Windows Explorer context menu\n- Option to rearrange or hide the columns in the list in order to suit your preferences.\n- Option to display the file sizes and folder sizes in Bytes, Kilobytes, Megabytes, Gigabytes or automatically determine the most appropriate size format.\n- Locate selected folder or file from the tree size in Windows Explorer via a context menu\n- Show Windows folder or file properties dialog\n- Delete folders or files.\n- Open files with associated application using double click.\n- Remove folders or files from the tree size list in order to check the folder size after deleting the item.\n- Support for all types of storage devices - hard drives, CDROM, USB Drives, Floppy disks\n- Progressive scan. If you have stopped a scan it will continue form the point of interruption saving processing time. If you have removed items from the list subsequent scan will be very quick by only updating the missing items.\n- Easy Explorer-style navigation via Back, Forward and Folder Up tool buttons\n- Detailed disk size information list including - total disk size, drive used space and drive free space.\n- Intuitive Explorer-style user interface and rich documentation\n- Export file sizes and folder sizes to a CSV or XML file.\n- Save/Load the scanned data for the file sizes and folder sizes so that you can compare it with subsequent scans.\n\n## Notes\n\n- A license needs to be purchased when running on server OS's.", "updated": "2024-03-22T20:48:45Z", "galleryUrl": "https://community.chocolatey.org/packages/Folder_Size/5.3.0.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Folder_Size/5.3.0.2", "licenseUrl": "", "packageName": "Folder_Size", "displayName": "Folder Size", "summary": "Folder Size is a powerful FREE utility that can scan and display all the file and folder tree sizes on your hard drives.", "version": "5.3.0.2", "icon": "https://cdn.jsdelivr.net/gh/AdmiringWorm/chocolatey-packages@326c35b16940e459917efa504bf3a48ed6fc3d8d/automatic/folder_size/icons/folder_size.png", "author": "https://www.mindgems.com", "downloadCount": 11256, "tags": ["folder_size", "folder", "size", "drive", "space", "windows", "file", "freeware", "trial"]}