{"description": "![Screenshot of Free PST Reader](http://ost2pstware.com/img/guide/p-v4.png)\n\n###Key Features of the Applications\n\n* Read and Open PST files without using Outlook\n* Gives you a proper view emails along with Attachments\n* Allows you to view contacts, journals, task, emails and other items.\n* Simple and easy to use program with extensive features to meet the user requirement\n* PST Viewer doesn't require Outlook to open .pst files\n* Support PST files generated from all version of Outlook\n\n###Free Outlook Viewer\nYou don't need to buy or purchase the tool, it is absolutely free program. You can easily download and install the software without investing a single penny. It is a free software to open PST file without Outlook\n\n###Preview Mails and Attachments\nThe exclusive feature of this PST Viewer software is that it provides an easy access to your all Outlook mail items. Even you can get a preview of attachments which are fixed with the mails in the same panel of the screen.\n\n###Operate Without Outlook\nThis tool is developed to explore PST files when Outlook is not installed. So you can make use of this software when you don't have Outlook installed or facing error while accessing PST file in MS Outlook\n\n###View all .pst Mail items\nAll in one PST Viewer tool which allows you to explore all items of .pst Outlook data files. You can view and read items such as contacts, task, journals, and other folders such as inbox, deleted items, sent items etc.\n\n###Open Password Protected PST\nThis tool is developed with powerful algorithms to provide user an accessibility to PST files which are password protected. This means that Outlook Viewer can readily open PST data files which are locked and ask for password to get access\n\n###Read corrupted PST files\nPST Opener is the efficient tool designed to view PST files which are corrupted or damaged. Rather than going for expensive tools to recover it, you can easily explore and read PST files using this free ware application which requires no amount to be paid.\n\n###Supports both ANSI and UNICODE PST\nUnicode format files are new PST files format generated by latest Outlook version such as 2013, 2010, 2007, 2003 whereas, ANSI format is used by previous version of Outlook. This PST reader supports both Unicode and ANSI PST file formats\n\n###Impose no limitation on file size\nIn Outlook Viewer, there is no restriction imposed on size of PST file. Large size PST file can also be explore without any error. So, don't worry if you have heavy size PST files this software performs well even with large size PST files.", "updated": "2024-03-22T07:03:33Z", "galleryUrl": "https://community.chocolatey.org/packages/free-pst-reader/4.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/free-pst-reader/4.1", "licenseUrl": "http://ost2pstware.com/eula.html", "packageName": "free-pst-reader", "displayName": "Free PST Reader (Install)", "summary": "A free tool to view PST files without using Outlook", "version": "4.1", "icon": "http://ost2pstware.com/img/logo.png", "author": "OST2PSTWARE", "downloadCount": 2662, "tags": ["ost2pstware", "ost", "pst", "reader", "outlook", "admin"]}