{"description": "FreeFileSync is a folder comparison and synchronization software that creates and manages backup copies of all your important files. Instead of copying every file every time, FreeFileSync determines the differences between a source and a target folder and transfers only the minimum amount of data needed. \n    \n### Package End-Of-Life\n**FreeFileSync is open source software, but the installer is not.  The author and distributor of FreeFileSync and the installation program has removed the permission to distribute newer versions of the installer and has taken steps to prevent automated download of the installer.  Because this package is embedded, this version (10.2) of FreeFileSync is still available, but unless the situation changes, there will not be any Chocolatey packages for newer versions of FreeFileSync.**\n\n##### Antivirus note\nThe installer for the public versions of FreeFileSync was built with the option to show an ad or offer additional software.  Some anti-virus/anti-malware programs flag the installer as potentially dangerous.  This package has been configured and tested to *not install additional software*.  [See a statement about malware/adware warnings on the FreeFileSync FAQ here.](https://www.freefilesync.org/faq.php#virus)  If the warnings are a concern, [consider donating to the creator of FreeFileSync](https://www.freefilesync.org/donate.php) for the ability to download an unburdened installer.", "updated": "2024-03-24T00:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/freefilesync/10.2.0.20180914", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/freefilesync/10.2.0.20180914", "licenseUrl": "https://github.com/teknowledgist/Chocolatey-packages/blob/master/discontinued/freefilesync/tools/LICENSE.txt", "packageName": "freefilesync", "displayName": "FreeFileSync (final package)", "summary": "Synchronize Files and Folders", "version": "10.2.0.20180914", "icon": "https://cdn.rawgit.com/teknowledgist/Chocolatey-packages/master/Icons/freefilesync_icon.png", "author": "Zenju", "downloadCount": 127285, "tags": ["freefilesync", "sync", "notsilent", "embedded"]}