{"description": "**This package installs the Latest Version of FreeCAD and may list a subversion determined by the version of the installer provided by FreeCAD. (Example: package version 0.19.4.2 uses installer number 2 for FreeCAD 0.19.4)**\n\nFreeCAD is a general purpose feature-based, parametric 3D modeler for CAD, MCAD, CAx, CAE and PLM, aimed directly at mechanical engineering and product design but also fits a wider range of uses in engineering, such as architecture or other engineering specialties. It is 100 % Open Source and extremely modular, allowing for very advanced extension and customization.\n\nFreeCAD is based on OpenCasCade, a powerful geometry kernel, features an Open Inventor-compliant 3D scene representation model provided by the Coin 3D library, and a broad Python API. The interface is built with Qt. FreeCAD runs exactly the same way on Windows, Mac OSX and Linux platforms.\n\n## Features\n\n- A full parametric model,and modular architecture that allows plugin extensions (modules) to add functionality to the core application.\n- Import/export to standard formats such as STEP, IGES, OBJ, STL, DXF, SVG, STL, DAE, IFC or OFF, NASTRAN, VRML in addition to FreeCAD's native FCStd file format.\n- A Robot simulation module that allows you to study robot movements in a graphical environment.\n- A technical drawing module with options for detail views, cross sectional views, dimensioning and others, allowing you to generate 2D views of existing 3D models.\n- A Rendering module that can export 3D objects for rendering with external renderers.\n- A Path module dedicated to mechanical machining for Computer Aided Manufacturing (CAM).\n\n## Package parameters\n\n### Used only for Portable or Pre Releases Currently\n\n- `/InstallDir` - This is the location inside the Chocolatey lib folder specific to this package.\n- `/Arguments` - This will allow you to specify any of the FreeCAD command line arguements.\n- `/NoShortcut` - This will not set a Shortcut on the Desktop.\n- `/WindowStyle` - The normal window setting for most Applications is as a Window. Maximised Window would be 3.\n\nExample: `choco install freecad --params \"/InstallDir:'C:\\FreeCAD' /NoShortcut\"`\n\n### Notes\n\n- **If you should get a *Code 2* error while installing FreeCAD. Installing over existing installations is *NOT RECOMMENDED*. It is better to reinstall FreeCAD.**\n\n- **If the package is out of date please check [Version History](#versionhistory) for the latest submitted version. If you have a question, please ask it in [Chocolatey Community Package Discussions](https://github.com/chocolatey-community/chocolatey-packages/discussions) or raise an issue on the [Chocolatey Community Packages Repository](https://github.com/chocolatey-community/chocolatey-packages/issues) if you have problems with the package. Disqus comments will generally not be responded to.**", "updated": "2024-03-21T23:18:24Z", "galleryUrl": "https://community.chocolatey.org/packages/freecad.portable/0.20.2.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/freecad.portable/0.20.2.1", "licenseUrl": "http://www.freecadweb.org/wiki/index.php?title=Licence", "packageName": "freecad.portable", "displayName": "FreeCAD (Portable)", "summary": "A parametric 3D CAD modeler", "version": "0.20.2.1", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@edba4a5849ff756e767cba86641bea97ff5721fe/icons/freecad.svg", "author": "Jürgen Riegel", "downloadCount": 1191, "tags": ["freecad", "3d", "cad", "modeling", "engineering", "admin"]}