{"description": "![Screenshot of Free OST Reader](http://ost2pstware.com/img/guide/v4.png)\n\t\n###Salient Features of the Software\n\n* An easy to use tool to View Outlook Offline mailbox data files* \n* Preview Option available for both Messages and Attachments\n* Displays all items such as task, journals, calendars etc., perfectly\n* Opens orphan .ost data files of Outlook\n* Reads both ANSI and UNICODE .ost data file format\n* Provides View of all types of OST file - Encrypted, Highly Encrypted, and Compressed\t\n\n###Free OST Viewer Tool\nIt is completely freeware, without paying a single buck you can use the tool to view and read Outlook offline mailbox data files. You don't need to waste money on expensive software just simply download for free and access your OST files.\n\n###Display Proper Information\nAdvantage of using OST Viewer is it help you to read all important informations related to your files in a proper way. Every minute detail is showed to you without creating any complexity to understand the data. It is a completely full featured program.\n\n###Easily runs without Outlook\nThe special feature of this OST Viewer program is that you can get access to your OST file at the situations when you don't have Outlook installed on your system. Also, OST Reader made browsing of Outlook offline data files possible even when exchange server is down.\n\n###Retain Folder structure\nYou will not face any difficulty using this OST Viewer utility. It will give you view of Outlook offline Mailbox data files as same as in Outlook. You will see same folder and sub folder structure, even the message formatting is not affected. All read and unread message status is maintained.\n\n###Preview Option - Dual\nYou can easily get preview of any messages or attachments in the same screen in a proper manner. There are two sections: One displays all items of selected folder the other shows you preview. It contains two tabs one to preview selected message other shows its attachment\n\n###Supported by Windows\nIt is windows based software. You can download it on any version of Windows Operating System. It runs perfectly on Windows 10, Windows 8.1 Windows 7, Windows XP, Windows Vista and all previous version\n\n###Simple GUI\nIts graphical user interface is created very simple. Any kind of computer user can use the tool comfortably without requiring any assistance to run the free OST viewer. To open OST file without Outlook you just need to click on Add file and browse OST file, software will load all data of selected OST file\n\n###Opens Orphan OST\nIt is a special program developed to open and read OST files without Outlook. There are many situations when you can't access OST files such as at down time of Exchange Server, or MS Outlook not installed or when OST becomes orphan. In such cases you can easily open and explore OST files using OST Viewer", "updated": "2024-03-23T12:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/free-ost-reader/4.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/free-ost-reader/4.1", "licenseUrl": "http://ost2pstware.com/eula.html", "packageName": "free-ost-reader", "displayName": "Free OST Reader (Install)", "summary": "A free tool to explore OST files without Outlook", "version": "4.1", "icon": "http://ost2pstware.com/img/logo.png", "author": "OST2PSTWARE", "downloadCount": 1271, "tags": ["ost2pstware", "ost", "pst", "reader", "outlook", "exchange", "admin"]}