{"description": "Fsum offers a choice of 13 of the most popular hash and checksum functions for file message digest and checksum calculation.\n\nThe most common use for FSUM is checking data files for corruption. A message digest or checksum calculation might be performed on data before transferring it from one location to another. Making the same calculation after the transfer and comparing the before and after results, you can determine if the received data is corrupted or not. If the results match, then the received data is likely accurate.\n\n### Features\n* Possibility to calculate a file message digest and/or  a checksum using any of the 12 well-known and documented hash and checksum algorithms: **MD2, MD4, MD5, SHA-1, SHA-2( 256, 384, 512), RIPEMD-160, PANAMA, TIGER,  ADLER32, CRC32**\n* Possibility to act recursively. FSUM can operate not only on files from a specific directory, but also on files from all subdirectories of the specified directory\n* Work with large size files. (Tested on file sizes of up to 15 GB)\n* Full compatibility with md5sum utility\n* Full .MD5 and .SFV file formats support\n* Automatic recognition of checksum file format (.MD5 or .SFV) while checking\n* Generates/verifies hashes/checksums for files of any type: music, audio, sound, video, image, icon, text, compression, etc., with the extensions: .mp3, .wav, .avi, .mpg, .midi, .mov, .dvd, .ram, .zip, .rar, .ico, .gif, .pif, .pic, .tif, .tiff, .txt, .doc, .pdf, .wps, .dat, .dll, .hex, .bin, .iso, .cpp, .dss, .par, .pps, .cue, .ram, .md5, .sfv, etc.\n\nImplemented using commercial library SlavaSoft QuickHash.\n\n### Previous Versions\nUnfortunately, only the latest version of fsum may be installed; attempting to install any previous version will result in the most recently released version being installed.  This issue is unique to this package.", "updated": "2024-03-11T00:48:25Z", "galleryUrl": "https://community.chocolatey.org/packages/fsum/2.52", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/fsum/2.52", "licenseUrl": "http://www.slavasoft.com/fsum/license-agreement.htm", "packageName": "fsum", "displayName": "fsum", "summary": "Fast and handy freeware command line utility for file integrity verification", "version": "2.52", "icon": "", "author": "SlavaSoft Inc", "downloadCount": 1487, "tags": ["commandline", "file", "checksum"]}