{"description": "![FxSound Screenshot](https://cdn.statically.io/gh/asheroto/ChocolateyPackages/705c627cf92c5be9646fe4b1a3c2c06ca28f39bc/fxsound/screenshot.png)\n\n## Summary\n\nFxSound is a cutting-edge audio enhancement software that elevates your listening experience across all media. Whether it's music, video games, TV shows, or movies, FxSound enriches the audio quality to deliver an immersive experience. With a range of customization options and presets, it's the ultimate tool for audio perfection on any hardware.\n\n## Features\n- **Music:** FxSound corrects the limitations inherent in your devices and compressed audio, offering a richer musical experience.\n- **Video Games:** Experience surround sound that fully immerses you into your virtual worlds, making your gaming sessions more engaging.\n- **TV and Movies:** Elevate your viewing experience with smoother and enhanced audio quality for your favorite shows and films.\n- **Transcription:** Boost your audio clarity to make transcription tasks easier and more efficient. Rewind less and accomplish more.\n- **Customization:** Tailor your audio settings to your exact preferences with features like a 9-band EQ with customizable center frequencies, visualizers, and effects.\n- **Presets:** Choose from professionally designed presets suitable for various activities such as music, gaming, movies, and transcription.  \n- **Affordability:** Achieve audiophile-level sound without breaking the bank, thanks to FxSound's expert-designed processing engine that's been 20 years in the making.", "updated": "2024-03-23T21:33:37Z", "galleryUrl": "https://community.chocolatey.org/packages/fxsound/1.1.22", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/fxsound/1.1.22", "licenseUrl": "https://forum.fxsound.com/tos", "packageName": "fxsound", "displayName": "FxSound", "summary": "Boost volume, bass and sound quality on windows", "version": "1.1.22", "icon": "https://cdn.statically.io/gh/asheroto/ChocolateyPackages/093acc183da465f30e835201c287cadb2d6da703/fxsound/icon.png", "author": "FxSound LLC", "downloadCount": 1402, "tags": ["fxsound", "fx", "sound", "volume", "boost", "booster", "bass", "audio", "equalizer", "adjust", "adjustment", "quality"]}