{"description": "Gajim aims to be an easy to use and fully-featured XMPP client. It is open source and released under the GNU General Public License (GPL). \n\nFEATURES:\nNever miss a message, keep all your chat clients synchronized\nInvite friends to group chats or join one\nSimply send pictures, videos or other files to friends and groups\nChat securely with End-to-End encryption via OMEMO or PGP.\nUse your favorite emoticons, set your own avatar\nKeep and manage all your chat history\nOrganize your chats with tabs\nAutomatic spell-checking for your messages\nConnect to other Messengers via Transports (Facebook, IRC, ...)\nLookup things on Wikipedia, dictionaries or other search engines directly from the chat window\nWhat are you doing just now? Which music are you listing to this moment? How are you feeling lately? If you like, show your friends by setting your activity, tune, and mood\nEven more features via plugins, for example: Image Previews, Location Previews, Anti Spam, ...\n\nADVANCED FEATURES:\nSupport for multiple accounts\nOne of your friends has accounts everywhere but you just want one contact you can easily write to? Group multiple contacts to one Meta-Contact\nXML console to see what's happening on the protocol layer\nServerless messaging (Bonjour/Zeroconf), BOSH\nSupport for Service discovery including nodes and search for users\nDBus capabilities\n\nLANGUAGES:\nGajim is available in 29 languages: Basque, Belarusian, Brasilian, British, Bulgarian, Chinese (simplified), Croatian, Czech, Danish, English, Esperanto, French, Galician, German, Hebrew, Hungarian, Italian, Japanese, Kazakh, Lithuanian, Norwegian (Bokmål), Polish, Russian, Serbian, Slovak, Spanish, Swedish, Turkish, and Ukrainian", "updated": "2024-03-23T22:18:48Z", "galleryUrl": "https://community.chocolatey.org/packages/gajim/1.8.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gajim/1.8.4", "licenseUrl": "https://www.gnu.org/licenses/gpl-3.0.html", "packageName": "gajim", "displayName": "gajim (Install)", "summary": ">Full featured and easy to use Jabber/XMPP client", "version": "1.8.4", "icon": "https://gajim.org/img/gajim-logo.png", "author": "Denis Fomin, Yann Leboulanger", "downloadCount": 27907, "tags": ["gajim", "XMPP", "messenger", "OMEMO", "PGP", "OpenPGP"]}