{"description": "Game Backup Monitor is a simple, but flexible application that detects games as you play them. Once you finish playing a game, a backup of the saved games will be made automatically using 7-Zip compression. GBM can be used on a single computer, or on multiple computers to effectively add cloud support to any game or application.\n\nGame Backup Monitor was designed with gaming in mind, but it can be used to monitor any application on your PC!\n\nGame Backup Monitor is completely free and open source software.\n\n## Features\n\n- Backup your saves automatically and immediately after playing a game. No scheduling or input required!\n- Backup to a cloud folder and add cloud save support to any game.\n- GBM can detect and backup saves from games running on emulators or interpreters such as DOSBox, ScummVM or Wine.\n- A growing list of pre-configured games for Windows and Linux.\n- Easily setup an unlimited number of games to monitor, each with their own specific settings.\n- Game configurations are designed to be easily portable and shared.\n- GBM can automatically launch other software when a monitored game is detected, such as overlays or custom control schemes.\n- Track the hours that you've played any monitored game, similar to Steam. (Optional)\n- Track individual gaming sessions, know exactly when and how much you've played any monitored game. (Optional)\n\n## Notes\n\n- Game Backup Monitor is currently only available in English.", "updated": "2024-03-23T06:33:32Z", "galleryUrl": "https://community.chocolatey.org/packages/gbm/1.3.8", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gbm/1.3.8", "licenseUrl": "https://github.com/MikeMaximus/gbm/blob/master/LICENSE", "packageName": "gbm", "displayName": "Game Backup Monitor", "summary": "Automatically backup your saved games with optional cloud support.", "version": "1.3.8", "icon": "https://cdn.jsdelivr.net/gh/AdmiringWorm/chocolatey-packages@a22c15bb78813121e46588781213a42634288d4c/automatic/gbm/icons/gbm.png", "author": "Michael J. Seiferling", "downloadCount": 5173, "tags": ["game-backup-monitor", "gbm", "games", "backup", "monitor", "foss", "cross-platform"]}