{"description": "## Create Real ROM files\nRun your games on any compatible emulator, if you've got a flash cart you can play them on a real console!\n\n## Simple Setup\nNo complicated dependencies to install, just a single application with everything you need to get started.\n\n## No knowledge required\nSimple visual scripting means you don't need to have made a game already. GB Studio also hides much of the complexity in building GB games so you can concentrate on telling a great story.\n\n## Build for the web\nGB Studio comes with a web based emulator that even works great on mobile. You can quickly export your games to play in a browser or even upload to Itch.io.\n\n## Features\n- Visual game builder with no programming knowledge required.\n- Design your graphics in any editor that can output PNG files e.g. Photoshop, Tiled, Aseprite.\n- Example project included to get started right away.\n- Make top down 2D JRPG style adventure games.\n- Build real GB Rom files which can be played in an emulator or on device using USB Carts.\n- Build a HTML5 playable game that also works on mobile and can deployed to any webserver or uploaded to Itch.io.\n- Built for macOS, Windows and Linux.\n- Supports both macOS light and dark mode.\n- Includes the full tools that were used to build [Untitled GB Game](https://chrismaltby.itch.io/untitled-gb-game), free to play on Itch.io.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/gbstudio/screenshot.png)", "updated": "2024-03-22T00:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/gbstudio/3.2.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gbstudio/3.2.1", "licenseUrl": "https://raw.githubusercontent.com/chrismaltby/gb-studio/develop/LICENSE", "packageName": "gbstudio", "displayName": "GB Studio", "summary": "A free and easy to use retro adventure game creator for your favourite handheld video game system.", "version": "3.2.1", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/gbstudio/gbstudio.png", "author": "Chris Maltby", "downloadCount": 806, "tags": ["gbstudio", "retro", "adventure", "game", "creator"]}