{"description": "## get_iplayer: BBC iPlayer/BBC Sounds Indexing Tool and PVR\n\n## Features\n\n* Downloads TV and radio programmes from BBC iPlayer/BBC Sounds\n* Allows multiple programmes to be downloaded using a single command\n* Indexing of most available iPlayer/Sounds catch-up programmes from previous 30 days (not Red Button, iPlayer Exclusive, or Podcast-only)\n* Caching of programme index with automatic updating\n* Regex search on programme name\n* Regex search on programme description and episode title\n* Filter search results by channel\n* Direct download via programme ID or URL\n* PVR capability (may be used with cron or Task Scheduler)\n* HTTP proxy support\n* Perl 5.16+ required, plus LWP, LWP::Protocol::https, XML::LibXML, Mojolicious, and CGI modules\n* Requires ffmpeg for conversion to MP4 and AtomicParsley for metadata tagging\n* Runs on Linux/BSD (Ubuntu, Fedora, OpenBSD and others), macOS (10.10+), Windows (7/8/10)\n\n**NOTE:**\n\n- **get_iplayer can only search for programmes that were scheduled for broadcast on BBC linear services within the previous 30 days, even if some are available for more than 30 days on the iPlayer/Sounds sites. Red button programmes, iPlayer box sets, web-only content, and BBC podcasts are not searchable. Programmes that are still available after 30 days must be located on the iPlayer/Sounds sites and downloaded directly via PID or URL.**\n- **get_iplayer does not support downloading news/sport videos, other embedded media, archive programmes, special collections, educational material, programme clips or any content other than whole episodes of programmes scheduled for broadcast on BBC linear services within the previous 30 days. However, it is generally possible to download other content such as red button programmes, iPlayer box sets, or podcasts directly via PID or URL. get_iplayer DOES NOT support live recording from BBC channels.**", "updated": "2024-03-22T22:48:27Z", "galleryUrl": "https://community.chocolatey.org/packages/getiplayer/3.35.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/getiplayer/3.35.0", "licenseUrl": "https://github.com/get-iplayer/get_iplayer/blob/master/LICENSE.txt", "packageName": "getiplayer", "displayName": "getiplayer (Install)", "summary": "A utility for downloading TV and radio from BBC iPlayer.", "version": "3.35.0", "icon": "https://avatars0.githubusercontent.com/u/9755374", "author": "A. S. Budden,  Alexey Tourbin,  Andrew Elwell,  Andy Bircumshaw,  Bill Boughton,  Caius Durling,  Chris Reed,  BBR,  Crispin Flowerday,  David Llewellyn-Jones,  David Woodhouse,  Edward Betts,  HenderHobbit,  Ian Praxil,  James,  James Laver,  James Ross,  James Teh,  John Henderson,  John Veness,  Jon Davies,  Jonathan Harris,  Jonathan Larmour,  Jonathan Wiltshire,  Matthew Boyle,  Mike Crowe,  Mike Fleetwood,  Murray,  Peter Oliver,  Phil Cole,  Ralf Baechle,  Sharon Kimble,  Shevek,  Steven Luo,  Stuart Henderson,  Vangelis forthnet,  Vangelis66,  Will Elwood,  dinkypumpkin,  fs ck,  fsck,  hintswen,  linuxcentrenet,  notnac,  wiehe,  willemw12", "downloadCount": 12930, "tags": ["iplayer", "admin", "bbc", "tv", "radio", "media", "video", "audio", "podcast"]}