{"description": "Highlights:\n            • GHC supports the entire Haskell 2010 language plus a wide variety of extensions.\n            • GHC has particularly good support for concurrency and parallelism, including support for Software Transactional Memory (STM).\n            • GHC generates fast code, particularly for concurrent programs. Take a look at GHC's performance on The Computer Language Benchmarks Game.\n            • GHC works on several platforms including Windows, Mac, Linux, most varieties of Unix, and several different processor architectures. There are detailed instructions for porting GHC to a new platform.\n            • GHC has extensive optimisation capabilities, including inter-module optimisation.\n            • GHC compiles Haskell code either directly to native code or using LLVM as a back-end. GHC can also generate C code as an intermediate target for porting to new platforms. The interactive environment compiles Haskell to bytecode, and supports execution of mixed bytecode/compiled programs.\n            • Profiling is supported, both by time/allocation and various kinds of heap profiling.\n            • GHC comes with several libraries, and thousands more are available on Hackage.\n\n            There's an important change to path handling for Windows starting with 8.6.1.\n            These changes mean that Haskell programs are no longer constraint to `MAX_PATH`.  So passing a long path to `openFile` will just work.\n            There are a few caveats to this such as you can't access `COM` devices via `COM1` etc anymore and instead need to use the full path `\\\\.\\COM1` etc.\n            This is all documented https://downloads.haskell.org/~ghc/8.8.4/docs/html/users_guide/win32-dlls.html#windows-file-paths\n\n            *32-bit Windows is no longer supported and installing this package on 32-bit Windows will install GHC 8.6.5.*\n\n            GHC 9.0 contains a new I/O manager for Windows as a technical preview. See changelog for more information.\n\n### Package Specific\n### changes\n\n * Adds support for Azure Pipelines.\n\n#### Package Parameters\nThe following package parameters can be set:\n\n * `/installdir:` - The location to install package to.  Note that installing to a directory with spaces will likely lead to difficulties.\n * `/globalinstall:` - Indicates whether package should be installed for current user or all users.\n * `/integer-simple:` - Indicates to use the GHC bignum package instead of the GMP one, for compatibility reasons the flag is kept the same.\n * `/no-workarounds:` - Don't apply any package specific workarounds that may be needed to make the compiler work.\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install packageID [other options] --params=\"'/ITEM:value /ITEM2:value2 /FLAG_BOOLEAN'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/ghc/9.8.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ghc/9.8.1", "licenseUrl": "https://www.haskell.org/ghc/license", "packageName": "ghc", "displayName": "GHC", "summary": "GHC is a state-of-the-art, open source, compiler and interactive environment for the functional language Haskell.", "version": "9.8.1", "icon": "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Haskell-Logo.svg/2000px-Haskell-Logo.svg.png", "author": "GHC Team", "downloadCount": 704288, "tags": ["ghc", "haskell"]}