{"description": "**GhostDoc** is a Visual Studio extension that automatically generates XML documentation comments for methods and properties based on their type, parameters, name, and other contextual information.\n\nWhen generating documentation for class derived from a base class or for interface implementation (e.g. .NET Framework or your custom framework), GhostDoc will use the documentation that Microsoft or the framework vendor has already written for the base class or interface.\n\n## Benefits\n\n- Save keystrokes and time; simplify documenting your code\n- Automatically generate a starting point for your help documentation\n- Benefit of the base class documentation\n- StyleCop compliant documentation templates\n- (Pro) Documentation quality and maintenance\n- (Pro) Code Spell Checker\n- (Pro) Build Help File\n- (Pro) Take control of your help files with Help Configurations and Template Libraries\n- See [this page](http://submain.com/ghostdoc/editions/) for the full comparison between editions.\n\nIf you follow good naming conventions in your code, then you will get very decent results on the summary GhostDoc generates. When I see code that is not documented, it is as simple as hit Ctrl-Shift-D to have GhostDoc document it.\n\n## Notes\n\n- Uninstall is not completely silent, after uninstall a browser window pops up", "updated": "2024-03-21T23:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/ghostdoc-enterprise/2022.2.22190", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ghostdoc-enterprise/2022.2.22190", "licenseUrl": "http://submain.com/ghostdoc/EULA.aspx", "packageName": "ghostdoc-enterprise", "displayName": "GhostDoc Enterprise Edition", "summary": "GhostDoc is a Visual Studio extension that automatically generates XML documentation comments for methods and properties based on their type, parameters, name, and other contextual information.", "version": "2022.2.22190", "icon": "https://cdn.jsdelivr.net/gh/AdmiringWorm/chocolatey-packages@011752c0bd870e56ecac19ecc925994c93233dd4/automatic/ghostdoc-enterprise/icons/32x32.png", "author": "submain", "downloadCount": 5786, "tags": ["ghostdoc-enterprise", "ghostdoc", "admin", "notsilent", "trial", "documentation", "extension"]}