{"description": "Ghostscript is an interpreter for PostScript™ and Portable Document Format (PDF) files. Ghostscript consists of a PostScript interpreter layer, and a graphics library.\n\n## Features\n* An interpreter for the PostScript language, with the ability to convert PostScript language files to many raster formats, view them on displays, and print them on printers that don't have PostScript language capability built in\n* An interpreter for Portable Document Format (PDF) files with the same abilities\n* The ability to convert PostScript language files to PDF (with some limitations) and vice versa\n* A set of C procedures (the Ghostscript library) that implement the graphics and filtering (data compression / decompression / conversion) capabilities that appear as primitive operations in the PostScript language and in PDF\n\n## Notes\n\n- **If the package is out of date please check [Version History](#versionhistory) for the latest submitted version. If you have a question, please ask it in [Chocolatey Community Package Discussions](https://github.com/chocolatey-community/chocolatey-packages/discussions) or raise an issue on the [Chocolatey Community Packages Repository](https://github.com/chocolatey-community/chocolatey-packages/issues) if you have problems with the package. Disqus comments will generally not be responded to.**", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/Ghostscript/10.3.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Ghostscript/10.3.0", "licenseUrl": "http://www.gnu.org/licenses/agpl-3.0.html", "packageName": "Ghostscript", "displayName": "Ghostscript", "summary": "an interpreter for the PostScript language and for PDF.", "version": "10.3.0", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@edba4a5849ff756e767cba86641bea97ff5721fe/icons/ghostscript.svg", "author": "Artifex", "downloadCount": 1492706, "tags": ["ghostscript.app", "ghostscript", "postscript", "admin", "foss", "cross-platform"]}