{"description": "Open source tools for your mobile phone\n\ngnokii provides tools and a user space driver for use with mobile phones under various operating systems (most testing is done under Linux but also Solaris, *BSD family and MS Windows families are known to work). If you wonder whether your phone is supported or not, it is safe to assume it is supported, at least when the phone is fairly modern. However there are rare cases that make phone support very limited. You may refer to our wiki pages for hints in the gnokii configuration.\n\ngnokii features\ngnokii allows you to communicate with the phone over the serial cable connection, usb connection (support depends mostly on the operating system level support), infrared connection and bluetooth connection.\n\ngnokii provides many functionality of different areas for user to manipulate mobile phone.\n\nSMS\nYou can send SMS, receive them and save them in the phone. gnokii supports delivery reports, picture messages (Nokia own protocol), concatenated messages, wap pushes, unicode messsages. gnokii allows you to send and receive logos and ringtones over SMS.\n\nPhonebook\ngnokii offers you possibility to read and write phonebook. Phonebook entries can be displayed in human readable form or can be exported to comma separated output, vCard version 3.0 format or ldif format. You can import data from the same formats. Please note, that supported phonebook entries\tdepend on the phone features and therefore may not be all imported.\n\nCalendar\ngnokii supports either calendar or todo lists. gnokii is capable to export calendar to iCal files and import them from the same format. Most calendar features like different types of events, recurrence, start and end times are supported.\n\nCall management\nYou can initiate and answer calls with gnokii.\n\nOther\nAmong other gnokii capabilities you'll find security options like entering PIN, ringtone and logo handling and many many other.", "updated": "2024-03-22T17:18:26Z", "galleryUrl": "https://community.chocolatey.org/packages/gnokii/0.6.31", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gnokii/0.6.31", "licenseUrl": "https://git.savannah.nongnu.org/cgit/gnokii.git/tree/COPYING", "packageName": "gnokii", "displayName": "Gnokii (Install)", "summary": "Open source tools for your mobile phone", "version": "0.6.31", "icon": "https://gnokii.org/graphics/logo.jpg", "author": "gnokii project", "downloadCount": 771, "tags": ["admin", "sim", "sms", "vcard", "at", "gnokii", "cellphone", "cell-phone", "mobile", "mobile-phone"]}