{"description": "## This package has been renamed to [**gnupg**](/packages/gnupg).\n\n#### This is the modern version of GnuPG (2.2 branch). If you want the stable version (2.0 branch) install [Gpg4win](https://chocolatey.org/packages/Gpg4win).\n\nGnuPG itself is a commandline tool without any graphical stuff. It is the real crypto engine which can be used directly from a command prompt, from shell scripts or by other programs. Therefore it can be considered as a backend for other applications.\n\nHowever, even when used on the command line it provides all functionality needed - this includes an interactive menu system. The set of commands of this tool will always be a superset of those provided by any frontends.\n\n    Full replacement of PGP.\n    Does not use any patented algorithms.\n    GPLed, written from scratch.\n    Can be used as a filter program.\n    Full OpenPGP implementation (see RFC4880 at RFC Editor).\n    Better functionality than PGP and some security enhancements over PGP 2.\n    Decrypts and verifies PGP 5, 6 and 7 messages.\n    Supports ElGamal, DSA, RSA, AES, 3DES, Blowfish, Twofish, CAST5, MD5, SHA-1, RIPE-MD-160 and TIGER.\n    Easy implementation of new algorithms using extension modules.\n    The User ID is forced to be in a standard format.\n    Supports key and signature expiration dates.\n    English, Danish, Dutch, Esperanto, Estonian, French, German, Japanese, Italian, Polish, Portuguese (Brazilian), Portuguese (Portuguese), Russian, Spanish, Swedish and Turkish language support.\n    Online help system.\n    Optional anonymous message receivers.\n    Integrated support for HKP keyservers (wwwkeys.pgp.net).\n    Clears signed patch files which can still be processed by patch.\n    and many more things….", "updated": "2024-03-23T12:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/gnupg-modern/2.2.17", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gnupg-modern/2.2.17", "licenseUrl": "https://creativecommons.org/licenses/by-sa/3.0/", "packageName": "gnupg-modern", "displayName": "[Deprecated] GnuPG modern (Install)", "summary": "GnuPG is a complete and free implementation of the OpenPGP standard as defined by RFC4880 (also known as PGP)", "version": "2.2.17", "icon": "", "author": "Werner Koch,  The GnuPG Project", "downloadCount": 10630, "tags": ["admin", "aes", "cli", "cross-platform", "encrypt", "foss", "gnupg", "gnupg-modern", "openpgp", "pgp", "rfc4880", "rsa", "security", "signature"]}