{"description": "A famous scientific plotting package, features include 2D and 3D plotting, a huge number of output formats, interactive input or script-driven options, and a large set of scripted examples.\nIt can be used interactively to plot functions and data points in both two- and three-dimensional plots in many different styles and many different output formats. Gnuplot can also be used as a scripting language to automate generation of plots. It is designed primarily for the visual display of scientific data. gnuplot is copyrighted, but freely distributable; you don’t have to pay for it.\n\n## Features\n- Two-dimensional functions and data plots combining many different elements such as points, lines, error bars, filled shapes, labels, arrows, ...\n- Polar axes, log-scaled axes, general nonlinear axis mapping, parametric coordinates\n- Data representations such as heat maps, beeswarm plots, violin plots, histograms, ...\n- Three-dimensional plots of data points, lines, and surfaces in many different styles (contour plot, mesh)\n- Algebraic computation using integer, floating point, or complex arithmetic\n- Data-driven model fitting using Marquardt-Levenberg minimization\n- Support for a large number of operating systems, graphics file formats and output devices\n- Extensive on-line help\n- TEX-like text formatting for labels, titles, axes, data points\n- Interactive command line editing and history", "updated": "2024-03-23T01:48:25Z", "galleryUrl": "https://community.chocolatey.org/packages/gnuplot/5.4.8", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gnuplot/5.4.8", "licenseUrl": "https://sourceforge.net/p/gnuplot/gnuplot-main/ci/master/tree/Copyright?format=raw", "packageName": "gnuplot", "displayName": "Gnuplot", "summary": "A portable, multi-platform, command-line driven graphing utility.", "version": "5.4.8", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/gnuplot/gnuplot.png", "author": "Thomas Williams,  Colin Kelley", "downloadCount": 40499, "tags": ["gnuplot", "plot"]}