{"description": "GOM Player is one of the world's best free desktop video players. Originally famous for its high video and audio quality, and support of multiple video formats (flv, mp4, mov, mpg, ts, avi, divx, asx, wmv, m4v, dat, ifo, vob, 3gp/3gp2, rm/rmvb, mkv, ogm) etc. However, there is a lot more to GOM Player than codec support.\n\nIf you are interested in VR and 360 degree videos, GOM Player is just for you! GOM Player supports a variety of VR and 360° video formats, and provides each user with friendly and simple UI/UX experiences.\n\nIt can read your local 360° video files and play/stream 360° YouTube videos. For more advanced users, GomPlayer allows custom configuration, enhancing the video view experience. There are now thousands of amazing 360° VR videos out there you can watch.\n\nIf you are looking for subtitles, GOM Player just made that amazingly simple. GOM Player users are able to access the largest subtitle database in the World. And all you have to do it just play the video. Once you play your video, GOM Player will automatically search its database and show you the matching subtitle results. After you choose the subtitle you want to run, just click apply and the subtitle will be automatically downloaded and applied.\n\n## Features\n- **Comprehensive File Support:** GOM Player can play all the most popular video formats by default: AVI, MP4, MKV, FLV, WMV, MOV, and more!\n- **Strong Subtitle Functionality:** You can share and download a large number of subtitles through our own library and also by linking with OpenSubtitles.org. You can freely adjust the placement, size, and sync settings of your subtitles.\n- **Play 360 degrees VR video**\n- Able to watch from up, down, left, and right, 360 degrees around, by just using the keyboard or mouse\n- Supports preview with side views from front, back, left, and right as well as screen transition\n- Provides search and play functions for 360 YouTube videos\n- **Advanced Features:** With a wide variety of advanced features, like A-B repeat, screen capture, Media Player capture, playback speed control, and video effects, GOM Player allows you do much more than simply play your videos\n- **Customization:** GOM Player's skinable interface and advanced filter controls make it highly customizable, allowing users to personalize their experience to fit their needs. Download new skins and logos from the GOM Player website!\n- **Codec Finder:** Some uncommon video types aren't supported by GOM Player by default. When you try to watch these videos, GOM Player's Codec Finder service will search for the one you're missing and direct you to a place where you can read more and/or download the missing codec.\n- **Connect with GOM Remote:** You can control GOM Player with GOM Remote. This includes all basic functions, such as moving forward/back, play, and pause. This also includes advanced functions, such as opening files, searching, and PC power control.\n\n![](https://github.com/chocolatey-community/chocolatey-coreteampackages/blob/634d8a9910f0a9b6f730870c085f372b97be2e5f/automatic/gom-player/screenshot.jpg)", "updated": "2024-03-23T11:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/gom-player/2.3.90", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gom-player/2.3.90", "licenseUrl": "https://www.gomlab.com/terms/", "packageName": "gom-player", "displayName": "GOM Player (Install)", "summary": "The only media player you need - for FREE!", "version": "2.3.90", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@af726b9663646bcef6e18d9e7b2d84e03e4aa878/icons/gom-player.png", "author": "Gretech Corp", "downloadCount": 25354, "tags": ["gom-player", "audio", "subtitle", "video", "admin"]}