{"description": "![Screenshot of Google Voice for Chrome](https://lh4.googleusercontent.com/wBczU03AlxASeXKyucThUboVdWLUrWXv1ckaQsoXDp-0In-05YYy4mTQs_-EQnqzoKLFwZ6qug=s640-h400-e365-rw)\t\n\t\n###Make calls, send SMS, preview Inbox, and get notified of new messages. (US only)\nNew:\n* Bug fixes.\n\nExtension Features:\n* Adds a button to the toolbar, which displays the number of unread messages in your Google Voice inbox.\n* Audible alert on new messages (can turn off in extension options).\n* Gives you quick access to your most recent messages with transcripts and voicemail playback.\n* Lets you initiate calls and send free text messages by just typing any number or contact name.\n* Makes phone numbers on websites callable via Google Voice by just clicking on them.\n* If a phone number doesn't turn into a link on any website (ex: Google Calendar), you can select the text with your mouse and the click to call popup will automatically display (note: might not work with all numbers).\n\nInfo:\n* If you don't like the extension turning numbers into click to call links then you can turn it off in the extension options.\n* SMS is only available for accounts with a Google Number. SMS is not available in voicemail only accounts.\n\nKnown issues:\n* Incompatible with the Skype extension. If the Skype extension is installed then the Voice extension will not turn numbers into call links.\n* Sometimes your forwarding phone list will be empty. If this happens make sure you are logged in to http://www.google.com/voice and then wait ~30 minutes. The problem should fix itselft automatically within 30 minutes and work from then on.\n\nWarning explained:\nWhen installing the extension it says \"This extension will have access to all browsing history and private data on all websites\" This is the default warning for any extension that needs content script access to all websites. This access is needed for detecting phone \t\n\n\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-21T22:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/google-voice-chrome/2.4.4.20170115", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/google-voice-chrome/2.4.4.20170115", "licenseUrl": "", "packageName": "google-voice-chrome", "displayName": "Google Voice (by Google) for Chrome", "summary": "Google Voice Chrome extension", "version": "2.4.4.20170115", "icon": "https://lh5.googleusercontent.com/_pgrttDIsxp32wu5xeBCPRUuDs-jH6kOYThblRrOPGAlxRVgAP6Pb6ds_tzt0CVyeCXNfTQb--M=s26-h26-e365-rw", "author": "Google", "downloadCount": 1546, "tags": ["google", "voice", "chrome", "extension"]}