{"description": "![Screenshot of Grub2Win] (https://a.fsdn.com/con/app/proj/grub2win/screenshots/Install%201J.jpg)\n\n** All Executables are SSL Signed for your protection **\n\nGrub2Win supports 64 and 32 bit EFI and BIOS on Windows 10, 8, 7 and XP.\n\nSafely dual boot Windows and Linux from GPT or MBR disks.\n\nGrub2Win boots native GNU Grub version 2 code. Everything is contained in a single 18 MB directory on your Windows C: drive. On EFI systems 4 small modules are installed to your EFI partition.\n\nUsing the simple Windows GUI and instructions you can install Grub2Win quickly and safely. \n\nSelect from many OS choices. Samples for Remix, Android, Ubuntu, Debian, Suse, Fedora, Mint and Windows are included. ISO files can also be booted.\n\nYou can enter your own custom commands for each menu entry.\n\nGrub2Win began in 2010. It is now used in 180 countries worldwide and has been downloaded more than 350,000 times.\n\nIf you find Grub2Win useful, please consider making a small donation to be used for hardware and testing\n\n###Features\n* Supports 64 and 32 bit EFI as well as BIOS firmware.\n* Installs to Windows 10, 8, 7 and XP.\n* Requires just one directory on the Windows C: drive, about 18 MB disk space.\n* Works with all languages. Boot time help is available in 31 languages.\n* Simple Windows GUI easily sets up Grub2Win in seconds\n* Lets you set your EFI firmware boot order from within Windows\n* Preview and customize the 9 included graphic background themes.\n* Works with all filesystems including Mac hfs and Btrfs.\n* Can search for and boot a partition by it's label. Supports advanced scripting\n* Works with both MBR and GPT disks - up to 128 primary partitions per drive\n* Supports extremely large (over 40 TB) disks and partitions\n* No registry changes\n* Safely multiboot Windows, Remix, Android, Ubuntu, Debian, Suse, Fedora, Mint and more\n* Grub customization is done from Windows - Configuration in Linux is not required\n* Runs open source GNU Grub 2.02 code. Frequent releases and enhancements\n* Digitally signed code. No adware or spyware - No hassles... It just works.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/grub2win/readme.md)**\n\n***\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n***", "updated": "2024-03-23T16:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/grub2win/1.0.5.8", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/grub2win/1.0.5.8", "licenseUrl": "http://www.gnu.org/licenses/gpl.txt", "packageName": "grub2win", "displayName": "Grub2Win (Install)", "summary": "Grub2Win allows you to safely dual boot Windows and Linux.", "version": "1.0.5.8", "icon": "https://raw.githubusercontent.com/bcurran3/ChocolateyPackages/master/grub2win/grub2win_icon.png", "author": "Dave Pickens", "downloadCount": 3676, "tags": ["grub2win", "grub", "boot", "notsilent", "admin"]}