{"description": "## Finds you the perfect subtitle match.\nMeet gSubs. A desktop app that finds you the perfect subtitle match for your videos. Simply install now and drag and drop videos to get started.\n\n**No more hassle finding matching subtitles. gSubs does the job for you.**\n\n## Features\n### Drag & Drop\nJust drag and drop the video files that you want to search subtitle for and gSubs will do it's job. No more browsing and selecting videos from the mysteries directories that you don't know.\n### Multiple Files\ngSubs supports multiple files input, meaning you can drag and drop as many files as you want and gSubs will find subtitles for each and every file. You have an entire season with dozen of episodes? gSubs gets your subtitles for the entire season in one time.\n### Search Subtitles\nYou don't have a video file but just want to donwload your favourite movies or series subtitles? Don't worry, gSubs consists of the search function where you can input any queries for search. gSubs will give you the results according to the language that has been set.\n### 10 Languages\ngSubs are capable of finding you subtitles for 10 languages which are English, Español, Français, Italiano, Nederlands, Polski, Português, Român, Svenska and Türkçe. Many more languages will be added soon.\n### Auto Update\n### Open Source\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/gsubs/screenshot.png)", "updated": "2024-03-23T18:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/gsubs/1.0.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gsubs/1.0.3", "licenseUrl": "https://raw.githubusercontent.com/sanjevirau/gsubs/master/LICENSE", "packageName": "gsubs", "displayName": "gSubs", "summary": "A desktop app that finds you the perfect subtitle match for your videos.", "version": "1.0.3", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/gsubs/gsubs.png", "author": "sanjevirau and yihou.", "downloadCount": 969, "tags": ["gsubs", "subtitle", "grabber", "videos"]}