{"description": "![Screenshot of G Suite Training for Chrome](https://lh3.googleusercontent.com/y8VLrlrgBzlvQxJmC_H537_HwhmF-fhXXak8IGsJ3-WX4apCxg4Xzi_FQcLwJv19hjUt8kBr=s640-h400-e365-rw)\t\n\t\n###Interactive training and walkthroughs, right within G Suite\n\nNew to G Suite? G Suite Training is a Chrome extension that offers simple and interactive training lessons to get you up and running fast with G Suite (formerly Google Apps). \n\n• Rich, interactive training - Whether you’re in Gmail, Calendar, Sheets, Slides, or Docs, you can learn and take actions, all at the same time.\n\n• In-App experience - Training is accessible directly within G Suite, so you don’t need to leave the application to learn how to use it.\n\n• Available to all - Whether it’s to master Google Classroom, or the G Suite Admin Console, G Suite Training is free for your entire organization.\n\n• Learn more at https://support.google.com/a/answer/7039472.\n\nAfter adding to Chrome, refresh your Gmail, Calendar, Drive, Docs, Sheets, Slides, Sites, Forms, Google+, Classroom, and Admin Console tabs to access the training menu.\n\nIf you require technical support please contact us through the Settings link in the Training menu.\n\nBy installing this item, you agree to the Google Terms of Service and Privacy Policy at https://www.google.com/intl/en/policies/.\n\t\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-19T23:48:53Z", "galleryUrl": "https://community.chocolatey.org/packages/gsuite-training-chrome/1.8.11", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gsuite-training-chrome/1.8.11", "licenseUrl": "https://www.google.com/intl/en/policies/", "packageName": "gsuite-training-chrome", "displayName": "G Suite Training for Chrome", "summary": "G Suite Training for Chrome extension", "version": "1.8.11", "icon": "https://lh3.googleusercontent.com/Fi1c_RTXaXq2xKNJtwAZfjEK_m9ovFrmirbpv6b1yP5R66wLT2pIAxCxtV2-kE4svU6T452f=s26-h26-e365-rw", "author": "Google", "downloadCount": 1466, "tags": ["gsuite", "google", "apps", "suite", "calendar", "sheets", "slides", "docs", "training", "chrome", "extension"]}