{"description": "# The World Is Yours\n\n**Guild Wars 2** is an online role-playing game with fast-paced action combat, a rich and detailed universe of stories, awe-inspiring landscapes to explore, two challenging player vs. player modes—and no subscription fees!\n\n## Explore a Living World\n\nTyria comes alive with thousands of stories that change based on the actions of players like you. You never know what you'll discover each time you play!\n\n## Action-Oriented Combat\n\nExperience high-impact, fast-paced combat and choose from an arsenal of professions, weapons, and playstyles. Attack on the move, dodge and roll away from enemy blows, and come to your allies' rescue midbattle. In the open world, you can team up with every player you meet—no grouping required!\n\n## It's Your Story\n\nTyria is irrevocably shaped by its past, and you play a crucial role in its future. Create a unique character, decide how their story evolves, and uncover new revelations, questions, and truths with every choice you make.\n\n## Competitive Play for Everyone\n\nCompetitive play in **Guild Wars 2** is easy to learn but offers challenges for new players and hardcore PvPers alike. Whether you decide to jump into quick, furious matches between small groups of players in organized PvP or join hundreds of other players in the grand battles of World vs. World, PvP is where you'll find the ultimate challenge!", "updated": "2024-03-21T22:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/guild-wars-2/1.0.0.10002", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/guild-wars-2/1.0.0.10002", "licenseUrl": "https://us.ncsoft.com/en-us/legal/ncsoft/user-agreement", "packageName": "guild-wars-2", "displayName": "Guild Wars 2", "summary": "Guild Wars 2 is an online role-playing game with fast-paced action combat, a rich and detailed universe of stories, awe-inspiring landscapes to explore, two challenging player vs. player modes—and no subscription fees!", "version": "1.0.0.10002", "icon": "https://cdn.jsdelivr.net/gh/Zoullx/chocolatey-packages/icons/guild-wars-2.png", "author": "ArenaNet", "downloadCount": 239, "tags": ["guild-wars-2", "gaming", "launcher"]}