{"description": "---\n\n### [choco://gwyddion](choco://gwyddion)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of Gwyddion](https://raw.githubusercontent.com/bcurran3/ChocolateyPackages/master/gwyddion/gwyddion_screenshot.png)\n\t\nGwyddion is a modular program for SPM (scanning probe microscopy) data visualization and analysis. Primarily it is intended for the analysis of height fields obtained by scanning probe microscopy techniques (AFM, MFM, STM, SNOM/NSOM) and it supports a lot of SPM data formats. However, it can be used for general height field and (greyscale) image processing, for instance for the analysis of profilometry data or thickness maps from imaging spectrophotometry.\n\nGwyddion provides a large number of data processing functions, including all the standard statistical characterization, levelling and data correction, filtering or grain marking functions. And since the developers are active SPM users, the program also contains a number of specific, uncommon, odd and experimental data processing methods they found useful – and you may find them useful too.\n\nGwyddion is Free and Open Source software, covered by GNU General Public License. It aims to provide a modular program for 2D data processing and analysis that can be easily extended by third-party modules and scripts. Moreover, thanks to being free software, it provides the source code to developers and users, which makes easier both verification of its data processing algorithms and further program improvements.\n\nGwyddion works on GNU/Linux, Microsoft Windows and Mac OS X operating systems on common architectures. All systems can be used also for development. It has a modern graphical user interface based on the widely portable Gtk+ toolkit, consistent across all the supported systems.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/gwyddion/readme.md)**\n\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-19T12:33:32Z", "galleryUrl": "https://community.chocolatey.org/packages/gwyddion/2.63.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/gwyddion/2.63.0", "licenseUrl": "https://www.gnu.org/licenses/old-licenses/gpl-2.0.en.html", "packageName": "gwyddion", "displayName": "Gwyddion (Install)", "summary": "Gwyddion is a multiplatform modular free software for visualization and analysis of data from scanning probe microscopy (SPM) techniques (like AFM, MFM, STM, SNOM/NSOM).", "version": "2.63.0", "icon": "https://raw.githubusercontent.com/bcurran3/ChocolateyPackages/master/gwyddion/gwyddion_icon.png", "author": "David Nečas (Yeti) and Petr Klapetek", "downloadCount": 105, "tags": ["Bio-Informatics", "Visualization", "Physics", "Analytics"]}