{"description": "The Apache Hadoop software library is a framework that allows for the distributed processing of large data sets across clusters of computers using simple programming models. It is designed to scale up from single servers to thousands of machines, each offering local computation and storage. Rather than rely on hardware to deliver high-availability, the library itself is designed to detect and handle failures at the application layer, so delivering a highly-available service on top of a cluster of computers, each of which may be prone to failures.\n\nThe project includes these modules:\n\n* Hadoop Common: The common utilities that support the other Hadoop modules.\n* Hadoop Distributed File System (HDFS™): A distributed file system that provides high-throughput access to application data.\n* Hadoop YARN: A framework for job scheduling and cluster resource management.\n* Hadoop MapReduce: A YARN-based system for parallel processing of large data sets.\n\n## Notes\nThe package sets the HADOOP\\_HOME environment variable and adds HADOOP\\_HOME\\bin to the machine path.\n\nThe package by default will unzip to **C:\\Hadoop**. This location can be changed, see below.\n\n## Package Parameters\nThe following package parameters can be set:\n\n* `/unzipLocation` - Unzip to a different path than default.\n\nThese parameters can be passed to the installer with the use of `-params`.\nFor example: `choco install hadoop -params '\"/unzipLocation:D:\\Hadoop\"'`.\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-23T06:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/hadoop/3.3.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/hadoop/3.3.6", "licenseUrl": "http://www.apache.org/licenses/LICENSE-2.0", "packageName": "hadoop", "displayName": "Hadoop", "summary": "The Apache™ Hadoop® project develops open-source software for reliable, scalable, distributed computing.", "version": "3.3.6", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@9abedd955985420fc0726492cd23345d4c45a9d0/icons/hadoop.png", "author": "Apache Software Foundation", "downloadCount": 12252, "tags": ["apache", "admin", "hadoop", "hdfs", "yarn", "cluster", "mapreduce", "namenode", "datanode"]}