{"description": "HashTab provides OS extensions to calculate file hashes.\n    \nTo use, just right-click on any file and select `Properties`. The new tab called “File Hashes” is Hashtab! \n    \n#### Features\n* Calculate and display hash values from over two dozen popular hashing algorithms like MD5, SHA1, SHA2, RipeMD, HAVAL and Whirlpool.  Now, SHA3 too!\n* The hash comparison tool supports drag and drop, copy and paste and even has a built-in browse option. \n* Translated into 27 languages and counting, Hashtab has been downloaded millions of times from over 200 different countries.\n* The perfect way to validate the integrity of a file download. Or use it to quickly compare local files and compute hashes for use in other programs.\n* Purposely designed to feel like a native feature of Windows. Simply select any file, go to properties, and use the new “File Hashes” tab. \n* Save hashes to checksum files\n\n#### Discontinued\n[Implbits Software, LLC is going out of business.](https://web.archive.org/web/20220118193833/http://implbits.com/)  \"Soon\", a release of Hashtab as an Open Source project will be put on Github.  Until then, this Chocolatey package may be the only place to get the verifiable installer.", "updated": "2024-03-23T22:18:48Z", "galleryUrl": "https://community.chocolatey.org/packages/hashtab/6.0.0.3402", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/hashtab/6.0.0.3402", "licenseUrl": "https://github.com/teknowledgist/Chocolatey-packages/blob/master/discontinued/hashtab/tools/LICENSE.txt", "packageName": "hashtab", "displayName": "HashTab", "summary": "An Explorer extension to calculate file checksums for many hash algorithms.", "version": "6.0.0.3402", "icon": "https://cdn.rawgit.com/teknowledgist/Chocolatey-packages/master/Icons/hashtab_icon.png", "author": "Implbits Software LLC", "downloadCount": 111543, "tags": ["hashtab", "checksum", "hash", "md5", "sha1", "sha2", "ripemd", "haval", "whirlpool", "sha256", "file", "embedded"]}