{"description": "### Note: Open Source ELK Stack does not work with agents that are based on Elastic Paid License. The apache 2.0 license (OSS) packages are limited in what it can support with ELK.\n\n## Heartbeat - OSS is open-source, based on Apache2.0 License which is for open source ELK Stack.\n\nHeartbeat is a lightweight daemon that you install on a remote server to periodically check the status of your services and determine whether they are available. Unlike Metricbeat, which only tells you if your servers are up or down, Heartbeat tells you whether your services are reachable.\n\nHeartbeat currently supports monitors for checking hosts via:\n\n * ICMP (v4 and v6) Echo Requests. Use the icmp monitor when you simply want to check whether a service is available. This monitor requires root access.\n * TCP. Use the tcp monitor to connect via TCP. You can optionally configure this monitor to verify the endpoint by sending and/or receiving a custom payload.\n * HTTP. Use the http monitor to connect via HTTP. You can optionally configure this monitor to verify that the service returns the expected response, such as a specific status code, response header, or content.\n\nThe tcp and http monitors both support SSL/TLS and some proxy settings.\n\n ![heartbeat-system-dashboard](https://www.elastic.co/guide/en/beats/heartbeat/current/images/heartbeat-statistics.png)", "updated": "2024-03-22T09:48:41Z", "galleryUrl": "https://community.chocolatey.org/packages/heartbeat-oss/8.12.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/heartbeat-oss/8.12.0", "licenseUrl": "https://github.com/elastic/beats/tree/8.12/licenses/APACHE-LICENSE-2.0.txt", "packageName": "heartbeat-oss", "displayName": "Heartbeat - OSS", "summary": "Heartbeat is a lightweight daemon that you install on a remote server to periodically check the status of your services and determine whether they are available. Heartbeat tells you whether your services are reachable.", "version": "8.12.0", "icon": "https://rawcdn.githack.com/mkopnsrc/chocolatey-packages/081b33ffc1bb251042f21277ba060fdea727dad7/icons/elastic-beats.png", "author": "ElasticSearch", "downloadCount": 1430, "tags": ["metricbeat", "metricbeat-oss", "beats", "elastic", "kibana", "logbeats", "open-source"]}