{"description": "HeidiSQL is a useful and reliable tool designed for web developers using the popular MySQL server, Microsoft SQL databases, PostgreSQL and Interbase/Firebird. It enables you to browse and edit data, create and edit tables, views, procedures, triggers and scheduled events. Also, you can export structure and data either to SQL file, clipboard or to other servers.\n\n### Features\n\n* Free for everyone, OpenSource since 9 years of active development.\n* Connect to multiple servers in one window\n* Connect to servers via commandline\n* Connect via SSH tunnel, or pass SSL settings\n* Create and edit tables, views, stored routines, triggers and scheduled events.\n* Generate nice SQL-exports, compress these afterwards, or put them on the clipboard.\n* Export from one server/database directly to another server/database\n* Manage user-privileges\n* Import text-files\n* Export table rows as CSV, HTML, XML, SQL, LaTeX, Wiki Markup and PHP Array\n* Browse and edit table-data using a comfortable grid\n* Bulk edit tables (move to db, change engine, collation etc.)\n* Batch-insert ascii or binary files into tables\n* Write queries with customizable syntax-highlighting and code-completion\n* Pretty reformat disordered SQL\n* Monitor and kill client-processes\n* Find specific text in all tables of all databases of one server\n* Optimize and repair tables in a batch manner\n* Launch a parallel mysql.exe command line window using your current connection settings\n* And much more", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/HeidiSQL/12.6.0.6765", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/HeidiSQL/12.6.0.6765", "licenseUrl": "http://www.gnu.org/licenses/old-licenses/gpl-2.0.html", "packageName": "HeidiSQL", "displayName": "HeidiSQL (Install)", "summary": "HeidiSQL is a useful and reliable tool designed for web developers using the popular MySQL server, Microsoft SQL databases, PostgreSQL and Interbase/Firebird.", "version": "12.6.0.6765", "icon": "https://www.heidisql.com/images/logo-chocolatey.png", "author": "Ansgar Becker", "downloadCount": 299334, "tags": ["heidisql", "admin", "sql", "database", "mysql", "mssql", "postgresql", "interbase", "firebird"]}