{"description": "---\n\n### [choco://hfsexplorer](choco://hfsexplorer)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of HFSExplorer](https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/hfsexplorer/hfsexplorer_screenshot.png)\n\nWhat is HFSExplorer?\n\nHFSExplorer is an application that can read Mac-formatted hard disks and disk images.\nIt can read the file systems HFS (Mac OS Standard), HFS+ (Mac OS Extended) and HFSX (Mac OS Extended with case sensitive file names).\n\nHFSExplorer allows you to browse your Mac volumes with a graphical file system browser, extract files (copy to hard disk), view detailed information about the volume and create disk images from the volume.\nHFSExplorer can also read most .dmg / .sparsebundle disk images created on a Mac, including zlib / bzip2 compressed images and AES-128 / AES-256 encrypted images. It supports the partition schemes Master Boot Record, GUID Partition Table and Apple Partition Map natively.\n\nYou may be interested in the application if you're:\n\nA user of an Intel Mac running Windows with Boot Camp in need of accessing the files on the Mac OS X hard drive.\nOwners of HFS+-formatted iPods, that wish to access their content from within Windows or elsewhere (a user emailed me and verified that this works).\nUsers of PearPC or similar Mac emulation/virtualization software that wish to access the contents of their virtual hard disks (will only work if the disk image is stored in raw format, as in PearPC).\nPeople that need to access the contents of HFS+-formatted .dmg / .sparsebundle files.\nHFSExplorer is written mostly in Java 5, optionally using some Java 6 / 7 features, with some Windows-specific parts written in C in order to be able to get raw access to block devices, and to create a practical launcher application.\n\nLinux and OS X users should in most cases not need HFSExplorer for browsing file systems on devices, since there are native file system drivers available on those systems, but it seems to work fine if you need it. Linux users might find use for opening .dmg / .sparsebundle files.\nNOTE: HFSExplorer will install silently but will not uninstall silently. A window will pop up asking if you want to remove the program. A forced reinstall will run the uninstall, causing same.\n    \n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/hfsexplorer/readme.md)**\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-23T23:33:25Z", "galleryUrl": "https://community.chocolatey.org/packages/hfsexplorer/2021.10.9", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/hfsexplorer/2021.10.9", "licenseUrl": "http://www.catacombae.org/licenses/gpl-3.0.txt", "packageName": "hfsexplorer", "displayName": "HFSExplorer (Install)", "summary": "HFSExplorer is an application that can read Mac-formatted hard disks and disk images.", "version": "2021.10.9", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/hfsexplorer/hfsexplorer_icon.png", "author": "Erik Larsson,  catacombae", "downloadCount": 35930, "tags": ["hfsexplorer", "mac", "hfs", "hfs+", "hfsx", "dmg", "sparsebundle", "binary", "embedded"]}