{"description": "---\n\n### [choco://hp-universal-print-driver-ps](choco://hp-universal-print-driver-ps)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n# One versatile print driver for your PC or laptop\n\nAutomatically discover and print to supported HP devices and some non-HP devices with a single print driver. When you install the free HP Universal Print Driver (UPD) on a PC or laptop, it communicates with the supported devices to determine the unique print capabilities installed on each device.\n\nYou can easily locate and print to another printer within your network—in your current location or when visiting another company location. And the HP UPD allows you to add a new printer at any time—without the hassle of downloading another print driver.\n\n## Improve user productivity and cut help desk activity\n\nIT managers can dramatically reduce the number of drivers they manage and give users the tools to improve efficiency. The HP Universal Print Driver (UPD) provides full printing support, including support for advanced features, for most HP LaserJet devices. The driver also offers basic printing capability for many other printing devices. Click the link at the right to see a list of supported products.\n\nUsers are more self-sufficient when the HP UPD is deployed, reducing the need for help desk calls. The print driver discovers device features using bidirectional communication. The driver then displays current, accurate device information, including advanced options like automatic two-sided printing, input trays, and finishing features. Use a single, trusted driver to make printing easy:\n\n* One driver to configure—migrate to new devices, implement new technologies, and update operating systems.\n* Familiar printing experience—the HP UPD provides a consistent interface across a variety of HP printers, reducing the need for training and support.\n* Versatile support for desktop or on-the-go use—users can use Traditional mode when they stay in one location or Dynamic mode when they're on the road or need to search for a new printer.\n* Real-time job and device information—the HP UPD's real-time, graphical interface empowers users to resolve common problems themselves, improving printer uptime and increasing productivity.\n* Secure encrypted printing—make your printing environment more secure with print job encryption. Users can queue print jobs utilizing job storage and enter a PIN at the output device to print their documents.\n* Broad compatibility and global localization—most HP and some non-HP printing devices are compatible with the HP UPD. It can be deployed via print server or direct IP. The HP UPD is available in PCL5, PCL6, and Postscript emulation and supports current Windows client and server operating systems (32-bit and 64-bit), as well as Novell and Citrix. Local language drivers are available in 35 languages.\n\n[HP Universal Print Driver Series for Windows - Supported Printers](https://support.hp.com/us-en/document/ish_4952109-2831856-16)\n[HP Universal Print Driver Series for Windows - Specifications](https://support.hp.com/us-en/product/hp-universal-print-driver-series-for-windows/503548/document/ish_5034432-5034489-16)", "updated": "2024-03-23T05:03:31Z", "galleryUrl": "https://community.chocolatey.org/packages/hp-universal-print-driver-ps/7.1.0.25570", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/hp-universal-print-driver-ps/7.1.0.25570", "licenseUrl": "https://support.hp.com/us-en/document/c00581401", "packageName": "hp-universal-print-driver-ps", "displayName": "HP Universal Print Driver for Windows PS (Install)", "summary": "HP Universal Print Driver for Windows (PS) - One versatile print driver for your PC or laptop", "version": "7.1.0.25570", "icon": "https://support.hp.com/static/hp-portal-theme-static/themes/Portal8.0/hp/images/hp-logo-modal.gif", "author": "HP Inc", "downloadCount": 50044, "tags": ["hp", "universal", "print", "printer", "driver", "upd", "ps", "postscript"]}