{"description": "UPDATE: The official Microsoft download link for HTML Help Workshop is no longer online. Since version 1.32.1, this package downloads from archive.org.\n\nAs an information delivery system, HTML Help is suited for a wide range of applications, including training guides, interactive books, and electronic newsletters, as well as help for software applications.\n\nHTML Help offers some distinct advantages over standard HTML, such as the ability to implement a combined table of contents and index and the use of keywords for advanced hyperlinking capability. The HTML Help compiler (part of the HTML Help Workshop) makes it possible to compress HTML, graphic, and other files into a relatively small compiled help (.chm) file, which can then be distributed with a software application, or downloaded from the Web.\n\nHTML Help consists of an online Help Viewer, related help components, and help authoring tools from Microsoft Corporation. The Help Viewer uses the underlying components of Microsoft Internet Explorer to display help content. It supports HTML, ActiveX, Java, scripting languages (JScript, and Microsoft Visual Basic Scripting Edition), and HTML image formats (.jpeg, .gif, and .png files). The help authoring tool, HTML Help Workshop, provides an easy-to-use system for creating and managing help projects and their related files.\n\n*Important* Please note that the latest version of the HTML Help technology is 1.4, as is the SDK. The latest version of the HTML Help Workshop download is 1.3. As of March 2012 there is no HTML Help Workshop 1.4.", "updated": "2024-03-23T00:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/html-help-workshop/1.32.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/html-help-workshop/1.32.1", "licenseUrl": "https://msdn.microsoft.com/en-us/library/windows/desktop/ms669979(v=vs.85).aspx", "packageName": "html-help-workshop", "displayName": "HTML Help Workshop", "summary": "Microsoft HTML Help is the standard help system for the Windows platform. Authors can use HTML Help to create online help for a software application or to create content for a multimedia title or Web site. Developers can use the HTML Help API to program a host application or hook up context-sensitive help to an application.", "version": "1.32.1", "icon": "https://cdn.rawgit.com/dwickern/chocolatey-packages/748db2175b61ce634a385d33669b7300a19ddd9e/html-help-workshop/icon48.png", "author": "Microsoft", "downloadCount": 25565, "tags": ["documentation", "html", "help", "workshop", "chm", "sandcastle", "admin"]}