{"description": "With Hugin you can assemble a mosaic of photographs into a complete immersive panorama, stitch any series of overlapping pictures and much more.\n\nHugin is an Open Source panorama stitcher and graphical user interface (GUI) for Panorama tools. It also provides a number of additional components and command line tools.\n\nAlthough Hugin is essentially a panorama stitcher, like other GUI front-ends it has a range of advanced features:\nAmong the Hugin workflow options, it is possible to correct exposure, Vignetting and White balance between photos; generate HDR, exposure fused or focus stacked output from bracketed photos; or use 16bit and HDR input data natively.\n\nPhotos can be digital or scanned, and taken with any kind of camera. A full range of lenses are supported, from simple cameraphones to obscure fisheye lenses. Hugin supports various output projections including a range of spherical, cartographic, and camera projections.\n\nHugin supports panoramas taken with multiple rows of photos, with or without bracketing. Bracketed photos can be handheld, taken using a DSLR bracketing function, or as consecutive panoramas shot at different EV exposure levels. Hugin can produce successful panoramas shot with cameras that always shoot using auto-exposure and auto-whitebalance.\n\nhugin also supports the use of masks which means that you can exclude parts of images you don't want to appear in your panoramas, or include parts of image you specifically want to appear in your panoramas.\n\nHugin also uses a separate (background) panorama stitcher. This means that you can render a panorama in the PTBatcherGUI stich window, while working on the next panorama in hugin.\n\nStarting with version 2011.2.0, Hugin is scriptable in Python. The scripting functionality is still in its infancy and requires more development and testing. For now it is available only in Linux and Windows, and currently there is no feedback from the plugin apart from it's success or failure, which is communicated in a dialog. If you're on Linux, you can start hugin from the command line and switch to the window you started it from while the plugin is running - then you'll see any console output it may produce.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/hugin.install/screenshot.png)", "updated": "2024-03-22T22:33:38Z", "galleryUrl": "https://community.chocolatey.org/packages/hugin.install/2023.0.0.20240101", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/hugin.install/2023.0.0.20240101", "licenseUrl": "https://www.gnu.org/licenses/gpl-2.0.html", "packageName": "hugin.install", "displayName": "Hugin (Install)", "summary": "With Hugin you can assemble a mosaic of photographs into a complete immersive panorama, stitch any series of overlapping pictures and much more.", "version": "2023.0.0.20240101", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/hugin.install/hugin.install.png", "author": "Pablo d Angelo and Hugin Team", "downloadCount": 10032, "tags": ["hugin.install", "photo", "image", "panorama"]}