{"description": "HxD is a carefully designed and fast hex editor which, additionally to raw disk editing and modifying of main memory (RAM), handles files of any size.\n\nThe easy to use interface offers features such as searching and replacing, exporting, checksums/digests, insertion of byte patterns, a file shredder, concatenation or splitting of files, statistics and much more.\n\nEditing works like in a text editor with a focus on a simple and task-oriented operation, as such functions were streamlined to hide differences that are purely technical.\nFor example, drives and memory are presented similar to a file and are shown as a whole, in contrast to a sector/region-limited view that cuts off data which potentially belongs together. Drives and memory can be edited the same way as a regular file including support for undo. In addition memory-sections define a foldable region and inaccessible sections are hidden by default.\n\nFurthermore a lot of effort was put into making operations fast and efficient, instead of forcing you to use specialized functions for technical reasons or arbitrarily limiting file sizes. This includes a responsive interface and progress indicators for lengthy operations.\n\n### Package Specifics\nAll package versions will download and install the latest HxD version since the software vendor only provides a generic URI without version information.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/HxD/2.5.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/HxD/2.5.0.0", "licenseUrl": "https://mh-nexus.de/en/hxd/license.php", "packageName": "HxD", "displayName": "HxD - Hex Editor and Disk Editor (Install)", "summary": "HxD is a carefully designed and fast hex editor which, additionally to raw disk editing and modifying of main memory (RAM), handles files of any size.", "version": "2.5.0.0", "icon": "https://raw.githack.com/koitsu/chocolatey-packages/master/hxd/HxD.png", "author": "Maël Hörz", "downloadCount": 248274, "tags": ["hxd", "editor", "hex", "file", "admin"]}