{"description": "Hyperspace is the fluffiest client for Mastodon and other fediverse networks written in TypeScript and React. Hyperspace offers a fun, clean, fast, and responsive design that scales beautifully across devices and enhances the fediverse experience.\n    \n    * __Responsive by design__: Hyperspace is beautifully designed to put your content front and center and bring a familiar experience to Mastodon. View threads and profiles with ease and compose anywhere with the compose button. And, of course, Hyperspace scales across devices beautifully, providing the same experience anywhere.\n    * __Customizable__: Hyperspace allows customization and configuration at every level, from the server level with branding and instance setup, down to the user level with dark mode, custom themes, and multi-user account support. And, if the default configuration settings aren't enough, anyone can make their own version of Hyperspace with custom additions.\n    * __Open-source__: Hyperspace is free (libre) and open-source software. Licensed under the Non-Violent Public License, anyone can modify, redistribute, or contribute to the Hyperspace project without restriction. Hyperspace is written in TypeScript and takes advantage of multiple open-source libraries and projects such as React, Megalodon, and Material-UI, so web and Node.js developers will feel right at home.", "updated": "2024-03-11T09:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/hyperspace-desktop/1.1.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/hyperspace-desktop/1.1.2", "licenseUrl": "https://raw.githubusercontent.com/hyperspacedev/hyperspace/master/LICENSE.txt", "packageName": "hyperspace-desktop", "displayName": "Hyperspace Desktop", "summary": "The new beautiful, fluffy client for the fediverse written in TypeScript and React", "version": "1.1.2", "icon": "https://cdn.statically.io/gh/FullofQuarks/chocolatey-packages/master/icons/hyperspace-desktop.png", "author": "Marquis Kurt,  Travis Kohlbeck,  Audrey Maxwell", "downloadCount": 639, "tags": ["hyperspace", "fediverse", "mastodon"]}