{"description": "The iASL compiler/disassembler is a fully-featured translator for the ACPI Source Language (ASL) and ACPI\nbinary data tables. As part of the Intel ACPI Component Architecture, the Intel ASL compiler implements\ntranslation for the ACPI Source Language (ASL) to the ACPI Machine Language (AML). The disassembler feature\nwill disassemble compiled AML code back to (near-original) ASL source code.\n\n## Features\n\nThe major features of the iASL compiler include:\n\n* Full support for the ACPI 5.1 Specification including ASL grammar elements and operators.\n* Extensive compiler syntax and semantic error checking, especially in the area of control methods.\nThis reduces the number of errors that are not discovered until the AML code is actually interpreted\n(i.e. the compile-time error checking reduces the number of run-time errors).\n* An integrated preprocessor provides C-compatible preprocessor directives and conditional compilation\ndirectives such as #define, #if, #ifdef, #else, etc.\n* Multiple types of output files. Besides binary ACPI tables, output options include formatted listing\nfiles with intermixed source, several types of AML files, and error messages.\n* Automatic detection and compilation of either ASL source code or ACPI data table source code.\n* Portable code (ANSI C) and source code availability allows the compiler to be easily ported and run\non multiple execution platforms.\n* Support for integration with the Microsoft Visual C++ (or similar) development environments.\n* Disassembly of all ACPI tables, including tables that contain AML (DSDT, SSDT) as well as ACPI “data”\ntables such as the FADT, MADT, SRAT, etc.\n* Support for compilation of non-AML data tables such as the FADT, MADT, SRAT, etc.\n* Support for ASL language extensions that support symbolic math/logical operators and expressions.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@fe977f362ae69c7f6ab164f87a9223d36538d3ed/automatic/iasl/screenshot.png)\n\n## Notes\n\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\nIf you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-22T15:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/iasl/2023.06.28", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/iasl/2023.06.28", "licenseUrl": "https://www.intel.com/content/www/us/en/developer/articles/license/acpica-licensing.html", "packageName": "iasl", "displayName": "iASL Compiler and ACPI Tools", "summary": "ASL source language compiler, ACPI table compiler, and AML disassembler", "version": "2023.06.28", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@fe977f362ae69c7f6ab164f87a9223d36538d3ed/icons/iasl.png", "author": "Intel Corporation", "downloadCount": 27518, "tags": ["iasl", "compiler", "decompiler", "asl", "aml", "acpi", "acpica", "intel"]}