{"description": "**iGetter** is a powerful, full featured download manager and accelerator. iGetter can greatly improve the speed of your downloads using segmented downloading. In addition it allows auto resume on broken downloads, queue filtering by various criteria, site explorer, history list, scheduling downloads for low traffic periods, auto shut down or sleep on completion, and much more.\n\nDefault installation folder is in \"Program Files (x86)\".\n\n## Features\n- iGetter supports Segmented (Accelerated) downloading. This feature of iGetter can greatly improve the speed of your downloads.\n- iGetter supports HTTP(S) and FTP (including FTP over SSL) protocols.\n- iGetter supports HTTP, Tunnel and FTP Proxies, and Socks Firewalls.\n- iGetter calculates MD5 and SHA256 checksums so you can verify completed downloads.\n- With a single click you can **open VirusTotal recent report** for finished downloads.\n- iGetter supports file mirrors for additional acceleration of downloads.\n- iGetter includes a **Site Explorer** that allows exploration of entire web or FTP sites, so you can easily find and download files you're interested in.\n- **iGetter integrates with Internet Browsers by a browser extension, available for Microsoft Edge, Chrome, Chromium based browsers (i.e. Opera, Vivaldi), Firefox and SeaMonkey**.\n- iGetter supports the drag and drop technology and monitoring of your clipboard for Internet addresses.\n- iGetter can process all web page links for downloading in the queue.\n- iGetter allows previewing of all finished media downloads directly in the application.\n- With the iGetter Tray Icon control menu, you can easily control iGetter while it is hidden.\n- iGetter can **schedule your downloads** for low traffic periods (i.e. 4 in the morning).\n- iGetter can Shut down/Sleep the computer when all files in the queue are finished.\n- iGetter has a Speed Limit function which allows you to download files and still use your web browser without loss of performance.\n- iGetter is a lightweight application, **optimized for low RAM and CPU usage**.\n\nSee more on the [Features](https://www.igetter.net/additional_features.html) page.\n\n![screenshot](https://cdn.jsdelivr.net/gh/presentasoftware/chocolatey-packages/manual/igetter/screenshot_small.png)\n\n## Registration of iGetter\nThis trial version allows you to evaluate iGetter. There is no time or features limit, but if iGetter suits your needs, you should consider purchasing it. iGetter will show a reminder dialog at every startup during the evaluation.\nTo purchase iGetter, select \"Register\" function in the Help menu. Then, click on the \"Purchase\" button and follow the instructions on our WebStore.\n\n## Antivirus reports\niGetter is clean from viruses, so if some antivirus software reports a threat, you may be confident that it’s a false positive. This package is published by the software vendor itself and includes the official release of iGetter.\n\nCurrently, Cynet is the only antivirus engine that flags our product on VirusTotal. We contacted Cynet about this false positive and they corrected their engine. But after a month, Cynet again wrongly flagged the same file. The main executable iGetter.exe is all green with all antivirus engines including Cynet. The flagged file is named iGetter_x86.exe, which is a Native messaging host required for iGetter browser extension in Chromium based browsers.\n\nHere are some other antivirus reports which found iGetter as `100% clean`. Softpedia and Download3k have downloaded and tested version 3.0.0 of iGetter using several antivirus engines. They have found it to be clean of any form of badware (viruses, spyware, adware, etc.). You can view the scan reports of [Download3k](https://www.download3k.com/Antivirus-Report-iGetter.html \"Clean - Full Antivirus Test\") and [Softpedia](https://www.softpedia.com/get/Internet/Download-Managers/iGetter.shtml#status \"100% Clean Download\").", "updated": "2024-03-19T20:48:55Z", "galleryUrl": "https://community.chocolatey.org/packages/igetter/3.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/igetter/3.0.0", "licenseUrl": "", "packageName": "igetter", "displayName": "iGetter", "summary": "iGetter is a full featured download manager and accelerator.", "version": "3.0.0", "icon": "https://cdn.jsdelivr.net/gh/presentasoftware/chocolatey-packages/manual/igetter/igetter.png", "author": "Presenta Ltd.", "downloadCount": 232, "tags": ["igetter", "download", "manager", "accelerator", "downloader", "trial"]}