{"description": "ike-scan discovers IKE hosts and can also fingerprint them using the\nretransmission backoff pattern.\n\nike-scan can perform the following functions:\n\n- **Discovery** Determine which hosts in a given IP range are running IKE.  This is done by displaying those hosts which respond to the IKE requests sent by ike-scan.\n- **Fingerprinting** Determine which IKE implementation the hosts are using, and in some cases determine the version of software that they are running.  This is done in two ways: firstly by UDP backoff fingerprinting which involves recording the times of the IKE response packets from the target hosts and comparing the observed retransmission backoff pattern against known patterns; and secondly by Vendor ID fingerprinting which compares Vendor ID payloads from the VPN servers against known vendor id patterns.\n- **Transform Enumeration** Find which transform attributes are supported by the VPN server for IKE Phase-1 (e.g. encryption algorithm, hash algorithm etc.).\n- **User Enumeration** For some VPN systems, discover valid VPN usernames.\n- **Pre-Shared Key Cracking** Perform offline dictionary or brute-force password cracking for IKE Aggressive Mode with Pre-Shared Key authentication. This uses ike-scan to obtain the hash and other parameters, and psk-crack (which is part of the ike-scan package) to perform the cracking.\n\nThe retransmission backoff fingerprinting concept is discussed in more detail in the UDP backoff fingerprinting paper which should be included in the ike-scan kit as [UDP Backoff Fingerprinting Paper](udp-backoff-fingerprinting-paper.txt).\n\nThe program sends IKE phase-1 (Main Mode or Aggressive Mode) requests to the specified hosts and displays any responses that are received.  It handles retry and retransmission with backoff to cope with packet loss.  It also limits the amount of bandwidth used by the outbound IKE packets.\n\nIKE is the Internet Key Exchange protocol which is the key exchange and authentication mechanism used by IPsec.  Just about all modern VPN systems implement IPsec, and the vast majority of IPsec VPNs use IKE for key exchange. Main Mode is one of the modes defined for phase-1 of the IKE exchange (the other defined mode is aggressive mode).  RFC 2409 section 5 specifies that main mode must be implemented, therefore all IKE implementations can be expected to support main mode. Many also support Aggressive Mode.", "updated": "2024-03-21T22:48:31Z", "galleryUrl": "https://community.chocolatey.org/packages/ike-scan/1.9", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ike-scan/1.9", "licenseUrl": "https://github.com/royhills/ike-scan/blob/master/COPYING", "packageName": "ike-scan", "displayName": "ike-scan (Install)", "summary": "Discover and fingerprint IKE hosts (IPsec VPN Servers)", "version": "1.9", "icon": "", "author": "Roy Hills", "downloadCount": 751, "tags": ["ike-scan", "VPN", "IPsec"]}