{"description": "Public domain software for processing and analyzing scientific images – a.k.a. ImageJ 1.x.\n\n## Features\n\n* Display, edit, analyze, process, save, and print 8-bit color and grayscale, 16-bit integer, and 32-bit\nfloating point images\n\n* Read many image file formats, including TIFF, PNG, GIF, JPEG, BMP, DICOM, and FITS, as well as raw formats\n\n* Supports image stacks, a series of images that share a single window, and it is multithreaded, so\ntime-consuming operations can be performed in parallel on multi-CPU hardware\n\n* Calculate area and pixel value statistics of user-defined selections and intensity-thresholded objects\n\n* Measure distances and angles\n\n* Create density histograms and line profile plots\n\n* Supports standard image processing functions such as logical and arithmetical operations between images,\ncontrast manipulation, convolution, Fourier analysis, sharpening, smoothing, edge detection, and median\nfiltering\n\n* Geometric transformations such as scaling, rotation, and flips\n\n* Supports any number of images simultaneously, limited only by available memory\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@3d96ff972ea781c5e7ddf915b56f74c7b4baf5a4/automatic/imagej/screenshot.png)\n\n## Package Parameters\n\nThe following package parameter can be set:\n\n* `/AddToDesktop`   - add a desktop shortcut for ImageJ. By default the shortcut will be added for all users\n* `/AddToStartMenu` - add a start menu entry for ImageJ. By default the shortcut will be added for all users\n\neg. `choco install -y imagej --package-parameters=\"/AddToDesktop /AddToStartMenu\"`\n\n* `/User`           - where the user parameter is specified any shortcuts created (`/AddToDesktop`, `/AddToStartMenu`)\nwill only be added for the current user\n\neg. `choco install -y imagej --package-parameters=\"/AddToDesktop /AddToStartMenu /User\"`\n\n## Notes\n\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\nIf you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-22T21:49:09Z", "galleryUrl": "https://community.chocolatey.org/packages/imagej/1.54", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/imagej/1.54", "licenseUrl": "https://imagej.nih.gov/ij/disclaimer.html", "packageName": "imagej", "displayName": "ImageJ - Image Processing and Analysis in Java", "summary": "Image processing and analysis in Java", "version": "1.54", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@a306a1daa4f210fa0a5421f2a3c996804629256a/icons/imagej.png", "author": "Wayne Rasband", "downloadCount": 10579, "tags": ["imagej", "computer-vision", "image-analysis", "image-processing"]}