{"description": "Image Analyzer contains both most image enhancement features found in conventional image editors plus a number of advanced features not even available in professional photo suites.\n\n#### Features\n* Automatic brightness, contrast, gamma and saturation adjustment\n* Build-in conventional and adaptive filters for noise reduction, edge extraction etc.\n* Retouch tools including clone, spot healing and warping brushes\n* Basic support for layers\n* Retinex filter for reducing shadows and increasing local contrast\n* Deconvolution for out-of-focus and motion blur compensation (see below)\n* Easy red-eye removal\n* User specified filters in spatial and frequency domain\n* Resize, rotate, crop and warping of images\n* Pixel art scaling operation for icons and other graphic (xBR/HQx/Waifu2x)\n* Scanner, camera and printer support\n* File format support:\n* Read/write BMP, ICO, CUR, WMF, EMF, PNG, MNG, GIF, PCX, JPEG and JPEG 2000 images\n* Read CR2, RAS, PNM, PGM, PPM, HIPS and Matlab files\n* Morphological operations\n* Color model conversion: RGB, CMY, HSI, Lab, YCbCr, YIQ and PCA\n* Distance, Fourier and discrete cosine transformation\n* Math expression module for creating and transforming images and advanced \"pocket\" calculator with equation solver\n* Plugin system for adding more specialized features. [See here for available plugins.](http://logicnet.dk/Analyzer/plugins/)", "updated": "2024-03-23T13:03:29Z", "galleryUrl": "https://community.chocolatey.org/packages/imageanalyzer/1.38.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/imageanalyzer/1.38.4", "licenseUrl": "https://github.com/teknowledgist/Chocolatey-packages/blob/master/manual/imageanalyzer/tools/LICENSE.txt", "packageName": "imageanalyzer", "displayName": "Image Analyzer (portable)", "summary": "Advanced image editing, enhancement and analysis software.", "version": "1.38.4", "icon": "https://cdn.rawgit.com/teknowledgist/Chocolatey-packages/master/Icons/imageanalyzer_icon.png", "author": "Michael Vinther", "downloadCount": 1073, "tags": ["imageanalyzer", "image", "edit", "analysis", "enhancement"]}