{"description": "Internet Information Services (IIS) Manager for Remote Administration provides end users and administrators with the ability to securely manage remote IIS servers (version 7 and above) from Windows clients (XP and above). A Web server administrator can perform almost all IIS administrative tasks while site owners and developers that have been delegated administrative privileges can use IIS Manager for Remote Administration to make allowed changes to the remote Web server. IIS Manager for Remote offers the same user interface available on Windows Server to ensure a more consistent experience when managing and configuring the Web server.\n\nFeatures\n- Remotely manages IIS from Windows clients (XP and above)\n- Connects directly to a Web server, Web site, or Web application\n- Installs even when you don't have IIS on the local machine\n- Allows multiple simultaneous connections\n- Supports delegated administration to Web sites and Web applications so owners can connect to and manage their own site directly\n- Familiar and easy to use administration tool\n- Supports HTTP over SSL for more secure management\n- Automatically downloads features to the local IIS Manager for Remote Administration console to match features newly installed on the remote Web server\n\nNote: the local IIS Management Console needs to be enabled (using `choco install IIS-ManagementConsole -source WindowsFeatures`, `Enable-WindowsOptionalFeature -Online -FeatureName IIS-ManagementConsole` from PowerShell, \"Control Panel->Programs->Turn Windows Features On or Off\" or other means) before installing this package.", "updated": "2024-03-24T00:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/inetmgr/1.2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/inetmgr/1.2.0", "licenseUrl": "https://www.microsoft.com/en-us/servicesagreement", "packageName": "inetmgr", "displayName": "Microsoft IIS Manager for Remote Administration", "summary": "IIS Manager for Remote Administration is an administration tool that provides end users and administrators with the ability to remotely manage IIS servers of version 7.0 and above.", "version": "1.2.0", "icon": "https://cdn.rawgit.com/jberezanski/ChocolateyPackages/07fd250715fa51089c58db1e3ff025b27b80958d/icons/inetmgr.png", "author": "Microsoft", "downloadCount": 580, "tags": ["microsoft", "iis", "web", "server", "remote", "mmc", "admin"]}