{"description": "InfluxDB is a time series database designed to handle high write and query loads. It is an integral component of the TICK stack. InfluxDB is meant to be used as a backing store for any use case involving large amounts of timestamped data, including DevOps monitoring, application metrics, IoT sensor data, and real-time analytics.\n\n## Features\n\n- Custom high performance datastore written specifically for time series data. The TSM engine allows for high ingest speed and data compression\n- Written entirely in Go. It compiles into a single binary with no external dependencies.\n- Simple, high performing write and query HTTP APIs.\n- Plugins support for other data ingestion protocols such as Graphite, collectd, and OpenTSDB.\n- Expressive SQL-like query language tailored to easily query aggregated data.\n- Tags allow series to be indexed for fast and efficient queries.\n- Retention policies efficiently auto-expire stale data.\n- Continuous queries automatically compute aggregate data to make frequent queries more efficient.\n\n## Package parameters\n\n- `/InstallRoot` - Installation directory root, by default `c:\\influxdata`\n- `/Service` - Install as Windows service. If value `0` is specified, service will be created but not started (`/Service:0`). Note that any existing service will not be removed so before updating, you should first uninstall existing package (this will not remove existing data). \n\n## Notes\n\n- The open source edition of InfluxDB runs on a single node. If you require high availability to eliminate a single point of failure, consider the [InfluxDB Enterprise Edition](https://www.influxdata.com/products/influxdb-enterprise)", "updated": "2024-03-22T17:18:26Z", "galleryUrl": "https://community.chocolatey.org/packages/influxdb1/1.8.10", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/influxdb1/1.8.10", "licenseUrl": "https://github.com/influxdata/influxdb/blob/master/LICENSE", "packageName": "influxdb1", "displayName": "InfluxDB", "summary": "Scalable datastore for metrics, events, and real-time analytics", "version": "1.8.10", "icon": "https://cdn.rawgit.com/majkinetor/chocolatey/master/influxdb1/icon.png", "author": "InfluxData", "downloadCount": 7075, "tags": ["foss", "cross-platform", "cli", "database", "metrics", "influxdata"]}