{"description": "InstEd is a free MSI editor built for professionals. InstEd makes working with files fast and easy.\n\nIf you use Orca, you will love InstEd. If you use some of the more expensive tools, you may find that InstEd makes you more productive for the bread and butter packaging tasks.\n\n==Features==\n* Build cabs from the Media table. Right click a Media table entry to see the files belonging to that cab, or to rebuild the cab.\n* Multi-file editing using tabs. Built from the ground up to handle multiple files, everything from searching to validation can be applied to more than one file at a time.\n* Easy navigation. All relationships within the database are displayed and clickable for easy navigation.\n* Accurate editing. Changes to a field are optionally cascaded to all dependent fields. So, for example, renaming a component can have all references updated.\n* Change highlighting. All changes to an mst are highlighted. Msi files can be compared to highlight the differences. And by comparing an msi to itself while the msi is being edited, change tracking can be performed on an msi.\n* Easy validation. Validation profiles allow full flexibility to apply ICEs from more than one CUB to many files at once, allowing for easy Quality Assurance of many files at once.\n* Transform Chaining. See at a glance all the changes that a sequence of transforms make.", "updated": "2024-03-23T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/InstEd/1.5.15.27", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/InstEd/1.5.15.27", "licenseUrl": "", "packageName": "InstEd", "displayName": "InstEd - Install Edit (Install)", "summary": "InstEd is a free MSI editor built for professionals.", "version": "1.5.15.27", "icon": "https://cdn.rawgit.com/ferventcoder/chocolatey-packages/02c21bebe5abb495a56747cbb9b4b5415c933fc0/icons/InstEd.png", "author": "TNE Enterprises", "downloadCount": 13920, "tags": ["InstEd", "MSI", "editor", "edit", "install", "admin"]}