{"description": "DEPRECATED!\n\n    The Intel® SSD Toolbox will reach End of Maintenance with no additional updates after September 2020. Intel® recommends that users migrate to the Intel® Memory and Storage Tool (GUI) as a replacement for Intel® SSD management and firmware updates.\n    \n    SSD drive management software that allows you to:\n\n- View current drive information for Intel® Solid-State Drives (Intel® SSDs), including:\n  - Model number, capacity, and firmware version\n  - Drive health\n  - Estimated drive life remaining\n  - SMART attributes (also available for hard disk drives and non-Intel SSDs)\n  - IDENTIFY DEVICE information (also available for hard disk drives and non-Intel SSDs)\n- Optimize the performance of an Intel SSD using Trim functionality\n- Optimize the performance of an Intel SSD in RAID 0 using Trim functionality Intel® Rapid Storage Technology (Intel® RST) 11.0 or greater. NOTE: Trim on RAID 0 is not supported on Windows 8* or Windows Server 2012\n- Obtain proactive notifications of new Intel SSD Toolbox software versions for Windows 7 and Windows 8 systems\n- Update the firmware on a supported Intel SSD\n- Run quick and full diagnostic scans to test the read and write functionality of an Intel SSD\n- Check and tune your system settings for optimal Intel SSD performance, power efficiency, and endurance\n- View your system information and hardware configuration, such as central processing unit (CPU), chipset, controller name, and driver versions\n- Run Secure Erase on a secondary Intel SSD\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-18T00:48:47Z", "galleryUrl": "https://community.chocolatey.org/packages/Intel.SSD.Toolbox/3.5.15.20210102", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Intel.SSD.Toolbox/3.5.15.20210102", "licenseUrl": "", "packageName": "Intel.SSD.Toolbox", "displayName": "[Deprecated] Intel SSD Toolbox", "summary": "SSD drive management software", "version": "3.5.15.20210102", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@2a0d1b78a421771353d15c06da4341ae2b325cda/icons/intel.ssd.toolbox.png", "author": "Intel", "downloadCount": 8583, "tags": ["intel", "ssd", "drive", "diag", "smart", "trim", "firmware"]}