{"description": "## Lighter & Cleaner PC\n\nNeed to uninstall programs and free up disk space? IObit Uninstaller is the one you can trust, no matter programs no longer being used, can’t being uninstalled through standard uninstallation or bundled with other programs. It also introduces an easy way to uninstall programs. You can quickly remove programs via desk icon, opened window or system tray icon.\n\n## Safer & Faster Browsing\n\nOnce malicious toolbar get to your computer they might take over your browsers by changing settings without permission. What’s worse, you would end up in privacy leaking and slow internet. IObit Uninstaller 8 Free lists all toolbars and marks out the malicious ones installed on main-stream browsers: Chrome, Firefox, IE, Opera, allowing you find and delete them quickly.\n\n## No Leftover Files\n\nRegular uninstall cannot delete programs completely. With IObit Uninstaller, you don’t need to worry about leftovers any more. IObit Uninstaller 8 removes leftovers automatically after uninstalling programs. Even those leftover files cannot be deleted by other uninstallers; you can still count on it.\n\n## Update Software Simply\n\nOutdated software is risky. Attacker can easy find weakness in it resulting whole system at danger. IObit Uninstaller 8 Free is there keeping over 60 critical programs up to date for you. You can easily update software via secure download links to the latest version on publishers’ websites.\n\n## Package parameters\n\n* `/NoDesktopIcon` - Don't add a desktop icon.\nExample: `choco install iobit-uninstaller --params \"/NoDesktopIcon\"`\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-23T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/iobit-uninstaller/13.4.0.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/iobit-uninstaller/13.4.0.2", "licenseUrl": "http://www.iobit.com/en/eula.php", "packageName": "iobit-uninstaller", "displayName": "IObit Uninstaller", "summary": "IObit Uninstaller Free; Scrub away Every Trace of Unwanted Programs, Plug-ins and Windows Apps", "version": "13.4.0.2", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@fa5af738fb52d32c4c8778f7ac39077787c4653e/icons/iobit-uninstaller.png", "author": "IObit", "downloadCount": 43814, "tags": ["iobit-uninstaller", "admin"]}