{"description": "The Quake 3 engine is open source. The Quake III: Arena game itself is not free. You must purchase the game to use the data and play Quake 3 with ioquake3. If you do not want to do that you can play another game made with ioquake3.\n##What is ioquake3?##\nioquake3 is a free software first person shooter engine based on the Quake 3: Arena and Quake 3: Team Arena source code. The source code is licensed under the GPL version 2, and was first released under that license by id software on August 20th, 2005. Since then, we have been cleaning it up, fixing bugs, and adding features. Our permanent goal is to create the open source Quake 3 distribution upon which people base their games, ports to new platforms, and other projects. We have developed the perfect version of the engine for playing Quake 3: Arena, Team Arena, and all popular mods on modern platforms like Linux, Windows 7, 8, and 10, Mac OS X Mavericks and  Mac OS X Yosemite.\n##What can I do with ioquake3?##\nYou can use it to play Quake 3: Arena, Quake 3: Team Arena, and the mods people have made for those games. See our Player’s Guide for instructions and help playing ioquake3, or our SysAdmin Guide to get started running your own game server.\n\nYou can make your own game from our source code in git on gibhub.\n\nOr play a game that other great teams using ioquake3 have made.", "updated": "2024-03-20T20:48:31Z", "galleryUrl": "https://community.chocolatey.org/packages/ioquake3/1.36", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ioquake3/1.36", "licenseUrl": "https://www.gnu.org/licenses/gpl-2.0.html", "packageName": "ioquake3", "displayName": "ioquake3", "summary": "ioquake3 is a free software first person shooter engine based on the Quake 3: Arena and Quake 3: Team Arena source code.", "version": "1.36", "icon": "https://cdn.rawgit.com/Link-Satonaka/chocopkgs/6d069b7b8b263dccfe12264343d48696975fe8db/ioquake3.png", "author": "ioquake3,  id-software", "downloadCount": 1276, "tags": ["ioquake3", "gaming", "quake3", "quake", "engine"]}