{"description": "With IPVanish, your internet traffic is routed through the secure server of your choosing. This helps protect your online identity and helps prevent advertisers, and network hackers from monitoring your activity.\n\n## Simplified data protection\n\nIt takes just one tap to defend your online data using our VPN app. Unite security and convenience through advanced settings that help protect your online activity automatically, so you don’t have to remember.\n\n## Powerful internet privacy\n\nOur anonymous IP addresses shield your internet traffic from third-party spying. Armor your Wi-Fi network connection, guard your location data, and keep your activity confidential with the best online privacy shield.\n\n## Use IPVanish on every device you own\n\nWhy sacrifice the protection of one device for another? We don’t meter simultaneous VPN connections or installations, so you’ll never have to choose.\n\n## Notes\n\n- The install and uninstall are not silent but are automated.\n- The IPVanish software is problematic to automate. Please have patience, and let the maintainer know if they change the installer and it stops working.\n- This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T20:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/ipvanish/4.2.5.294", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ipvanish/4.2.5.294", "licenseUrl": "https://www.ipvanish.com/tos/#6", "packageName": "ipvanish", "displayName": "IPVanish VPN (Install)", "summary": "With IPVanish, your internet traffic is routed through the secure server of your choosing. This helps protect your online identity and helps prevent advertisers, and network hackers from monitoring your activity.", "version": "4.2.5.294", "icon": "https://cdn.jsdelivr.net/gh/pauby/ChocoPackages@0422809/icons/ipvanish.png", "author": "IPVanish", "downloadCount": 3279, "tags": ["admin", "vpn", "security", "privacy", "notsilent"]}