{"description": "# JarFix\n\n![Logo](https://rawcdn.githack.com/kamack38/chocopkgs/master/assets/Jarfix.png)\n\n## The problem\n\nThe root cause for the problem above is, that a program has stolen the .jar association. If you have installed the Java Runtime Environment the first time, the file type called \"jar\" is assigned to javaw.exe correctly. \"jar\" is an abbreviation for \"java archive\" and javaw.exe is the correct program to execute a .jar. However, on Windows any program can steal a file type at any time even if it is already associated with a program. Many zip/unzip programs prefer to do this, because a jar is stored in the .zip format.  If you doubleclick on a .jar, your pack program opens the file, rather than javaw runs the program, because your pack program ignores the meta information which are also stored in a .jar. In the Oracle bug database there is the low-priority report 4912211 \"add mechanism to restore hijacked .jar and .jnlp file extensions\", but it has been closed as \"Closed, Will Not Fix\".\n\nYou may also miss the file connection with .jar if you are using a free OpenJDK without an installer.\n\n## The workaround\n\nReinstall the Java Runtime Environment or fix the Windows Registry manually each time this problem occurs.\n\n## The solution\n\nYou can fix this problem very easy with the small but reliable jarfix.exe program. Just doubleclick on it to restore the .jar association with javaw.exe.\n\n## Usage\n\nAfter installation you can use the package from the commandline (`jarfix.exe`)", "updated": "2024-03-14T16:19:03Z", "galleryUrl": "https://community.chocolatey.org/packages/jarfix/3.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/jarfix/3.0.0", "licenseUrl": "https://johann.loefflmann.net/downloads/jarfix-license.txt", "packageName": "jarfix", "displayName": "Jarfix", "summary": "If you doubleclick on a jar file, and your Java application does not start, your .jar association has been hijacked. You can fix the problem with Jarfix.", "version": "3.0.0", "icon": "https://rawcdn.githack.com/kamack38/chocopkgs/master/assets/Jarfix.png", "author": "Johann Nepomuk Löfflmann", "downloadCount": 351, "tags": ["java", "fix", "problem", "jar", "file"]}