{"description": "# [JASP](https://chocolatey.org/packages/jasp)\n\n## What is JASP?\n\nJASP is a fresh way to do statistics. Completely free, open-source, and cross-platform, JASP allows its users to conduct statistical analyses with ease, using a spreadsheet layout and a familiar drag-and-drop interface. JASP features popular classical analysis tools such as ANOVA and regression, but also contains their Bayesian counterparts.\n\n## Why use JASP?\n\nJASP offers many advantages over popular competing packages. Compared to commercial packages such as SPSS, JASP is free, open-source, actively developed, and includes Bayesian methods for parameter estimation and hypothesis testing. Compared to free packages such as R, JASP offers a smooth “drag and drop” user experience that removes the requirement of computer programming that many students and practitioners experience as burdensome and distracting. Compared to all other packages, the JASP base package off ers a targeted and popular series of tests, both in their classical and Bayesian manifestations.\n\n## Using and citing JASP in research\n\nJASP can be used for research just like one would use SPSS and R. We are completing a series of invited peer-reviewed articles that outline the main philosophy and basic functionality of JASP, and these articles may be cited whenever JASP is used for research. The current citation for the package itself is:\n\nThe JASP Team (2021). JASP (Version 0.14.1)[Computer software]. https://jasp-stats.org/.", "updated": "2024-03-19T16:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/jasp/0.14.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/jasp/0.14.1", "licenseUrl": "https://gnu.org/licenses/agpl.html", "packageName": "jasp", "displayName": "JASP", "summary": "JASP aims to be a complete statistical package for both Bayesian and Frequentist statistical methods, that is easy to use and familiar to users of SPSS.", "version": "0.14.1", "icon": "https://cdn.rawgit.com/adamblake/chocolatey-packages/master/jasp/icon.png", "author": "JASP", "downloadCount": 9025, "tags": ["jasp", "statistics", "spss", "r", "bayesian", "admin"]}