{"description": "JBMail runs on Windows 95, 98, ME, NT 4.0, 2000, XP. Although there is no direct Linux/UNIX support yet, JBMail runs nearly perfectly under Wine v20041201 (even with SSL/TLS connections).\n\nWho might want to use this software?\n\nROAD WARRIORS and MOBILE USERS who benefit from a streamlined mail client that leaves mail on the server and which doesn't force them to download all mail (saving time and bandwidth). The program itself is self-contained and portable, and does not require installation.\n\nSECURITY CONSCIOUS PROFESSIONALS who benefit from a clean, simple mail client that doesn't expose them to the security and privacy risks posed by HTML mail and script support. Attachments are decoded on demand only, ensuring that viruses are not automatically unleashed. HTML is never rendered, so advertisers can not track messages.\n\nUSERS OF REMOTE SERVICES who require a properly implemented, yet easy to use SSL/TLS client for encrypted POP3 and SMTP transactions. Encrypted mail access is becoming the standard for business, academic, and government mail services.\n\nI.T. PROFESSIONALS who receive an excessive volume of daily mail and need powerful filtering capabilities. With direct mailbox access on the server, users can quickly clean and take care of incoming mail to reduce or even eliminate local mail storage. Easy access to multiple profiles makes managing many accounts easy.\n\nSUMMARY\n \nLatest version:\nJBMail Plus 3.3 beta3a (2005-05-10)\n \nLast official release:\nJBMail 3.2 (2003-05-21)\n \nPlatform:\n32-bit Windows\n \nLicense:\nFree license for beta version\nJBMail Plus is now free!\n \nDownload:\nJBMail Plus 3.3 beta3a (ZIP)\n \nFeatures\n\n\nNew in version 3.3 beta3a\n\nUpdated OpenSSL libraries. The latest JBMail Plus package includes OpenSSL 1.0.1e (2013-02-11) for better security.\n\nPGP, via external GnuPG software. Once all keys are setup in GnuPG, the composer allows you to sign and encrypt emails, or decrypt and verify signatures. There is no key management in JBMail.\n\nVarious user interface enhancements. Composer can now auto-complete addresses; partial support of mailto: URLs; file associations for .JBM (stored emails viewable in JBMail); search feature in address book.\n\n\nCore features\n\nSecurity and Privacy. JBMail uses smart technology choices to eliminate the security and privacy hazards found in other mail clients, without sacrificing interoperability. For instance, HTML is stripped to plain text and not rendered.\n\nFull SSL/TLS support. Secure Sockets Layer and Transport Layer Security use state-of-the-art encryption to protect POP3 and SMTP communications from eavesdropping and spoofing. Provided by the industry standard OpenSSL.\n\nVirus protection. Multiple levels of defense against viruses, worms and trojans. Safety features include a file block list and executable file SanityCheck.\n\nJunk mail filtering. JBMail includes powerful junk/spam filtering capabilities, including whitelist and blacklist, heuristic custom filters, and even header pattern matching.\n\nPortability. Fits on a floppy disk; no install required. No local mail storage, and no registry keys created. Messages can be viewed and saved/archived in plain text format to guarantee cross-client and cross-platform compatibility.\n\nEfficiency. Header-based POP3 access lets you read and delete mail directly on server without downloading everything. Light-weight software is nimble even on old computers!\n\nSupports POP3 and SMTP; MIME; base64 and UUencoded attachments; ISO-8859-1 (Latin1) Western European characters; and many other standard features.\n\nOnly in JBMail Plus: Ability to save multiple profiles and message flags/states. Mail is still kept on the server.", "updated": "2024-03-23T13:33:26Z", "galleryUrl": "https://community.chocolatey.org/packages/jbmail.portable/3.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/jbmail.portable/3.3", "licenseUrl": "http://www.pc-tools.net/privacy.html", "packageName": "jbmail.portable", "displayName": "JBMail (Portable)", "summary": "JBMail is a compact and portable secure e-mail client. The software has been designed for simplicity, security and \"on-line mailbox access\" meaning that mail is manipulated remotely and NOT stored locally. JBMail supports POP3, SMTP, SSL/TLS and all essential mail client features - but it is not \"just another\" mail client.", "version": "3.3", "icon": "https://rawcdn.githack.com/boubou/chocolatey/204cb3e4a1139bba210489097b0aaaccdc9b182d/packages/icons/jbmail.png", "author": "Jem Berkes", "downloadCount": 144, "tags": ["mail", "email", "smtp", "test"]}