{"description": "![Screenshot of Jellyfin](https://cdn.statically.io/gh/eugbaranov/chocolatey-packages/master/jellyfin/screenshot.png)\n\n### What is Jellyfin?\nJellyfin enables you to collect, manage, and stream your media. Run the Jellyfin server on your system and gain access to the leading free-software entertainment system, bells _and_ whistles included.\n\n### Movies\nHold your entire movie collection, with a beautiful collection of posters.\n\n### TV Shows\nCollect your TV Shows, and have them automatically organized by season.\n\n### Music\nEnjoy your own music collection. Make playlists, and listen on the go.\n\n### Live TV & DVR\nWatch Live TV and set automatic recordings to expand your media library.\n\n### Your media, for wherever you are.\nJellyfin lets you watch your media from a web browser on your computer, apps on your Android, iOS (including AirPlay), Android TV, or Fire TV device, or via your Chromecast or existing Kodi installation. And clients for Roku and other platforms are on the way.\n\n### It's your data.\nJellyfin has no tracking, phone-home, or central servers collecting your data. We believe in keeping our software open and transparent, and anything we might collect (crash logs, etc.) is opt-in only. We're also not in the media business, so the only media you see is your own.\n\n### Yes, it really costs nothing.\nThe Jellyfin server and clients are free to download, now and always. There are no costs, hidden or otherwise, to use Jellyfin, either for yourself, for your friends, or for your company. All our incidental costs are paid through donations from users like you.\n\n### Software freedom is important.\nJellyfin is Free Software, licensed under the GNU GPL. You can use it, study it, modify it, build it, and distribute it for free, as long as your changes are licensed the same way.\n\nThe project is community-built, relying entirely on contributions from volunteers to improve. Want to help out? There's lots of ways to do so, and you don't even have to code! See our Contribution Guide for more details.", "updated": "2024-03-23T20:18:26Z", "galleryUrl": "https://community.chocolatey.org/packages/jellyfin/10.8.13", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/jellyfin/10.8.13", "licenseUrl": "https://github.com/jellyfin/jellyfin/blob/master/LICENSE", "packageName": "jellyfin", "displayName": "Jellyfin (Install)", "summary": "Jellyfin - The Free Software Media System", "version": "10.8.13", "icon": "https://cdn.statically.io/gh/eugbaranov/chocolatey-packages/master/jellyfin/icon.png", "author": "The Jellyfin Project", "downloadCount": 11279, "tags": ["jellyfin", "emby", "media", "server", "streaming", "video", "music", "photos", "tv", "dlna", "foss", "cross-platform", "binary"]}