{"description": "## JetBrains YouTrack\n\nThe issue tracker designed for agile software teams\n\n### ALL IN ONE\n\nA project management tool that can be adapted to your processes to help you deliver great products. Track tasks and bugs, plan sprints and releases, create workflows, and customize YouTrack for your business processes. Never force your process to fit the limits of a tool again. Unlike other issue trackers, YouTrack can be customized to your needs!\n\n### Be Agile\n\n#### Agile Boards\n\nYouTrack lets you configure an Agile Board for any process you can dream up. Use the Agile boards to support you with your Scrum, Kanban, and mixed processes.\n\nBe Agile your way - create boards with multiple projects, add swimlanes based on user stories, epics, deadlines, or any other fields. See the changes that are applied to the board or in the backlog in real time.\n\n#### Planning\n\nPlan the future of your project development with the flexible backlog. Create user stories, feature requests and tasks. Don’t switch between tabs - open the backlog right from the board, edit it and move issues to the sprint.\n\n### Monitor the progress of your product\n\n#### Reports\n\nKeep track of your project, team, and personal progress using dozens of predefined reports. See how your issues are distributed over the projects, assignees, and priorities. Check on how you are progressing over time using the timeline reports. Track the estimated and the actual time spent on various activities.\n\n#### Dashboards\n\nGet an overview of your projects using multiple dashboards and share them with your team. Place reports, markdown notes, and issue lists as widgets or create your own widgets if you're in need of more data!\n\n#### Time Management\n\nUse time management on a per project basis to control the estimated and actual time spent on various activities by each team member and over the whole team. Create time reports and share them with the stakeholders and customers. Plan ahead with your project activities using a Gantt Chart and track your progress as you go, making sure you stay on schedule.\n\n### Bring IDE-style intelligence to your issue tracking\n\n#### Smart search\n\nNever get lost in your issues! Find things quickly using the smart search with auto-completion.\nFor example, `#YouTrack -{Board YouTrack} #unresolved assigned to: me sort by: priority` will find you the unresolved issues that are not on the board assigned to you and will sort the results based on priority. See, how intuitive!\n\n#### Commands and shortcuts\n\nModify multiple issues quickly and efficiently using commands. Speed up your routine operations using shortcuts just like you would in your favorite IDE. Save time and stay focused on what's important.\n\n### Import your projects, users, and issues from Jira and other trackers\n\nMove from [Jira](https://www.jetbrains.com/help/youtrack/standalone/importing-from-jira.html) to YouTrack with one click! Using other trackers? [Check out](https://www.jetbrains.com/help/youtrack/standalone/Migrating-to-YouTrack.html) all the migration options.\nMove to YouTrack and get 25% discount off for any commercial plan!\n\n#### Payed software\n\nThis software is free to use for teams up to ten (10) users, for larger teams a [license](https://www.jetbrains.com/youtrack/buy/#edition=standalone) from JetBrains is required.\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-23T09:48:54Z", "galleryUrl": "https://community.chocolatey.org/packages/jetbrains-youtrack/2023.1.18508", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/jetbrains-youtrack/2023.1.18508", "licenseUrl": "https://www.jetbrains.com/store/license.html", "packageName": "jetbrains-youtrack", "displayName": "JetBrains YouTrack", "summary": "JetBrains YouTrack - The issue tracker designed for agile software teams", "version": "2023.1.18508", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@17ecf9871387731a8fc960d008cf2786efd83f6e/icons/jetbrains-youtrack.png", "author": "JetBrains", "downloadCount": 15880, "tags": ["jetbrains-youtrack", "jetbrains", "youtrack", "admin"]}