{"description": "Jubler is a tool to edit text-based subtitles. It can be used as an authoring software for new subtitles or as a tool to convert, transform, correct and refine existing subtitles. The most popular subtitle formats can be used. Preview of the subtitles in realtime or in design time, spell checking, translation mode and styles editing are some of the main features.\n\n### Features\n* It supports Advanced SubStation, SubStation Alpha, SubRip, SubViewer (1 and 2), MicroDVD, MPL2 and Spruce DVD Meastro file formats, although it is easy to extend it to support other file types.\n* All encodings supported by Java platform are also supported here (like UTF-8). The user is able to select a list of preferred encodings in order to load the localized subtitle files.\n* GUI internationalization support through gettext utilities.\n* Styles are supported (when saving in SubStation formats). These styles are specific per subtitle or per character.\n* Translating mode (parent & child editors) is supported\n* Graphical preview of subtitles using the FFMPEG library. Current frame, waveform preview and waveform listening is supported.\n* Graphical display of subtitles, which can be moved and resized.\n* Test and play the subtitles file using a video player (mplayer). While in playing mode the user is able to freely edit the subtitles (and inform the player of this change), add a new subtitle in real time or synchonize subtitles with the movie.\n* Mark subtitles with different colors, either when editing or real time when playing the video.\n* Spell checking, with support for dictionary selection.\n* Easy installation for Mac, Linux & Windows platforms and a generic installer for all other platforms (without FFMPEG support).\n* Auto update application.\n\n### Key editing features\n* Editing individual subtitles\n* Splitting\n* Joining\n* Time shifting\n* Frame rate conversion automatically, by user request or using a free user factor\n* Fixing time inconsistencies such as overlapping with an optimization algorithm\n* Undo & redo\n* Cut, copy, paste, delete areas according to time & color patterns\n* Clear areas used for hearing impaired", "updated": "2024-03-22T15:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/jubler/7.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/jubler/7.0.0", "licenseUrl": "https://github.com/teras/Jubler/blob/master/LICENCE", "packageName": "jubler", "displayName": "Jubler Subtitle Editor", "summary": "Jubler is a tool to edit text-based subtitles.", "version": "7.0.0", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-coreteampackages@a8fa14d8c3ca49fd8bd8f856d9091b1a9103ada1/icons/jubler.png", "author": "Panayotis Katsaloulis", "downloadCount": 3357, "tags": ["jubler", "admin", "subtitle", "editor", "video"]}