{"description": "JuiceFS is a high-performance POSIX file system released under Apache License 2.0, particularly designed for the cloud-native environment. The data, stored via JuiceFS, will be persisted in object storage (e.g. Amazon S3), and the corresponding metadata can be persisted in various database engines such as Redis, MySQL, and TiKV based on the scenarios and requirements.\n\nWith JuiceFS, massive cloud storage can be directly connected to big data, machine learning, artificial intelligence, and various application platforms in production environments. Without modifying code, the massive cloud storage can be used as efficiently as local storage.\n\n![JuiceFS Logo](https://github.com/juicedata/juicefs/raw/main/docs/en/images/juicefs-logo-new.svg?raw=true)\n\n## Features\n\n- Fully POSIX-compatible: Use as a local file system, seamlessly docking with existing applications without breaking business workflow.\n- Fully Hadoop-compatible: JuiceFS' Hadoop Java SDK is compatible with Hadoop 2.x and Hadoop 3.x as well as a variety of components in the Hadoop ecosystems.\n- S3-compatible: JuiceFS' S3 Gateway provides an S3-compatible interface.\n- Cloud Native: A Kubernetes CSI Driver is provided for easily using JuiceFS in Kubernetes.\n- Shareable: JuiceFS is a shared file storage that can be read and written by thousands of clients.\n- Strong Consistency: The confirmed modification will be immediately visible on all the servers mounted with the same file system.\n- Outstanding Performance: The latency can be as low as a few milliseconds, and the throughput can be expanded nearly unlimitedly (depending on the size of the object storage). Test results\n- Data Encryption: Supports data encryption in transit and at rest (please refer to the guide for more information).\n- Global File Locks: JuiceFS supports both BSD locks (flock) and POSIX record locks (fcntl).\n- Data Compression: JuiceFS supports LZ4 or Zstandard to compress all your data.", "updated": "2024-03-12T12:18:21Z", "galleryUrl": "https://community.chocolatey.org/packages/juicefs/1.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/juicefs/1.1.0", "licenseUrl": "https://github.com/juicedata/juicefs/blob/main/LICENSE", "packageName": "juicefs", "displayName": "JuiceFS", "summary": "A distributed POSIX file system built on top of Redis and S3.", "version": "1.1.0", "icon": "https://static1.juicefs.com/images/avatar-light.png", "author": "Juicedata", "downloadCount": 104, "tags": ["juicefs", "file-system", "cloud"]}