{"description": "[Julia](https://julialang.org/) is a high-level, high-performance dynamic programming language for technical computing, with syntax that is familiar to users of other technical computing environments. It provides a sophisticated compiler, distributed parallel execution, numerical accuracy, and an extensive mathematical function library. The library, largely written in Julia itself, also integrates mature, best-of-breed C and Fortran libraries for linear algebra, random number generation, signal processing, and string processing. In addition, the Julia developer community is contributing a number of external packages through Julia’s built-in package manager at a rapid pace. IJulia, a collaboration between the IPython and Julia communities, provides a powerful browser-based graphical notebook interface to Julia.\n\n## Features\n\n- Multiple dispatch: providing ability to define function behavior across many combinations of argument types\n- Dynamic type system: types for documentation, optimization, and dispatch\n- Good performance, approaching that of statically-typed languages like C\n- A built-in package manager\n- Lisp-like macros and other metaprogramming facilities\n- Call Python functions: use the PyCall package[a]\n- Call C functions directly: no wrappers or special APIs\n- Powerful shell-like abilities to manage other processes\n- Designed for parallel and distributed computing\n- Coroutines: lightweight green threading\n- User-defined types are as fast and compact as built-ins\n- Automatic generation of efficient, specialized code for different argument types\n- Elegant and extensible conversions and promotions for numeric and other types\n- Efficient support for Unicode, including but not limited to UTF-8", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/Julia/1.10.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Julia/1.10.2", "licenseUrl": "https://github.com/JuliaLang/julia/blob/master/LICENSE.md", "packageName": "Julia", "displayName": "Julia programming language", "summary": "The Julia Language: A fresh approach to technical computing.", "version": "1.10.2", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@b6cf0f7f72e8e037e6aa1e7ca15ec35a492f959f/icons/julia.png", "author": "Jeff Bezanson,  Alan Edelman,  Stefan Karpinski,  Viral B. Shah,  Julia contributors", "downloadCount": 112883, "tags": ["julia", "language", "scientific", "computing", "dynamic", "programming", "repl", "data", "visualization", "machine", "learning", "jit", "admin", "foss", "cross-platform"]}