{"description": "![Screenshot of Just Read for Chrome](https://lh3.googleusercontent.com/tGWmdYSGdfZTVeMMPZy0NhL0gac55-dDCu8l79zMuV1T1AcF86TUSBc8RR4G8LT2sAjrUKqusA=w640-h400-e365)\t\n\n###A customizable reader extension.\n\nWith one click (or less!), you can remove distractions like:\n* The page's styling\n* Ads\n* Popups\n* Comments\n\nAnd read the article in a customizable, simplified format - like a read mode but better! No login and completely free!\n\nUsers can:\n* Use the default theme\n* Modify the default theme using a graphical editor or CSS\n* Use a theme someone else has made (found at https://goo.gl/Z59SM4 )\n* Use their very own custom styling\n* Auto-run Just Read format on specific sites\n* Auto-enable fullscreen when Just Read is started\n* Use a keyboard shortcut to run Just Read\n* Print the custom-styled version of the article\n* Use the selection mode to choose exactly which text they want to select for reading\n* Use the deletion mode to remove any unwanted content after selection\n* Edit incorrect meta information generated\n* Control which options Just Read uses\n\nJust Read is a feature-packed and more customizable alternative to the now-defunct Clearly extension, working like a specialized reader view, and includes support for special needs like MathJax and right to left languages.\n\nJust Read collects no data from any user, so you have nothing to worry about in terms of privacy.\n\nJust Read is completely open source and can be found on GitHub here https://github.com/ZachSaucier/Just-Read\n\nPlease read the README in the GitHub link above for more details about Just Read!\n\t\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/justread-chrome/readme.md)**", "updated": "2024-03-22T13:33:44Z", "galleryUrl": "https://community.chocolatey.org/packages/justread-chrome/1.1.12", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/justread-chrome/1.1.12", "licenseUrl": "", "packageName": "justread-chrome", "displayName": "Just Read for Chrome", "summary": "Just Read - The extension makes it easy to view web articles in a more readable, attractive, and custom format - like a read mode, but better. It removes the distractions like ads, modals, and navigation from vision, letting the user just read the content.", "version": "1.1.12", "icon": "https://lh3.googleusercontent.com/WseKDCOtXlDKnrLFlN1VOHnaiFMElSarvvEAScNmERP5RYxvq8rEFTSRNJ0_PoaqUMYcNi1W=w26-h26-e365", "author": "Zach Saucier", "downloadCount": 743, "tags": ["just", "read", "zachsaucier", "reader", "chrome", "extension"]}