{"description": "## k3sup -  k3sup is a light-weight utility to get from zero to KUBECONFIG with k3s on any local or remote VM.\n\nThis tool uses ssh to install k3s to a remote Linux host. First, k3s is installed using the utility script from Rancher, along with a flag for your host's public IP so that TLS works properly. The kubeconfig file on the server is then fetched and updated so that you can connect from your laptop using kubectl. You can also use it to join existing Linux hosts into a k3s cluster as agents.\n\nYou may wonder why a tool like this needs to exist when you can do this sort of thing with bash.\n\nk3sup was developed to automate what can be a very manual and confusing process for many developers, who are already short on time. Once you've provisioned a VM with your favourite tooling, k3sup means you are only 60 seconds away from running kubectl get pods on your own computer. If you are a local computer, you can bypass SSH with k3sup install --local\n\nThe tool is written in Go and is cross-compiled for Linux, Windows, MacOS and even on Raspberry Pi.\n\nHow do you say it? Ketchup, as in tomato\n\nWebsite: https://k3sup.dev/\n\n**Please Note**: This is an automatically updated package. If you find it is out of date by more than a day or two please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-20T06:48:34Z", "galleryUrl": "https://community.chocolatey.org/packages/k3sup/0.13.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/k3sup/0.13.5", "licenseUrl": "https://github.com/alexellis/k3sup/blob/master/LICENSE", "packageName": "k3sup", "displayName": "k3sup (Latest)", "summary": "arkade - The Open Source Kubernetes Marketplace", "version": "0.13.5", "icon": "https://rawcdn.githack.com/erwinkersten/chocolatey-packages/dea0cda1d84446a68a6dfdfefe362d1a9ad0de85/icons/k3sup.png", "author": "alexellis", "downloadCount": 1558, "tags": ["k3sup", "k3s", "kubernetes", "k8s", "rancher", "automation", "ssh", "kubectl"]}