{"description": "KDE Connect is a multi-platform app that allows your devices to communicate (eg: your phone and your computer).\n\n## (Some) Features\n- **Shared clipboard**: copy and paste between your phone and your computer (or any other device).\n- **Notification sync**: Read and reply to your Android notifications from the desktop.\n- **Share files and URLs** instantly from one device to another including some filesystem integration.\n- **Multimedia remote control**: Use your phone as a remote for Linux media players.\n- **Virtual touchpad**: Use your phone screen as your computer's touchpad and keyboard.\n- **Presentation remote**: Advance your presentation slides straight from your phone.\n\nAll this is done completely wirelessly, utilising TLS encryption.\n\n## How does it work?\nKDE Connect consists of a UI-agnostic \"core\" library that exposes a series of DBus interfaces, and several UI components that consume these DBus interfaces. This way, new UI components can be added to integrate better with specific platforms or desktops, without having to reimplement the protocol or any of the internals. The core KDE Connect library is also divided into 4 big blocks:\n\n- **LinkProviders**: Are in charge of discovering other KDE Connect-enabled devices in the network and establishing a Link to them.\n- **Devices**: Represent a remote device, abstracting the specific Link that is being used to reach it.\n- **NetworkPackets**: JSON-serializable and self-contained pieces of information to be sent by the plugins between devices.\n- **Plugins**: Independent pieces of code that implement a specific feature. Plugins will use NetworkPackets to exchange information through the network with other Plugins on a remote Device.\n\n## Contributing\n\nTo contribute patches, use [KDE Connect's GitLab](https://invent.kde.org/kde/kdeconnect-kde). There you can also find a task list with stuff to do and links to other relevant resources. It is a good idea to also subscribe to the [KDE Connect mailing list](https://mail.kde.org/mailman/listinfo/kdeconnect). We can also be reached on IRC at #kdeconnect on freenode or on [telegram](https://t.me/joinchat/AOS6gA37orb2dZCLhqbZjg), contributions and feedback are warmly welcomed.\n\nPlease know that all translations for all KDE apps are handled by the [localization team](https://l10n.kde.org/). If you would like to submit a translation, that should be done by working with the proper team for that language.\n\n## License\n[GNU GPL v2](https://www.gnu.org/licenses/gpl-2.0.html) and [GNU GPL v3](https://www.gnu.org/licenses/gpl-3.0.html)\n\nIf you are reading this from Github, you should know that this is just a mirror of the [KDE Project repo](https://invent.kde.org/network/kdeconnect-kde).", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/kdeconnect-kde/23.04.0.1337", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/kdeconnect-kde/23.04.0.1337", "licenseUrl": "https://invent.kde.org/network/kdeconnect-kde/-/tree/master/LICENSES", "packageName": "kdeconnect-kde", "displayName": "KDE Connect", "summary": "KDE Connect is a multi-platform app that allows your devices to communicate (eg: your phone and your computer).", "version": "23.04.0.1337", "icon": "https://cdn.jsdelivr.net/gh/AndreAugustoAAQ/chocolatey-packages/kdeconnect-kde/kdeconnect.png", "author": "KDE e.V.", "downloadCount": 89512, "tags": ["kde", "kdeconnect", "windows", "communications", "tools"]}