{"description": "KeeAgent is a plugin for KeePass 2.x. It allows other programs to access SSH keys stored in your KeePass database for authentication. It can either act as a stand-alone agent or it can interface with an external agent.\n\n* Store your SSH private keys in your KeePass 2.x database and use KeePass as your SSH agent (replaces Pageant on Windows).\n* Keys can be configured to automatically load when a KeePass database is opened and unload when the database is closed/locked.\n* Cross-platform: work on Windows/Linux/Mac.\n* Supports both PuTTY and OpenSSH private key formats, (new in Beta v0.7.0, includes the “new” OpenSSH key format introduced in OpenSSH 6.5).\n* Supports SSH1 and SSH2 keys.\n* SSH2 key formats include RSA, DSA and ECDSA (new in Beta v0.7.0, includes Ed25519 support).\n* Works with both PuTTY (and PuTTY compatible programs) and Cygwin/Msys on Windows.\n* Works with native SSH agent on Linux/Mac.\n\n**NOTE**: This package will not install unless you have either `keepass`, `keepass.install` or `keepass.portable` installed.\n**NOTE**: This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T15:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/keepass-plugin-keeagent/0.13.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/keepass-plugin-keeagent/0.13.6", "licenseUrl": "https://github.com/dlech/KeeAgent/blob/master/LICENSE.txt", "packageName": "keepass-plugin-keeagent", "displayName": "KeePass Plugin KeeAgent", "summary": "Allow SSH keys stored in a KeePass database to be used for SSH authentication by other programs", "version": "0.13.6", "icon": "https://cdn.jsdelivr.net/gh/pauby/ChocoPackages@4d273685/icons/keepass-plugin-keeagent.png", "author": "David Lechner", "downloadCount": 35431, "tags": ["keepass", "plugin", "ssh", "authentication", "admin"]}