{"description": "KeePassXC is a modern, secure, and open-source password manager that stores and manages your most sensitive information.\nYou can run KeePassXC on Windows, macOS, and Linux systems.\nKeePassXC is for people with extremely high demands of secure personal data management.\nIt saves many different types of information, such as usernames, passwords, URLs, attachments, and notes in an offline, encrypted file that can be stored in any location, including private and public cloud solutions.\nFor easy identification and management, user-defined titles and icons can be specified for entries.\nIn addition, entries are sorted into customizable groups.\nAn integrated search function allows you to use advanced patterns to easily find any entry in your database.\nA customizable, fast, and easy-to-use password generator utility allows you to create passwords with any combination of characters or easy to remember passphrases.\n\nNote:\n> The latest versions of KeePassXC have stopped working on legacy Windows versions, like Windows 7 and 8.1. The developers graciously release a separate legacy version of the Windows installer. This Chocolatey package should exist side-by-side the keepassxc package. Maybe with an explicit note in the description that it is the one to be installed on Windows 8.1 and below.", "updated": "2024-03-23T20:33:47Z", "galleryUrl": "https://community.chocolatey.org/packages/keepassxc-legacy/2.7.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/keepassxc-legacy/2.7.7", "licenseUrl": "https://github.com/keepassxreboot/keepassxc/blob/develop/LICENSE.LGPL-3", "packageName": "keepassxc-legacy", "displayName": "KeePassXC Legacy", "summary": "KeePassXC is a cross-platform community-driven port of the Windows application “Keepass Password Safe”.", "version": "2.7.7", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@4315dbe8325d644de2026206bdc5c16a11c1f5cc/icons/keepassxc.svg", "author": "KeePassXC", "downloadCount": 1096, "tags": ["windows", "macos", "linux", "security", "privacy", "cross-platform", "password-manager", "yubikey", "password", "keepass", "hacktoberfest", "keepassxc"]}