{"description": "KeePass 2.x plugin to check all entries with URLs against various breach lists.\n\n## Currently Supported Breach Lists\n\n### Site/Domain based\n\n* Have I Been Pwned (HIBP) - Checks the domains of any entries against the Have I Been Pwned? list curated by Troy Hunt.\n* Cloudbleed vulnerability list - Checks the domains of any entries that appear in the Cloudbleed vulnerability list. This has potential to produce false positives due to the way this list was produced.\n\n### Username based\n\n* Have I Been Pwned (HIBP) - Checks the usernames of any entries against the Have I Been Pwned? list curated by (Troy Hunt)[https://www.troyhunt.com/]. This service requires you to register for an API key via https://haveibeenpwned.com/API/Key . The cost of API key is $3.50 per month (Credit card required).\n\n### Password based\n\n* Have I Been Pwned (HIBP) - Checks the passwords of any entries against the Have I Been Pwned? list curated by Troy Hunt.\n\nThis checker sends a small portion of the password hash to HIBP and then checks the full hash locally against the list of hashes returned by HIBP. This service does not send your password, nor enough of the hash to expose your password to HIBP.\n\n**NOTE**: This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-22T05:03:29Z", "galleryUrl": "https://community.chocolatey.org/packages/keepass-plugin-haveibeenpwned/1.3.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/keepass-plugin-haveibeenpwned/1.3.6", "licenseUrl": "https://github.com/andrew-schofield/keepass2-haveibeenpwned/blob/master/LICENSE", "packageName": "keepass-plugin-haveibeenpwned", "displayName": "KeePass Plugin Have I Been Pwned", "summary": "KeePass 2.x plugin to check all entries with URLs against various breach lists.", "version": "1.3.6", "icon": "", "author": "Andrew Schofield", "downloadCount": 1159, "tags": ["keepass", "plugin", "password", "hacked"]}