{"description": "The Readable Passphrase Generator generates passphrases which are (mostly) grammatically correct but nonsensical. These are easy to remember (for humans) but difficult to guess (for humans and computers).\n\n## Why use it?\n\nBecause you can make passphrases which are as strong as traditional \"strong\" passwords (8 letters long, upper, lower, numbers, etc) which you can memorise in 5 minutes instead of 5 days. (And its fun to read the phrases it generates!)\n\nUse this passphrase to protect:\n\n* Your KeePass, 1Password, LastPass or favourite password manager database.\n* You computer login at home or work.\n* Your eBay, Facebook, Google, OpenID or other high value account.\n* Your Internet banking account.\n\nSome examples passphrases:\n\n* a wound rebuffs an incline\n* the statesman will burgle amidst lucid sunlamps\n* plaid foresails repel ashamedly upon the birdbath\n* 234 readers affably build the untouched athlete\n* Sydney reasoned \"an edible sleeve fumbles the argumentative float\"\n\nWe're told the best password is at least 8 characters 12 characters long, contains upper and lower case letters, numbers and punctuation symbols. Unfortunately, this makes the \"best\" password something which looks like gibberish and is, frankly, quite hard for ordinary people to remember.\n\nPerhaps something like: 3h4o.%\\vJACj\n\nI used to generate 12-16 character passwords like this and memorise them. It would commonly take up to two weeks of typing them in multiple times per day. All told, I've memorised perhaps 10 of these in my life. They get used for my KeePass database, Windows logons (at work and home) and Truecrypt volume, but nothing else because I can't afford to memorise any more (lest I memorise a password and my address falls out of my brain!).\n\nThat is all too hard!\n\nSo we resort to taking a some word from the dictionary, capitalise a few letters, turn an o into a 0 and stick some punctuation at the end: like our friend Tr0ubador. Only problem is, while that is easy to remember (well, easier according to XKCD), its also trivially easy for a computer to guess.\n\nI memorised the statesman will burgle amidst lucid sunlamps after typing it twice. And, even if some evil hacker knows my dictionary (which it will, because its included with this project), that passphrase is still equivalent to an 11 letter password with upper, lower, numbers and symbols (using the 13k word dictionary from version 0.13).\n\nMuch, much easier, I think. (So does my wife!)\n\n**NOTE**: This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T19:33:31Z", "galleryUrl": "https://community.chocolatey.org/packages/keepass-plugin-readablepassphrasegen/1.4.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/keepass-plugin-readablepassphrasegen/1.4.0", "licenseUrl": "https://github.com/ligos/readablepassphrasegenerator/blob/master/LICENSE.txt", "packageName": "keepass-plugin-readablepassphrasegen", "displayName": "KeePass Plugin Readable Passphrase Generator", "summary": "The Readable Passphrase Generator generates passphrases which are (mostly) grammatically correct but nonsensical. These are easy to remember (for humans) but difficult to guess (for humans and computers).", "version": "1.4.0", "icon": "", "author": "Murray Grant", "downloadCount": 4367, "tags": ["keepass", "plugin", "password", "generator", "admin"]}