{"description": "Free cross-platform password manager compatible with KeePass.\n\nThis webapp is a browser and desktop password manager compatible with KeePass databases. It is written using electronjs and doesn't require any server or additional resources. The app can run either in browser, or as a desktop app.\n\n## Features\n\n* Desktop apps for all platforms: Desktop apps look beautiful on each platform: macOS, Windows and Linux. You can open local files in Desktop apps.\n* Themes: Switch between dark and light theme, whichever you like more.\n* Color favorites: Mark items with color and easily find them using Colors tab.\n* Multiple files support: Open several files, search any entry or view all items from all files as one list.\n* One search for all files: Search works for all files, everything is done from one search box.\n* Dropbox sync: Open files from Dropbox, sync changes across devices automatically.\n* Easy tags input: Add tags to arrange entries. Quickly select them in the list or add new ones.\n* Drag&Drop: Drop entry attachments and database files right to the app.\n* Protected fields: Fields can be hidden when you need it. Also they will be stored in memory in more secure way than usual fields.\n* Password generator: Generate passwords of any desired length, with only symbols you want.\n* Offline access: Files are saved for offline use, even those opened from Dropbox. You can always access offline version, changes will be synced automatically when you are online again.\n* Shortcuts: Access actions faster with shortcuts.\n* Advanced search options: Refine search by specifying fields, searching passwords, history and using powerful regular expressions syntax.\n* History: All changes you make are put to history. You can rollback to any state or delete the state completely.\n* Entry icons: Select an icon from the set of predefined high-res icons, download website favicon or use your own icons.\n* Table view: Switch between list and table layout.\n* Inline image viewer: Attach images to entries and click to view.\n* Open-source: The app is completely free: no trials, no demo versions, no limits. There's no catch. Even more: you can always build it from sources yourself. The source code is available on GitHub.\n\n## Notes\n\n- This application comes with a built-in updater tool.\n\n![KeeWeb screenshot](https://cdn.rawgit.com/chocolatey/chocolatey-coreteampackages/16fba2c634c149d29f0d1b1ff2a79212521bb007/automatic/keeweb/screenshot.png)", "updated": "2024-03-20T16:33:26Z", "galleryUrl": "https://community.chocolatey.org/packages/keeweb/1.18.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/keeweb/1.18.6", "licenseUrl": "https://github.com/keeweb/keeweb/blob/master/LICENSE", "packageName": "keeweb", "displayName": "KeeWeb", "summary": "Free cross-platform password manager compatible with KeePass", "version": "1.18.6", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-coreteampackages@88bbbf93f61ceb6787fbdf191a9542dddfcb2c2c/icons/keeweb.png", "author": "antelle", "downloadCount": 28658, "tags": ["keeweb", "keypass", "password", "admin", "foss", "cross-platform"]}