{"description": "Keyferret is a simple way to type characters that you don't normally find on your keyboard, in any Windows application, using the Right Alt (AltGr) key. For example:\n\n- à: Type a, then RAlt+\\`\n- œ: Type RAlt+oe\n- þ (thorn): Type RAlt+t\n- – (en dash) : Type RAlt+-\n- ½: Type RAlt+1/2\n- ²: Type 2, then RAlt++\n- ≠: Type =, then RAlt+/\n- 𝑥: Type x, then RAlt+\\i\n- ⊈: Type RAlt+<s=/\n- ∰: Type RAlt+=SSSo\n\n## Features\n\n- It's free.\n- Works in any program (unless it's running under elevated security, such as an installer).\n- Interactive help: hold RAlt and it'll show you what you're inserting, or what to press to get related characters. No searching through keystroke tables, just follow the hints as to what to press next.\n- You can undo keypresses as you explore the characters available by pressing RAlt+<Backspace>.\n- Intuitively enter all characters required by any language using the Latin alphabet (used for most Western languages) all from a single layout.\n- Symbols for currencies, dashes, proper quotes, maths, arrows, subscripts/superscripts, ringed letters and numbers, and much more.\n- Implements quickly selectable alternate layouts for entering IPA (International Phonetic Alphabet) characters, Greek, and Cyrillic text, including historical and rare characters.\n- The help includes information on each character from the official Unicode database, giving its name, grouping, and (where relevant) information about how the character should be used.\n- If you don't press RAlt, your keyboard works just as before – plays nicely with other programs.\n- Access the full power of Unicode combining characters, which enable diacritics to be placed on any character – particularly useful for medieval sequences such as oͤ.\n- Designed for US and UK keyboards (where the RAlt key can be safely remapped).\n- If you're up for it, you can edit the layout file to add other layouts, symbols and characters (probably necessary if you want to support non US/UK keyboards).\n- Takes advantage of the improved Unicode font support in Windows 10, supporting nearly every character Windows can display that is (according to Unicode) based on the Latin, Cyrillic and Greek alphabets.\n- Enables typing of all characters defined by MUFI (the Medieval Unicode Font Initiative) version 4.0 that are adopted by Unicode. In order to some of them (primarily combining forms of Latin scribal abbreviations) you will need to install the Junicode font.\n- Can be natively installed or run as a no-install utility (for example if you don't have administrator privileges).", "updated": "2024-03-21T05:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/keyferret/2.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/keyferret/2.6", "licenseUrl": "", "packageName": "keyferret", "displayName": "Keyferret", "summary": "Intuitive Unicode keyboard input. Type accents, symbols, maths, Cyrillic, Greek and IPA in any Windows application.", "version": "2.6", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/keyferret.install/keyferret.install.png", "author": "Andrew Swaine", "downloadCount": 455, "tags": ["keyferret.install", "unicode", "keyboard", "input"]}