{"description": "Kindle Previewer is a graphical user interface tool that emulates how books display across Kindle devices and apps. Kindle Previewer makes it easy for publishers to preview the layout of a book and make sure its text displays properly for any orientation or font size to ensure publishers produce and submit the highest quality Kindle books.\n\nAs a best practice we recommend you use the Kindle Previewer to review how their books look across all Kindle devices and apps.\n\n* Preview and validate books faster with Kindle Previewer\n* Preview key aspects of your book such as images, tables, drop caps and links\n* Preview how your book will look on different screen sizes, font sizes and orientations\n\n## Features\n\n• Get a bird’s-eye view of your Enhanced Typesetting enabled book to validate the overall layout faster.\n• Easy navigation options to review images, lists, tables and dropcaps without having to go through the entire book.\n• Ability to run Kindle Previewer from the command-line interface to validate multiple books.\n• Regular updates with access to latest Kindle layout and typographic features that come with Enhanced Typesetting.\n• Reflects the layout of the book as delivered to Kindle customers with the latest Enhanced Typesetting features.\n• Simplified installer for Mac and Windows that does not require you to manually download additional software.\n• Full-page previews without having to scroll.\n• Ability to change the fonts during preview.\n• Separate navigation pane for quicker page navigation.\n• Faster text search, page navigation, and book re-open.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@66b2c423b4784a1ae6e7da1796f066755885fbae/automatic/kindlepreviewer/screenshot.png)\n\n## Notes\n\n* The installer is provided using a fixed name (```KindlePreviewInstaller.exe```) so older versions of this package will fail the hash check\n* The application is only available in a 64-bit version - there is no 32-bit support\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-22T13:48:30Z", "galleryUrl": "https://community.chocolatey.org/packages/kindlepreviewer/3.52", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/kindlepreviewer/3.52", "licenseUrl": "https://www.amazon.com/gp/feature.html?docId=1000599251", "packageName": "kindlepreviewer", "displayName": "Kindle Previewer", "summary": "A graphical user interface tool that emulates how books display across Kindle devices and apps", "version": "3.52", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@53619ae4c9b43750b7f5801f620a5c94155a641d/icons/kindlepreviewer.png", "author": "Amazon", "downloadCount": 5578, "tags": ["kindlepreview", "kindlepreviewer", "kindle", "amazon"]}