{"description": "This application provides an easy-to-use graphical user interface for generating images from LaTeX equations. These images can be dragged and dropped or copied and pasted into external applications (presentations, text documents, graphics...), or can be saved to disk in a variety of formats (PNG, JPG, BMP, EPS, PDF, etc.). In addition to the graphical user interface, a command-line interface and a C++ library is provided to perform the same job.\n\nKLatexFormula is open-source, released under the [GNU General Public License](https://www.gnu.org/licenses/licenses.html#GPL) (v2 or later).\n\n## Short History\nKLatexFormula was written by Philippe Faist, currently (2017) a post-doc at Caltech, Pasadena, USA. First released in 2006 written in KDE3 environment, the program has seen many improvements and restructuring since then, leading to the current version, written in Qt 5.\n\n_KLatexFormula is a non-KDE application_\nThe *K* in the name KLatexFormula is there for historical reasons. Since version 3.0, KLatexFormula is not a KDE-specific application; it is based on Qt (Qt 5 since version 4.0) and runs natively on Linux, Windows, and Mac OS X.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/klatexformula/screenshot.png)", "updated": "2024-03-23T19:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/klatexformula/4.1.0.20210227", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/klatexformula/4.1.0.20210227", "licenseUrl": "https://sourceforge.net/projects/klatexformula", "packageName": "klatexformula", "displayName": "KLatexFormula", "summary": "KLatexFormula is an easy-to-use graphical application for generating images (that you can drag and drop, copy and paste or save to disk) from LaTeX equations.", "version": "4.1.0.20210227", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/klatexformula/klatexformula.png", "author": "Philippe Faist", "downloadCount": 779, "tags": ["klatexformula", "latex", "equation", "images"]}