{"description": "## KLayout Highlights\n\n### General\n- Fast and accurate: fast loading and drawing\n- Support of GDS and OASIS file formats with automatic uncompression of zlib compatible formats\n- Full support of properties\n- Full 64 bit support on Linux\n- Extensible and configurable to a large degree by custom ruby scripts\n- Integrated development environment for Ruby scripts\n\n### Viewer\n- Overlay capabilities: multiple layouts can be loaded into one window\n- Very flexible layer configuration: many display options including choice of fill pattern and different frame and fill colors. Animation, transparency, dimming/highlighting ...\n- Layer grouping: the display properties of a group of layers can be changed at once\n- Advanced layer display attributes: layers can be named, they can carry additional transformations, select certain hierarchy levels or select shapes by their properties\n- Copy and paste of layers attributes to other panels\n- Drawing order: select the layer that is show on top\n- Descend into hierarchy: show a cell embedded into it's context\n- Flexible rulers: unlimited count, flexible display styles. Multiple templates can be configured, rules can be edited (move, delete, copy & paste)\n- Shape and instance browsers\n- Bookmarks, various zoom modes, mouse wheel support, screenshot function ...\n- Undo/redo on layer properties, for rulers ...\n- Save: save layout or parts (cells, layers) of it to a different format, with scaling or different database unit.\n- Image overlay capabilities: image files (i.e. jpg, png, gif) can be loaded and placed at an arbitrary position in the layout.\n- Marker browser: certain error report files can be loaded and a browser tool is provided.\n- Global transformation to flip/rotate image\n\n### Editor\n- Smart drawing functions with many options: angle constraints, grid ...\n- True, in-place editing in subcells, variant building function\n- Unlimited undo/redo\n- Smart partial editing function to stretch shapes, move edges or vertices\n- Copy and paste of shapes and whole cells, even to other layouts\n- Many advanced editing functions: hierarchical operations, booleans, clip, corner rounding, sizing, alignment, layer operations ...\n- Support for external libraries dynamically bound to a layout\n- Parametrizable cells\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/klayout/screenshot.png)", "updated": "2024-03-23T02:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/klayout/0.28.17", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/klayout/0.28.17", "licenseUrl": "https://raw.githubusercontent.com/KLayout/klayout/master/LICENSE", "packageName": "klayout", "displayName": "KLayout", "summary": "High Performance Layout Viewer And Editor", "version": "0.28.17", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/klayout/klayout.png", "author": "Matthias Köfferlein", "downloadCount": 7126, "tags": ["klayout", "layout", "viewer", "editor"]}