{"description": "## Features\n\n**Komodo ActiveState Platform Integration**  \nKomodo 12 is now integrated with the ActiveState Platform. The Platform automatically builds runtime environments – just choose your packages and it resolves all dependencies for you. Also included is the State Tool CLI, which lets you reclaim coding time by automating one-off tasks.\n\n**Revamped Code Intelligence**  \nAutocomplete is more robust and triggers from any position. The symbol browser focuses on simplicity, and you can quickly filter symbols using the new symbol list – all with overall faster performance.\n\n**Print Debugging**  \nIs running the full debugger is a bit much, but toggling between print statements gets tiresome? Now you can quickly toggle print statements as well as easily create them, simply by clicking the editor margin.\n\n**DevDocs.​io Integration**  \nHighlight any word or code snippet and trigger the relevant language docs in DevDocs.​io from inside Komodo, making the process of looking up documentation much simpler. It even works when you’re offline.\n\n**Live Previewing**  \nNo need to switch back and forth between your browser and editor. Now you can edit your HTML and markdown and test it all without leaving your IDE. Your preview will automatically reload whenever you edit the file – saving not required.\n\n**Project/Folder/File Templates**  \nAutomate your workflow with provided templates for Python, Go, PHP and HTML, or create your own. You can even link to remote zip files on GitHub to hook projects into Komodo.\n\n**Project Wizard**  \nProject creation is now easier with the Project Wizard. Bootstrap a new project with the template of your choice, specify settings as needed and start developing right away.\n\n**Dependency Detector**  \nKomodo automatically scans and detects third-party dependencies, giving you immediate insight on what works, and letting you further adjust as needed. Maintain control while minimizing configuration time.\n\n**Universal Package Manager**  \nAccess your package manager with one button and run commands directly within the editor, with support for Python (pip), PHP (Composer), Perl (PPM), Ruby (Gem) and Node.js (npm and Yarn).\n\n**Clipboard Manager**  \nPress shortcut key Ctrl + Shift + V (default keybindings) to bring up your last 10 clipboard entries. Convenient!\n\n**Auto-Formatting**  \nAuto-format a file on save, or access formatting options with a new sidebar button. Great for Go coding in particular.\n\n**Added Tooling for PHP**  \nWe’ve added more tools for Drupal, Laravel and WordPress, including snippets, tutorials and userscripts. With expanded toolboxes, it’s even easier to get set up and configured, especially for remote debugging.\n\n### And much more!\n\n* Asynchronous remote files – work with remote files way faster\n* JSHint 2.9.5 linting for enhanced JavaScript (ES6) support\n* SDK availability\n* Project template for Komodo add-ons\n* User interface enhancements\n* Refreshed, comprehensive documentation\n\n**NOTE**: This package is automatically updated. If it is out of date and there is no newer package submitted, please use the `Contact Maintainers` functionality to alert me.", "updated": "2024-03-23T02:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/komodo-ide/12.0.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/komodo-ide/12.0.1", "licenseUrl": "https://www.activestate.com/products/komodo-ide/license-agreement/", "packageName": "komodo-ide", "displayName": "Komodo IDE", "summary": "Code faster with the Komodo IDE.", "version": "12.0.1", "icon": "https://cdn.jsdelivr.net/gh/mikeee/ChocoPackages/icons/komodo-ide.png", "author": "ActiveState Software Inc.", "downloadCount": 921, "tags": ["komodo", "ide", "code", "editor", "development", "dev", "golang", "ruby", "php", "perl"]}