{"description": "## Production-Grade Container Orchestration\n### Automated container deployment, scaling, and management\n\nKubernetes is an open source system for managing containerized applications across multiple hosts, providing basic mechanisms for deployment, maintenance, and scaling of applications. It groups containers that make up an application into logical units for easy management and discovery.\n\nKubernetes builds upon 15 years of experience of running production workloads at Google, combined with best-of-breed ideas and practices from the community.\n\n#### Planet Scale\nDesigned on the same principles that allows Google to run billions of containers a week, Kubernetes can scale without increasing your ops team.\n\n#### Never Outgrow\nWhether testing locally or running a global enterprise, Kubernetes flexibility grows with you to deliver your applications consistently and easily no matter how complex your need is.\n\n#### Run Anywhere\nKubernetes is open source giving you the freedom to take advantage of on-premises, hybrid, or public cloud infrastructure, letting you effortlessly move workloads to where it matters to you.\n\n\n### Features\n#### Automatic binpacking\nAutomatically places containers based on their resource requirements and other constraints, while not sacrificing availability. Mix critical and best-effort workloads in order to drive up utilization and save even more resources.\n\n#### Self-healing\nRestarts containers that fail, replaces and reschedules containers when nodes die, kills containers that don't respond to your user-defined health check, and doesn't advertise them to clients until they are ready to serve.\n\n#### Horizontal scaling\nScale your application up and down with a simple command, with a UI, or automatically based on CPU usage.\n\n#### Service discovery and load balancing\nNo need to modify your application to use an unfamiliar service discovery mechanism. Kubernetes gives containers their own IP addresses and a single DNS name for a set of containers, and can load-balance across them.\n\n#### Automated rollouts and rollbacks\nKubernetes progressively rolls out changes to your application or its configuration, while monitoring application health to ensure it doesn't kill all your instances at the same time. If something goes wrong, Kubernetes will rollback the change for you. Take advantage of a growing ecosystem of deployment solutions.\n\n#### Secret and configuration management\nDeploy and update secrets and application configuration without rebuilding your image and without exposing secrets in your stack configuration.\n\n#### Storage orchestration\nAutomatically mount the storage system of your choice, whether from local storage, a public cloud provider such as GCP or AWS, or a network storage system such as NFS, iSCSI, Gluster, Ceph, Cinder, or Flocker.\n\n#### Batch execution\nIn addition to services, Kubernetes can manage your batch and CI workloads, replacing containers that fail, if desired.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/kubernetes-cli/1.29.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/kubernetes-cli/1.29.1", "licenseUrl": "https://github.com/kubernetes/kubernetes/blob/master/LICENSE", "packageName": "kubernetes-cli", "displayName": "Kubernetes Command Line Interface (CLI)", "summary": "Kubernetes is an open source system for managing containerized applications across multiple hosts, providing basic mechanisms for deployment, maintenance, and scaling of applications.", "version": "1.29.1", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@5a8c40781821bbd2746754b7ce723938090bb7c6/icons/kubernetes-cli.png", "author": "Google", "downloadCount": 1408348, "tags": ["kubernetes", "kubectl", "docker", "rkt", "containers", "devops", "cli", "foss"]}