{"description": "![Screenshot of LAN Messenger](http://lanmsngr.sourceforge.net/screenshots/1.2.25/lmc_1225_win7_1.jpg)\n\nLAN Messenger, which is currently available for Windows, Mac, and Linux is a free and open-source instant messaging application. Through a local network, this application will foster instant communication, eliminating the need for having a server and internet connection. More than just for instant messaging, it also comes with extra features, such as transferring files, archiving of past messages, and being notified of upcoming events.\n\nThe following are some of the features of LAN Messenger:\n\n* Instant Messaging: You can instantly connect with other users on the network and start a conversation.\n\n* Private Network: No need to worry about your privacy. AES encryption with RSA offers industry-leading security.\n\n* Broadcast messages: You will have the option to notify all users within the network or choose specific users.\n\n* Transfer Files: Forget about email attachments. This app makes it easy and hassle-free to transfer files to other users within the network.\n\n* Group Contacts: You can also easily organize people in your contact list. This will make it easy to find people when needed.\n\n* Log Messages: Previous conversations can also be archived, which you can access at any given time.\n\n* Works without Server: One of the best things about this instant messaging application is the lack of server that is required, making it less complicated.\n\n* Works without Internet Connection: This messaging application utilizes a local network, which means that you can send messages even without internet, which is beneficial in minimizing possible threats.\n\n* Supports Multiple Languages: You can choose from the different languages that will be used as the medium for the user interface.\n\n* Multi-platform Support: Regardless of your operating system, whether you are on Mac, Windows, or Linux, you can use this messaging application.", "updated": "2024-03-17T19:03:23Z", "galleryUrl": "https://community.chocolatey.org/packages/lan-messenger.portable/1.2.37", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/lan-messenger.portable/1.2.37", "licenseUrl": "https://sourceforge.net/directory/os:windows/license:gplv3/", "packageName": "lan-messenger.portable", "displayName": "LAN Messenger (Portable)", "summary": "An intranet chat application that does not require a server.", "version": "1.2.37", "icon": "https://a.fsdn.com/allura/p/lanmsngr/icon", "author": "Qualia Digital Solutions", "downloadCount": 989, "tags": ["lan", "messenger", "im", "chat", "admin"]}