{"description": "---\n\n## Package Parameters\n\n* if the parameter is not specified, only the AdmPwd GPO Extension is installed (default)\n* `/ALL` - Installs the AdmPwd GPO Extension and all Management Tools (Fat client UI, PowerShell module, and GPO Editor templates)\nExample:\n\n```shell\nchoco install laps --params='\"/ALL\"'\n```\n\n---\n\n## Overview of Local Administrator Password Solution\n\nFor environments in which users are required to log on to computers without domain credentials, password management can become a complex issue. Such environments greatly increase the risk of a Pass-the-Hash (PtH) credential replay attack. The Local Administrator Password Solution (LAPS) provides a solution to this issue of using a common local account with an identical password on every computer in a domain. LAPS resolves this issue by setting a different, random password for the common local administrator account on every computer in the domain. Domain administrators using the solution can determine which users, such as helpdesk administrators, are authorized to read passwords.\n\nLAPS simplifies password management while helping customers implement recommended defenses against cyberattacks. In particular, the solution mitigates the risk of lateral escalation that results when customers use the same administrative local account and password combination on their computers. LAPS stores the password for each computer’s local administrator account in Active Directory, secured in a confidential attribute in the computer’s corresponding Active Directory object. The computer is allowed to update its own password data in Active Directory, and domain administrators can grant read access to authorized users or groups, such as workstation helpdesk administrators.\n\n**Please Note**: This is an automatically updated package. If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T00:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/laps/6.2.0.20230808", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/laps/6.2.0.20230808", "licenseUrl": "https://go.microsoft.com/fwlink/?LinkID=206977", "packageName": "laps", "displayName": "Microsoft Local Administrator Password Solution (LAPS)", "summary": "The \"Local Administrator Password Solution\" (LAPS) provides management of local account passwords of domain joined computers. Passwords are stored in Active Directory (AD) and protected by ACL, so only eligible users can read it or request its reset.", "version": "6.2.0.20230808", "icon": "https://rawcdn.githack.com/virtualex-itv/chocolatey-packages/227e188880b4e4f7be42a32d31d8b60b74c0119c/icons/laps.png", "author": "Microsoft", "downloadCount": 711742, "tags": ["microsoft", "laps", "local", "admin", "account", "password", "solution", "security"]}