{"description": "# Laragon - The Dev Environment for Web Artisans\n\n## What is Laragon?\n\nLaragon is a portable, isolated, fast & powerful universal development environment for PHP, Node.js, Python, Java, Go, Ruby. It is fast, lightweight, easy-to-use and easy-to-extend.\n\nLaragon is great for building and managing modern web applications. It is focused on performance  - designed around stability, simplicity, flexibility and freedom.\n\nLaragon is very lightweight and will stay as lean as possible. The core binary itself is less than 2MB and uses less than 4MB RAM when running.\n\nLaragon doesn't use Windows services. It has its own `service orchestration` which manages services asynchronously and non-blocking so you'll find things run fast & smoothly with Laragon.\n\nEnjoy!\n\n## Features\n\n- **Pretty URLs**\n  Use `app.test` instead of `localhost/app`.\n- **Portable**\n  You can move Laragon folder around (to another disks, to another laptops, sync to Cloud,...) without any worries. \n- **Isolated**\n  Laragon has an isolated environment with your OS - it will keep your system clean.\n- **Easy Operation**\n  Unlike others which pre-config for you, Laragon **`auto-configs`** all the complicated things. That why you can add another versions of PHP, Python, Ruby, Java, Go, Apache, Nginx, MySQL, PostgreSQL, MongoDB,... effortlessly.\n- **Modern & Powerful**\n  Laragon comes with modern architect which is suitable to build modern web apps. You can work with both Apache & Nginx as they are fully-managed.\n  Also, Laragon makes things a lot easier:\n  - Wanna have a Wordpress CMS? Just 1 click.\n  - Wanna show your local project to customers? Just 1 click.  \n  - Wanna enable/disable a PHP extension? Just 1 click.\n\n\n\n*Laragon is trully isolated & portable. However, you may need to use the installer as it will detect and install missing run-time components that are required to run C++ applications built using Visual Studio such as `PHP, Apache` for you.*\n\n\n## How fast?\nLaragon starts instantly. You can set Laragon autorun when Windows starts. When running, Laragon uses just a little amount of your RAM.\nHere is the GUI of Laragon:\n![0_1513173700919_01-dashboard.png](https://i.imgur.com/f8rBqSU.png) \n\n## How easy?\n- Laragon is very easy to install & upgrade. Just download the latest version and click `Next, Next, Next...`\n- Laragon is very easy to use. For almost time, it will work out-of-the-box that you don't need to touch any configuration files.\n- Laragon is very easy to extend. You can add other services to your current stack by just extracting them to `Laragon's bin` folder.", "updated": "2024-03-23T20:29:19Z", "galleryUrl": "https://community.chocolatey.org/packages/laragon.portable/4.0.15", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/laragon.portable/4.0.15", "licenseUrl": "https://raw.githubusercontent.com/leokhoa/docs.laragon.org/master/LICENSE", "packageName": "laragon.portable", "displayName": "Laragon (Portable)", "summary": "Laragon is an universal development environment.", "version": "4.0.15", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/laragon.portable/laragon.png", "author": "Leo Khoa", "downloadCount": 1655, "tags": ["laragon.portable", "wamp", "microservices", "nodejs", "javascript", "development", "environment"]}