{"description": "Large Text File Viewer was designed for viewing large (>1GB) text files (with either Unicode or regular ANSI character set). It uses little memory and is able to open a gigabyte file instantly.\n\n## Features\n- This program was designed for viewing large (>1GB) text files.\n- It uses little memory and is able to open a gigabyte file instantly.\n- Background file indexing makes browsing even faster.\n- It opens files that are currently being written by other programs, and automatically checks and reads the files if new contents have been appended.\n- It supports view split. The user may split the view either horizontally or vertically, and have each side show different portion of the same file.\n- It allows the user to perform high-speed complex text search by means of plain text or regular expression. The regular expression syntax is slightly different from the standard ones.\n- The regular expressions for finding the following items have been provided as preset for the convenience of the users:\n  - quoted string\n  - hexadecimal integer\n  - floating-point number\n  - date of any format\n  - time of any format\n  - domestic phone number (US & Canada)\n  - social security number\n  - IP address\n  - email address\n  - http address\n  - ftp address\n- For CSV (Comma Separated Value) files, when the user hovers the mouse over any field in the file, a hint automatically  appears with the field name.\n- The program opens and displays both ANSI and Unicode text files. It currently does not support Unicode big endian and UTF-8.\n- It allows the user to change display parameters, which include:\n  - font, font style, and font size.\n  - colors of text, selected text, and URL.\n  - background color and background image. (The user may use any JPG or BMP file as the background image. A sophisticated algorithm is used to soften the image and then blend the softened image with the background color perfectly.)\n  - word-wrap length in character. (It is zero i.e. disabled by default.)\n  - tab size.\n  - automatic detection of URL addresses (namely HTTP, FTP and email addresses).\n- Display parameters are automatically saved and associated with filename extensions.\n- You may use mouse wheel to scroll the content vertically or horizontally, or to increase/decrease the font size.\n- You may use drag-and-drop to open a text file. The program remembers recently opened files.\n- It remembers the window position/size of the previous run.\n- Large Text File Viewer 5.2 requires Windows NT and up. It no longer supports Windows 9x.\n- No additional DLL (such as MFC or VB) is required.\n- No installation is needed.\n- The executable is only 572KB!", "updated": "2024-03-20T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/large-text-file-viewer/5.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/large-text-file-viewer/5.2", "licenseUrl": "https://web.archive.org/web/20140701235304fw_/http://swiftgear.com/copyright_information.html", "packageName": "large-text-file-viewer", "displayName": "Large Text File Viewer (Portable)", "summary": "Large Text File Viewer was designed for viewing large (>1GB) text files (with either Unicode or regular ANSI character set)", "version": "5.2", "icon": "https://raw.githubusercontent.com/webbwebbwebb/chocolatey-packages/386c15cd/icons/large-text-file-viewer.png", "author": "Tie-Qi Chen", "downloadCount": 1524, "tags": ["largetextfileviewer", "swiftgear", "text", "viewer", "utility", "portable"]}