{"description": "![Screenshot of LastPass for Chrome](https://lh3.googleusercontent.com/6RuueVSa2Pm-DYp0exddGE5-9vjcJ-W2uWKaNpdn3Ipuut-249p4GXvH2XievpdvK11l9SWTXw=w640-h400-e365)\t\n\t\nLastPass, an award-winning password manager, saves your passwords and gives you secure access from every computer and mobile device.\nOnly remember one password - your LastPass master password. Save all your usernames and passwords to LastPass, and it will autologin to your sites and sync your passwords everywhere you need them.\n\n\"This robust password manager is a must-use free tool that supports multiple operating systems and browsers.\" - PCMag Editors' Choice\n\n###Save Everything:\n* Store login usernames and passwords\n* Checkout fast by adding credit cards and shopping profiles\n* Attach docs, PDFs, images, audio, and more\n* Save any piece of data you need to keep secure and easy-to-find \n* Manage everything from a simple, searchable vault\n* Add, edit, view, delete, and organize your passwords\n\n###Access Everywhere:\n* LastPass is free to use on any computer, laptop, phone or tablet\n* Install the LastPass browser extension on all computers\n* Login with the same LastPass account everywhere\n* Anything you save on one device is instantly available on all your other devices\n* Download LastPass to all your computers and get our app for your smartphone or tablet\n\n###Improve Your Online Security:\n* Generate secure passwords to replace weak ones\n* Create new passwords as you sign up for sites\n* Protect your LastPass account with multifactor authentication\n* Use the LastPass security check to review your passwords and flag weak and duplicate passwords\n\n###Simplify your life:\n* Never forget another password\n* Generate strong passwords that you don't have to remember \n* Passwords are autofilled for you as you go to your sites - less typing! \n* Securely share your passwords with friends and family \n* Only worry about one master password\n\nOnly you know your master password, and only you can access your vault. Your master password is never shared with LastPass. That’s why millions of people and businesses trust LastPass to keep their information safe. We protect your data at every step.\t\n\t\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/lastpass-chrome/readme.md)**", "updated": "2024-03-23T21:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/lastpass-chrome/4.3.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/lastpass-chrome/4.3.0", "licenseUrl": "https://www.logmeininc.com/legal/terms-and-conditions", "packageName": "lastpass-chrome", "displayName": "LastPass: Free Password Manager for Chrome", "summary": "LastPass remembers all your passwords, so you don't have to.", "version": "4.3.0", "icon": "https://pbs.twimg.com/profile_images/694907106378403841/dWFswB9p_400x400.png", "author": "lastpass.com", "downloadCount": 61241, "tags": ["lastpass", "passwords", "chrome", "extension"]}