{"description": "Lazarus is a free cross-platform visual integrated development environment (IDE) for rapid application development (RAD) using the Free Pascal compiler, which supports dialects of Object Pascal, to varying degrees. Software developers use Lazarus to create native-code console and graphical user interface (GUI) applications for the desktop, and also for mobile devices, web applications, web services, visual components and function libraries (.so, .dll, etc., for use by other programs). \n    \n    The Free Pascal compiler supports a number of different platforms, such as Mac, Linux and Windows. Along with the customary project management features, the Lazarus IDE also provides features that includes but are not limited to:\n\n - A What You See Is What You Get (WYSIWYG) visual windows layout designer\n - An extensive set of GUI widgets or visual components such as edit boxes, buttons, dialogs, menus, etc.\n - An extensive set of non-visual components for common behaviors such as persistence of application settings\n - A set of data-connectivity components for MySQL, PostgreSQL, FireBird, Oracle, SQLite, Sybase, and others\n - Data-aware widget set that allows the developer to see data in visual components in the designer to assist with development\n - Interactive code debugger\n - Code completion\n - Code templates\n - Syntax highlighting\n - Context-sensitive help\n - Text resource manager for internationalisation (internationalization)\n - Automatic code formatting\n - The ability to create custom components\n\nLazarus inherits three features from its use of the Free Pascal compiler: compile speed, execution speed, and cross-compilation.", "updated": "2024-03-23T07:03:34Z", "galleryUrl": "https://community.chocolatey.org/packages/lazarus/3.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/lazarus/3.0.0", "licenseUrl": "http://wiki.lazarus.freepascal.org/licensing", "packageName": "lazarus", "displayName": "Lazarus", "summary": "Lazarus is a Delphi compatible cross-platform IDE for Rapid Application Development. It has variety of components ready for use and a graphical form designer to easily create complex graphical user interfaces.", "version": "3.0.0", "icon": "https://a.fsdn.com/allura/p/lazarus/icon?1552026857", "author": "Lazarus Team", "downloadCount": 27025, "tags": ["lazarus", "fpc", "pascal", "delphi", "ide", "admin"]}