{"description": "# League Of Legends\n\n![Logo](https://rawcdn.githack.com/kamack38/packages/e955e4a1bd6e62aa2aa4a4d6b28c693509ac3fb7/assets/LeagueOfLegendsBanner.png)\n\nLeague of Legends Installer of EUNE region.\n\n## What is League of Legends?\n\nLeague of Legends is a team-based strategy game where two teams of five powerful champions face off to destroy the other's base. Choose from over 140 champions to make epic plays, secure kills, and take down towers as you battle your way to victory.\n\n## Destroy The Base\n\nThe Nexus is the heart of both teams' bases. Destroy the enemy's Nexus first to win the game.\n\n## Clear The Path\n\nYour team needs to clear at least one lane to get to the enemy Nexus. Blocking your path are defense structures called turrets and inhibitors. Each lane has three turrets and one inhibitor, and each Nexus is guarded by two turrets.\n\n## Take on The Jungle\n\nIn between the lanes is the jungle, where neutral monsters and jungle plants reside. The two most important monsters are Baron Nashor and the Drakes. Killing these units grants unique buffs for your team and can also turn the tide of the game.\n\n## Choose your lane\n\nThere are five positions that make up the recommended team comp for the game. Each lane lends itself to certain kinds of champions and roles-try them all or lock in to the lane that calls you.\n\n## Power Up Your Champ\n\nChampions get stronger by earning experience to level up and gold to buy more powerful items as the game progresses. Staying on top of these two factors is crucial to overpowering the enemy team and destroying their base.\n\n## Unlock Your Abilities\n\nChampions have five core abilities, two special spells, and up to seven items at a time. Figuring out the optimal ability order, summoner spells, and item build for your champion will help you succeed as a team.", "updated": "2024-03-23T12:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/leagueoflegendseune/80.0.0.1034", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/leagueoflegendseune/80.0.0.1034", "licenseUrl": "https://www.riotgames.com/en/terms-of-service", "packageName": "leagueoflegendseune", "displayName": "League Of Legends (EUNE)", "summary": "EUNE (Europe North and East) Installer for League of Legends from Riot Games.", "version": "80.0.0.1034", "icon": "https://rawcdn.githack.com/kamack38/packages/e955e4a1bd6e62aa2aa4a4d6b28c693509ac3fb7/assets/LeagueOfLegends.svg", "author": "Riot Games,  Inc", "downloadCount": 865, "tags": ["leagueoflegends", "eune", "riot", "riotgames", "launcher"]}