{"description": "###LegiTest\n\nLegiTest is a comprehensive tool that allows you to test all your data-centric applications, in an easy-to-use, automated platform. It easily integrates with Visual Studio and your existing development software. LegiTest includes a 14-day free trial or enter your license key to access this full featured data testing suite.\n\n*LegiTest provides users a way to legitimize the data they provide to the decision makers within their organization.*\n\nLegiTest enables your team to test all aspects of the SQL Server stack. This includes testing of database objects such as stored procedures, functions, views and tables. It further includes all objects on the BI stack, including SSIS Packages, SSAS Cubes and Dimensions (both Tabular and Multidimensional) and SSRS reports.\n\n**LegiTest Highlights**\n\n- Easy-to-use interface with no code writing necessary\n\n- Ability to manage your own data and test how you want\n\n- Simply integrates with build processes and development software you're already using\n\n----------\n\n#### LegiTest Features\n\n##### Comprehensive Test Coverage\nAccurate data is necessary to any successful business. LegiTest offers users comprehensive test coverage for data-centric applications. It covers all aspects of the SQL Server stack, including SSAS, SSIS & SSRS, as well as any database with OLE DB, ODBC, or ADO.Net interfaces. LegiTest interacts with your data centric applications and will verify the results of your code and data.\n\n##### Production Data Comparison\nBI projects frequently interact with data stored in multiple locations and formats. LegiTest allows you to compare data across different platforms.\n\n##### Test The Way You Want\nSome testing tools expect you to adhere to a rigid format. LegiTest allows you to easily setup the necessary elements for your test, and to clean up afterwards. In addition, it support multiple execution tracks for tests, and lets you control the steps in the testing process.\n\n##### Easy-to-Use\nWith LegiTest, users are provided a responsive user interface that integrates into Visual Studio. Tests can be created using an easy graphical interface. There is no need to write code and complicated operations are wrapped up into easy to use actions and assertions.\n\n##### Extensible\nWhile it is not required to write code in LegiTest, some users may want to add their own custom logic to the tests. LegiTest supports the addition of custom actions, assertions, and you can extend your test code directly.\n\n##### Integrates with Existing Systems\nWorried about how LegiTest will work with the systems you already have in place? It easily integrates with the products and processes you are currently using. It will generate tests that use common testing frameworks (MSTest, NUnit), and integrates well with build processes using TFS, Team City or MSBuild.\n\n#### Problems Solved by LegiTest\n\n###### How do you test your data-centric development today?\n\nMost users are currently not testing their data thoroughly, using multiple products or are doing so manually. LegiTest provides users the ability to accurately test their data in one automated platform.\n\n###### How long does it take to do comprehensive testing today?\n\nIt usually takes users an exorbitant amount of time to test their data since they have to compare it across multiple platforms or do it manually. LegiTest provides users with automated testing that can verify data-centric applications simply and quickly.\n\n###### How are you validating the data loaded into your target systems?\n\nLegiTest provides a single, comprehensive tool to ensure all aspects of your data-centric development are valid and legitimate.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/legitest/2018.2.4.504", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/legitest/2018.2.4.504", "licenseUrl": "http://help.pragmaticworks.com/", "packageName": "legitest", "displayName": "LegiTest", "summary": "LegiTest is a comprehensive tool for testing your data-centric applications in an easy-to-use, automated platform.  Start with a 14-day free trial or enter your license key to access this full featured data testing suite.", "version": "2018.2.4.504", "icon": "https://www.pragmaticworks.com/images/products/LegiTest128x128.png", "author": "Pragmatic Works Software", "downloadCount": 210049, "tags": ["admin", "datatest", "datatesting", "legitest", "licensed", "lifecycle", "pragmatic", "pragmaticworks", "SQL", "SSAS", "SSIS", "SSRS", "testing", "trial", "unittest"]}