{"description": "How to get safe and quick access to alternative file systems? DiskInternals Linux Reader is a new easy way to do this. This program plays the role of a bridge between your Windows and Ext2/Ext3/Ext4, HFS and ReiserFS file systems.\n\nThis easy-to-use tool runs under Windows and allows you to browse Ext2/3/4, HFS and ReiserFS file systems\nThere are a number of evident merits of the program, which you should know. First of all, DiskInternals Linux Reader is absolutely free. Secondly, the program provides for read-only access and does not allow you to make records in file system partitions. This guarantees that the interference in an alterative file system will not affect the work of Linux later. Apart from this, it is necessary to note, that it gives you an opportunity to use common Windows Explorer for extracting data. A preview option for pictures is one more pleasant point, which is worth mentioning.\n\nHow to get safe and quick access to any file systems? DiskInternals Linux Reader is an easy and short way to solve the problem!\n\nWhile saving, it ignores file security policies. It means that it is possible to access absolutely any file on a Linux disk from Windows. The program can create and open disk images.\n\nLinux Reader is 100% FREE. Try it now.\n\n## Package Parameters\n\nThe following package parameters can be set:\n\n- `/NOICON` - Remove the desktop icon\n\n**EXAMPLE**\n`choco install innosetup --params \"'/NOICON'\"`\n\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.", "updated": "2024-03-24T00:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/linux-reader/4.20.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/linux-reader/4.20.0", "licenseUrl": "", "packageName": "linux-reader", "displayName": "Linux Reader", "summary": "Ext 2/3/4, UFS2, HFS and ReiserFS/4 for Windows", "version": "4.20.0", "icon": "https://cdn.jsdelivr.net/gh/AdmiringWorm/chocolatey-packages@da4df523c9fe1aadb649906f6311b9bb539fff20/automatic/linux-reader/icons/64x64.png", "author": "DiskInternals", "downloadCount": 30232, "tags": ["linux", "reader"]}