{"description": "**Please note that this application intended for computer remote access, so antivirus software like VirusTotal may trigger increased amount of warnings**\nLiteManager Pro/Free — remote access software for remote administration of computers over the Internet or remote control in a local network, for distant learning, providing remote support to users and supervising work activity of employees.\n\nThe program allows to quickly and easily control computer desktop in real-time mode with full support for Windows, provides secure remote access to the file system, processes and services of the remote computer. LiteManager has built-in tools for creating network map, collecting technical data, ability to deploy and update using remote installation services, configure private ID router (NOIP) and many other features. Classroom management software.\n\nRemote administration is now possible without IP address. Using Connect by ID mode, you can choose your personal unique ID by yourself and connect by it. Client and server modules of the program can work in networks connected to the Internet via a proxy server. LiteManager remote access software, remote administration.", "updated": "2024-03-23T15:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/litemanager-server/4.8.4886", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/litemanager-server/4.8.4886", "licenseUrl": "http://www.litemanager.com/support/help_en/user_license_agreement/", "packageName": "litemanager-server", "displayName": "LiteManager Server (Install)", "summary": "LiteManager Pro/Free — remote access software for remote administration of computers over the Internet or remote control in a local network", "version": "4.8.4886", "icon": "http://www.litemanager.com/img/head_img.png", "author": "LiteManagerTeam", "downloadCount": 166848, "tags": ["litemanager", "lite-manager", "viewer", "remote-admin", "remote-access", "remote-control", "remote-administration", "support", "admin"]}