{"description": "Live Reload Web Server is a local, static file Web Server that has built-in Live Reload functionality for static Web content, Markdown rendering support and can dynamically execute self-contained C# based Razor templates. It's a quick access development server you can use to fire up static Web content or run  SPA applications locally. \n\nFor development the built-in Live Reload provides a quick edit and review cycle when you modify HTML, CSS and JavaScript code. You can immediately see changes reflected in the browser as the active page or multiple pages are refreshed. \n\nThere are no additional dependencies for this server - just point at a folder and go!\n\n* Run a Web site out of any local folder\n* Built-in Live Reload for refreshing content on resource changes\n* Built-in support for themed Markdown page rendering\n* C# based scripting support using self-contained Razor pages\n* HTTPS support\n* Optional external Web Host Address access\n* 100% self-contained\n* Customize extensions to monitor\n* Auto-launch browser\n* Configurable ports, TLS usage, extensions and more\n\n![](https://github.com/RickStrahl/LiveReloadServer/raw/master/screenshot.png)", "updated": "2024-03-20T01:03:31Z", "galleryUrl": "https://community.chocolatey.org/packages/LiveReloadWebServer/1.3.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/LiveReloadWebServer/1.3.0", "licenseUrl": "https://github.com/RickStrahl/LiveReloadServer/blob/master/LICENSE.MD", "packageName": "LiveReloadWebServer", "displayName": "Live Reload Local Web Server for Windows", "summary": "A self-contained local static Web Server for Windows that includes Live Reload functionality for automatic browser refresh on changes of static resources.", "version": "1.3.0", "icon": "https://raw.githubusercontent.com/RickStrahl/LiveReloadServer/master/LiveReloadServer/icon.png", "author": "Rick Strahl, West Wind Technologies", "downloadCount": 1899, "tags": ["web-server", "live-reload", "web", "development"]}