{"description": "LMMS is a sound generation system, synthesizer, beat/bassline editor and MIDI control system which can power an entire home studio. Sounds and tones can be generated, played and artfully arranged to create entire tracks easily, giving you the opportunity to create music from beginning to end. The tools to create the sounds, arrange the sounds and rhythms to create tracks, layer the tracks to create songs, and then save the songs to an output format are all there, ready for you to use. LMMS can also connect to your MIDI keyboard, allowing you to play music live.\n\nLMMS seems to have much in common (at leas in principle) with Apple's Garage Band, FL Studio (formerly Fruity Loops), Logic Studio, Beat Machine Pro and similar powerful audio tools. In terms of capability, LMMS easily matches the lower to middle-tier professional tools available, making it a great introduction to audio production which is constantly developing.\n\n### Features\n* Sequence, compose, mix and automate songs in one simple interface\n* Note playback via MIDI or typing keyboard\n* Consolidate instrument tracks using Beat+Bassline Editor\n* Fine tune patterns, notes, chords and melodies using Piano Roll Editor\n* Full user-defined track-based automation and computer-controlled automation sources\n* Import of MIDI files and Hydrogen project files\n* Built-in 64-bit VST instrument support with 32-bit VST bridge (64-bit Windows)\n* 16 built in synthesizers, including emultations of Roland ® TB-303, Commodore 64 ® SID microchip, Nintendo ® NES and GameBoy, Yamaha ® OPL2 chip and more\n* Embedded ZynAddSubFx: Polyphonic, mutlitimbral, microtonal, multi-voice additive, subtractive and pad synthesis all in one powerful plugin\n* Native multisample support for SoundFont ® (SF2), Giga (GIG) and Gravis UltraSound ® (GUS) formats for high quality instrument patches and banks\n* Drop-in LADSPA plug-in support\n* Drop-in VST ® effect plug-in support (Linux and Windows)\n* Built-in compressor, limiter, delay, reverb, distortion and bass enhancer\n* Bundled graphic and parametric equalizers\n* Built-in visualization/spectrum analyzer", "updated": "2024-03-22T22:33:38Z", "galleryUrl": "https://community.chocolatey.org/packages/lmms/1.2.2.20210505", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/lmms/1.2.2.20210505", "licenseUrl": "https://raw.githubusercontent.com/LMMS/lmms/master/LICENSE.txt", "packageName": "lmms", "displayName": "LMMS", "summary": "A free, open-source music generation system", "version": "1.2.2.20210505", "icon": "https://cdn.jsdelivr.net/gh/LMMS/lmms@8154f886ed0d06f1915be179291507b6f1625443/cmake/nsis/assets/Logo.png", "author": "Tobias Doerffel", "downloadCount": 16150, "tags": ["lmms", "music", "mixing", "beatbox", "synthesizer", "bassline", "editor", "MIDI", "FOSS", "embedded"]}