{"description": "Log4OM is developed by **IW3HMH Daniele Pistollato**. \n\nSoftware focused on Ham Radio activity and requires very low resources from the host computer.\n\nIt has been tested on all Windows operating systems from Windows Vista to the latest version  available. Log4Om runs on Window Tablets with its full features and can be executed from a memory stick, it’s installation doesn’t use system registry to store information. Windows XP SP3 support terminated with release 1.32.1\n\n## Note\n__Users of Log4OM version 1 must export an ADIF file from version 1 and import it into version 2 once a database has been created in version 2 as described in Quick_Start_Guide.pdf.__\n\n## Features\n\n- Interfaced with QRZ.COM and HAMQTH.COM for rapid searches and QSO data enhancements (massive (Bulk) updates are supported).\n- Innovative graphic DX Cluster management, with SPOT real time view on world map and auto tuning of the radio with CAT support.\n- Super Cluster: An alternative cluster based on online data sent by users to HRDLog.net\n- Complete and unique SOTA support\n- MySQL support for large databases and multi operator operations.\n- CAT support for numerous radios, through HAMLIB and OMNIRIG\n- Cluster integrated with propagation informations by HRDLog.net\n- ADIF import and ADIF / Excel (csv) / PDF export\n- Integrated with E-QSL, LOTW, ClubLog, HRDLog.net, HamQth, QRZ.COM, SOTA, IOTA\n- Complete log searching features, Log4OM enables the OM to update QSO’s  offline with updated information.\n- Optimized for “paper to electronic” log conversion, with features that drammatically speed up the time taken to insert a QSO (auto-time functions with predefined QSO separations, automatically set timings for fast pile-up management)\n- Language selectable English or Italian\n- Complete label print feature\n- SO2R support\n- Innovative NET CONTROL support\n- Complete statistics set with support for main awards (ARRL and RSGB IOTA)\n- Full K1EL Winkeyer Support\n- Huge Award System with more than 50 official awards and an infinite number of user created awards\n- Resources and external services are automatically updated\n- Software Voice Keyer\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/log4om.portable/screenshot.png)", "updated": "2024-03-23T01:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/log4om.portable/2.32.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/log4om.portable/2.32.1.0", "licenseUrl": "https://www.log4om.com/l4ong/usermanual/Log4OMNG_ENU.pdf", "packageName": "log4om.portable", "displayName": "Log4OM (Portable)", "summary": "Ham Radio Log Software", "version": "2.32.1.0", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/log4om.portable/log4om.portable.png", "author": "Daniele Pistollato IW3HMH,  Terry G4POP,  Chuck K7PT ,  Rolf LA9FFA,  Doug W7DRM,  Peter G3ZSS,  Claus OE6CLD", "downloadCount": 3841, "tags": ["log4om", "log", "HAM", "radio", "amateur"]}