{"description": "## LOG4VIEW is the powerful log viewer for log4net, NLog and log4j\n\nIt can help you to locate critical sequences, find bugs and identify performance issues. Powerful filtering techniques allow you to quickly strip down millions of log messages to the extract you are currently interested in. Support engineers can find user-reported issues within seconds while developers still have access to the full scope of log messages.\n\n### Use the standard logging frameworks log4net and log4j in your .NET and Java based applications\n\nLOG4VIEW is designed to work with log4net and log4j, the common logging frameworks for managed applications. Using these open source frameworks keeps your development team flexible and independent.\n\n### Monitor your distributed and multi-threaded applications in real-time\n\nLOG4VIEW visualizes log4net and log4j output from local applications and also connects to distributed and remote applications. Log messages of separate applications can be shown in different windows or be consolidated in a single view to understand the complex interactions of interconnected applications.\n\n### Quickly inspect log files from customers and locate user-reported issues\n\nLOG4VIEW is able to read a group of consecutive log files all at once and can process several hundred thousand log messages very quickly. Simple and powerful filter techniques facilitate the selection of the relevant log messages. Predefined and configurable colors turn your attention to the relevant items.", "updated": "2024-03-22T07:18:32Z", "galleryUrl": "https://community.chocolatey.org/packages/log4view/1.5.3.1583", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/log4view/1.5.3.1583", "licenseUrl": "http://www.log4view.com/pricing/license-content/", "packageName": "log4view", "displayName": "Log4View (Install)", "summary": "LOG4VIEW is the powerful log viewer for log4net, NLog and log4j", "version": "1.5.3.1583", "icon": "https://cdn.jsdelivr.net/gh/belidzs/chocolatey-log4view/icons/Log4View.png", "author": "PROSA GmbH", "downloadCount": 1480, "tags": ["log4view", "logging"]}