{"description": "LogExpert is a Windows tail program (a GUI replacement for the Unix tail command).\n\nSummary of (most) features:\n\n* Tail mode\n* MDI-Interface with Tabs\n* Search function (including RegEx)\n* Bookmarks\n* A very flexible filter view and possibility to filter to tab\n* Highlighting lines via search criteria\n* Triggers (e.g. create Bookmark or execute a plugin) via search criteria\n* Columnizers: Plugins which split log lines into columns\n* Unicode support\n* log4j XML file support\n* 3rd party plugin support\n* Plugin API for more log file data sources\n                    From bennewcomb:\n                    [** FOR Chocolatey ONLY **]\n                    I've found this to be a worthy and necessary tool job after job, computer after computer.  Is it bug-hunting season?  This is a low investment-high return application that, if added to your stack, will enhance application debugging with minimal time and effort.  You can watch multiple files at once and determine quickly when each is updated, optionally tailing them all so you can watch the logging output as it's being written.  You can also set editor formatting rules to decorate useful sections to visually separate groups of text while reviewing the file, and even have it stop when it finds something of interest. This tool saves me time and helps me highlight certain files in the forest of log file statements for easier visibility and faster identification of relevant log lines.  A tail program, if you're not a superuser or sysadmin, is software that appears to continually scroll to the bottom of any file you load, making the newest updates immediately visible on the screen withing requiring you to refresh the file.\n\n                    Installation Directory: $(Split-Path -parent $MyInvocation.MyCommand.Definition)\n                    On my computer, it lands in {chocolatey}\\lib\\logexpert.1.9.0", "updated": "2024-03-23T11:48:38Z", "galleryUrl": "https://community.chocolatey.org/packages/logexpert/1.9.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/logexpert/1.9.0", "licenseUrl": "https://cdn.rawgit.com/zarunbal/LogExpert/v1.9.0/LICENSE", "packageName": "logexpert", "displayName": "LogExpert", "summary": "LogExpert is log file viewing for the Pros.", "version": "1.9.0", "icon": "", "author": "Zarunbal Previous:Hagen Raab", "downloadCount": 43555, "tags": ["LogExpert", "windows", "tail", "logging", "viewer", "troubleshooting"]}