{"description": "## Overview\nInternet music dealers currently sell CD-Quality tracks, or even better (Studio-Master), thanks to lossless audio coding formats (FLAC, ALAC). However, a lossless format does not guarantee that the audio content is what it seems to be. The audio signal may have been upscaled (increasing the resolution), upsampled (increasing the sampling rate) or even transcoded from a lossy to a lossless format. Lossless Audio Checker analyzes lossless audio tracks and detects upscaling, upsampling and transcoding.\n\n## Research papers\n2015-10-30: Julien Lacroix, Yann Prime, Alexandre Remy, Olivier Derrien, [Lossless Audio Checker: A Software for the Detection of Upscaling, Upsampling, and Transcoding in Lossless Musical Tracks](http://www.aes.org/e-lib/browse.cfm?elib=17972). 139th International Audio Engineering Society Convention (AES), New York.\n2019-02-27: Olivier Derrien, [Detection of Genuine Lossless Audio Files: Application to the MPEG-AAC Codec](http://www.aes.org/e-lib/browse.cfm?elib=19892). Journal of the Audio Engineering Society (JAES) Volume 67 Issue 3 pp. 116-123. See here for open access version.\n\n## Detection algorithms\n- Upscaling\n- Upsampling\n- AAC-SIN Transcoding: AAC tracks, encoded using sine windows, transcoded to a lossless format", "updated": "2024-03-23T22:33:38Z", "galleryUrl": "https://community.chocolatey.org/packages/lossless-audio-checker/2.0.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/lossless-audio-checker/2.0.7", "licenseUrl": "http://losslessaudiochecker.com/", "packageName": "lossless-audio-checker", "displayName": "Lossless Audio Checker", "summary": "A utility to check whether a WAVE or FLAC file is truly lossless or not.", "version": "2.0.7", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/lossless-audio-checker/lossless-audio-checker.png", "author": "Julien Lacroix and Yann Prime.", "downloadCount": 801, "tags": ["lossless-audio-checker", "audio", "wave", "flack", "lossless"]}