{"description": "An implementation of a language server for the [Luau](https://github.com/Roblox/luau) programming language.\n\n## Getting Started\n\nInstall the extension from the VSCode Marketplace or OpenVSX Registry:\n\n- VSCode Marketplace: https://marketplace.visualstudio.com/items?itemName=JohnnyMorganz.luau-lsp\n- OpenVSX Registry: https://open-vsx.org/extension/JohnnyMorganz/luau-lsp\n\nAlternatively, checkout [Getting Started for Language Server Clients](https://github.com/JohnnyMorganz/luau-lsp/blob/main/editors/README.md)\nto setup your own client for a different editor\n\n### For General Users\n\nThe language server should be immediately usable for general Luau code after installation.\nString require support is provided for module paths, using `require(\"module\")`.\nThere are two options for resolving requires, which can be configured using `luau-lsp.require.mode`:\n`relativeToWorkspaceRoot` (the default - equivalent to the [command-line REPL](https://github.com/Roblox/luau#usage) `luau`)\nor `relativeToFile`.\n\nType definitions can be provided by configuring `luau-lsp.types.definitionFiles`, with corresponding\ndocumentation added using `luau-lsp.types.documentationFiles`.\n\nIf you use Luau in a different environment and are interested in using the language server, or\nlooking for any specific features, please get in touch!\n\n### For Rojo Users\n\nRojo instance tree and requiring support is provided by default, and the language server should be able to directly emulate Studio.\nThe extension will automatically populate the latest API types and documentation (which can be disabled by configuring `luau-lsp.types.roblox`).\n\nTo resolve your instance tree and provide module resolution, the language server uses Rojo-style sourcemaps.\nThe language server will automatically create a `sourcemap.json` in your workspace root on startup and whenever files are added/created/renamed.\n\nIt does this by running the `rojo sourcemap` command, hence Rojo 7.1.0+ must be available to execute in your workspace root.\nIt is recommend to `.gitignore` the `sourcemap.json` file. In future, the language server will generate the file internally.\n\nNote, if you are using the VSCode extension on macOS, you need to configure the location of the Rojo binary at `luau-lsp.sourcemap.rojoPath`.\n\nBy default we generate a sourcemap for a `default.project.json` project file. The name can be changed in extension settings, as well as whether non-script instances are included in the sourcemap (included by default). Autogeneration of sourcemaps can also be toggled completely on/off in settings - the server will instead just listen to manual changes to `sourcemap.json` files.\n\nIf you do not use Rojo, you can still use the Luau Language Server, you just need to manually generate a `sourcemap.json`\nfile for your particular project layout.\n\n> Note: in the diagnostics type checker, the types for DataModel (DM) instances will resolve to `any`. This is a current limitation to reduce false positives.\n> However, autocomplete and hover intellisense will correctly resolve the DM type.\n> To enable this mode for diagnostics, set `luau-lsp.diagnostics.strictDatamodelTypes` (off by default).\n> [Read more](https://github.com/JohnnyMorganz/luau-lsp/issues/83#issuecomment-1192865024).\n\n**A companion Studio plugin is available to provide DataModel information for Instances which are not part of your Rojo build / filetree: [Plugin Marketplace](https://www.roblox.com/library/10913122509/Luau-Language-Server-Companion)**\n\n## Standalone\n\nThe tool can run standalone, similar to [`luau-analyze`](https://github.com/JohnnyMorganz/luau-analyze-rojo), to provide type and lint warnings in CI, with full Rojo resolution and API types support.\nThe entry point for the analysis tool is `luau-lsp analyze`.\n\nInstall the binary and run `luau-lsp --help` for more information.", "updated": "2024-03-23T00:48:31Z", "galleryUrl": "https://community.chocolatey.org/packages/luau-lsp/1.28.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/luau-lsp/1.28.1", "licenseUrl": "https://github.com/JohnnyMorganz/luau-lsp/blob/1.28.1/LICENSE.md", "packageName": "luau-lsp", "displayName": "Luau Language Server", "summary": "Language Server Implementation for Luau", "version": "1.28.1", "icon": "", "author": "Johnny Morganz", "downloadCount": 1645, "tags": ["luau-lsp", "luau", "oss", "language-server", "roblox", "foss", "lsp"]}