{"description": "**FuSoYa** is not affiliated with this package in any way, so **do not reach out to them for issues with this package**. Likewise, problems with the LunarIPS software itself should not be reported to this package's Github issue tracker.\n      \n      Please check the **Software Site** or installed `README.txt` for **Lunar IPS** information and how you can report issues with the software.\n\n      ---\n\n      **Lunar IPS (LIPS)** is intended as an easy to use, lightweight IPS patch utility for windows to replace the **SNESTool** DOS program. It can both create and apply IPS patches.\n\n      As far as features go, LIPS has:\n      - IPS patch creation/application support.\n      - full RLE encoding/decoding support.\n      - file expanding/truncating support.\n      - the IPS encoder creates files that are the same size or smaller than files created with **SNESTool**.\n      - the IPS encoder avoids the rare \"0x454F46 (EOF) offset bug\" that **SNESTool's** IPS encoder has.\n      - logging feature for applying IPS patches (ROMFileName.log).\n      - registers the \".IPS\" file type so that you can just double click on an IPS file and choose the file to apply it to for convenience.\n      - support for patching files up to 16 MB in size, which is the limit of the IPS format. The files can technically be larger than that, but the IPS format cannot record changes beyond the 16 MB mark due to 24-bit addressing. The IPS file itself can be any size.\n\n      Note that the logging and file registration options are saved to the registry.", "updated": "2024-03-13T21:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/lunar-ips/1.03", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/lunar-ips/1.03", "licenseUrl": "", "packageName": "lunar-ips", "displayName": "LunarIPS Patching Utility", "summary": "Lunar IPS (LIPS) is intended as an easy to use, lightweight IPS patch utility for windows to replace the SNESTool DOS program. It can both create and apply IPS patches.", "version": "1.03", "icon": "http://rawcdn.githack.com/codewario/chocolatey-lunar-ips/master/icons/lunar-ips.png", "author": "FuSoYa", "downloadCount": 235, "tags": ["lunar-ips", "lunarips", "lunar", "ips", "patching", "snestool", "snes-tool"]}