{"description": "# Microsoft Access Database Engine 2016 Redistributable\n\n## Description\n\nThis download will install a set of components that facilitate the transfer of data between existing Microsoft Office files such as Microsoft Office Access (*.mdb and *.accdb) files and Microsoft Office Excel (*.xls, *.xlsx, and *.xlsb) files to other data sources such as Microsoft SQL Server. Connectivity to existing text files is also supported. ODBC and OLEDB drivers are installed for application developers to use in developing their applications with connectivity to Office file formats.\n\nThe Access Database Engine 2016 Redistributable is not intended:\n\n-  As a general replacement for Jet (If you need a general replacement for Jet you should use SQL Server Express Edition).\n-  As a replacement for the Jet OLEDB Provider in server-side applications.\n-  As a general word processing, spreadsheet or database management system -To be used as a way to create files. (You can use Microsoft Office or Office automation to create the files that Microsoft Office supports.)\n-  To be used by a system service or server-side program where the code will run under a system account, or will deal with multiple users identities concurrently, or is highly reentrant and expects stateless behavior. Examples would include a program that is run from task scheduler when no user is logged in, or a program called from server-side web application such as ASP.NET, or a distributed component running under COM+ services.\n\n\n## Features\n\n- Install and uninstall via Chocolatey\n- Supports 32/64-bit version\n\n## System Requirements\n\nWindows 7, Windows 8, Windows Server 2003 R2 (32-Bit x86), Windows Server 2003 R2 x64 editions, Windows Server 2008 R2, Windows Server 2008 Service Pack 2, Windows Server 2012 R2, Windows Vista Service Pack 1, Windows XP Service Pack 3\n\nOnly the 32-bit Access Database Engine may be used on Windows XP Service Pack 3", "updated": "2024-03-22T14:48:27Z", "galleryUrl": "https://community.chocolatey.org/packages/made-2016/2022.08.23", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/made-2016/2022.08.23", "licenseUrl": "https://www.microsoft.com/en-us/download/details.aspx?id=54920", "packageName": "made-2016", "displayName": "Microsoft Access Database Engine 2016 Redistributable", "summary": "The Web Deployment Tool simplifies migration, management and deployment of IIS Web servers, Web applications and Web sites.", "version": "2022.08.23", "icon": "https://rawcdn.githack.com/m-s-/made2016/main/logo.png", "author": "Microsoft", "downloadCount": 1890, "tags": ["microsoft", "access", "database", "engine"]}