{"description": "---\n\n### [choco://mame](choco://mame)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n\t\n### What is MAME\nMAME originally stood for Multiple Arcade Machine Emulator.\n\nMAME's purpose is to preserve decades of software history. As electronic technology continues to rush forward, MAME prevents this important \"vintage\" software from being lost and forgotten. This is achieved by documenting the hardware and how it functions. The source code to MAME serves as this documentation. The fact that the software is usable serves primarily to validate the accuracy of the documentation (how else can you prove that you have recreated the hardware faithfully?). Over time, MAME absorbed the sister-project MESS (Multi Emulator Super System), so MAME now documents a wide variety of (mostly vintage) computers, video game consoles and calculators, in addition to the arcade video games that were its initial focus.\t\n\n## Purpose\nMAME's main purpose is to be a refefence to the inner workings of the emulated machines. This is done both for educational purposes and for preservation purposes, in order to prevent historical software from disappearing forever once the hardware it runs on stops working. Of course, in order to preserve the software and demonstrate that the emulated behavior matches the original, you must also be able to actually use the software. This is considered a nice side effect, and is not MAME's primary focus.\n\nIt is not our intention to infringe on any copyrights or patents on the original games. All of MAME's source code is either our own or freely available. To operate, the emulator requires images of the original ROMs, CDs, hard disks or other media from the machines, which must be provided by the user. No portions of the original game code are included in the executable.\n\n## Cost\nMAME is free. Its source code is free. The project as whole is under distributed under the GNU General Public License, version 2 (GPL-2.0), but most of code (including core functionality) is available under the BSD-3-clause license.\n\nLegal ROM Sources:\n[mamedev.org](http://mamedev.org/roms/)\n[archived gaelco.com](https://web.archive.org/web/20160402171815/http://www.gaelco.com/english/pages/hablando/frhablan.htm)\n\nMAME is mostly programmed in C with some core components in C++. MAME can currently emulate over 32000 individual systems from the last 5 decades. [Supported systems](http://www.mess.org/supported_systems)\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/mame/readme.md)**\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-23T15:18:32Z", "galleryUrl": "https://community.chocolatey.org/packages/mame/0.247", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mame/0.247", "licenseUrl": "http://mamedev.org/legal.html", "packageName": "mame", "displayName": "MAME (Portable)", "summary": "Multiple Arcade Machine Emulator", "version": "0.247", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/mame/mame_icon.png", "author": "hundreds of developers", "downloadCount": 6830, "tags": ["mame", "arcade", "emulator", "game", "games", "gaming", "nintendo", "nes", "snes", "famicom", "gameboy", "sega", "portable", "binary"]}