{"description": "## Live Video Made Better\nManyCam is the go-to software to enhance your live video on streaming platform, video conferencing app and distant classes.\n\nAdd multiple cameras and video sources, such as mobile and PowerPoint, use virtual backgrounds, create layers and presets, screencast desktop, and more.\nNOTE: This package installs a printer driver. If you have UAC prompts enabled, you will need to confirm the driver installation.\n\n### Virtual Backgrounds\nBlur, remove or replace your background with images during web conferences, video chats, and virtual classrooms without a green screen. If you have a green screen, activate the Chroma Key for an even more professional virtual background.\n\n### Stream to Facebook and YouTube Live\nStreaming has never been easier! Quickly set up your RTMP stream and broadcast to your chosen streaming service or go live on multiple platforms at once to increase your online reach.\n\n### NDI® Source\nWith NDI® Input, users can add NDI-compatible software and hardware as a video source within ManyCam. Skype and Microsoft Teams are two examples of potential NDI® sources. In other words, your meeting or one-on-one video call interview can be broadcasted live with ManyCam.\n\nManyCam also offers NDI® Output, which enables users to add ManyCam as an NDI® source on any compatible product with low-latency.\n\nNetwork Device Interface (NDI®) is a free protocol for Video over IP developed by NewTek that allows video-compatible products to communicate, send, and receive high-quality videos with low-latency - ideal for live productions. \n\n**NOTE: The uninstall _on some earlier operating systems_ is not silent as it requires answer to what data you wish to uninstall.**\n\n**NOTE: Please note the [system requirements](https://help.manycam.com/knowledge-base/system-requirements/) particularly if you want to use virtual backgrounds.**\n\n**NOTE**: This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T00:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/manycam/7.7.0.33", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/manycam/7.7.0.33", "licenseUrl": "", "packageName": "manycam", "displayName": "ManyCam Virtual Webcam (Install) (Install)", "summary": "ManyCam is the go-to software to enhance your live video on streaming platform, video conferencing app and distant classes.", "version": "7.7.0.33", "icon": "https://cdn.jsdelivr.net/gh/pauby/ChocoPackages@8b6a833/icons/manycam.png", "author": "Visicom Media Inc.", "downloadCount": 34109, "tags": ["admin", "webcam", "zoom", "hangouts", "teams", "skype", "ndi", "camera", "notSilent"]}