{"description": "MapTool\n=======\n\nSo what is MapTool? \n-------------------\n\nMapTool is much more than just a mapping program. Included are not only powerful tools for the creation of detailed maps, but also a chat function, detailed token management (allowing you to track properties of the units placed on the map and display health and status information), and an initiative tracker. Functions not being used can be hidden out of sight. These features enable your computer screen to function as a virtual table top, filling the role of battlemats and dry-erase markers and providing for infinitely scrollable maps and the ability to use a large-screen TV or video projector.  It is \"game system agnostic\", meaning that while MapTool has special support for some game systems (like hexes for GURPS or square templates for D&D 4E) there is no requirement for you to use these features.\n\nThe best part is all this isn't limited to a single PC. You can utilize the integrated server function to connect to players wherever there's an Internet connection. Miss your buddy in Singapore? Not a problem. Roll up that character, and then your sleeves.\n\nAnd we don't stop there! Not content with just emulating the tabletop, we seek to improve upon the tabletop experience. This, truly, is where MapTool shines. A set of \"topology\" and vision features enable the GM to limit the view of his players, revealing the map as they explore it. Walls and other objects can prevent players from seeing what lies behind them. Darkness can be made to fall, blinding players who lack a light. Lights can be set on objects or on tokens that illuminate however much of the map you wish. If the GM wishes, s/he can limit the view of players to what their specific token sees, adding a whole new level to the experience of splitting up the party.  Woe be to the character who can't see around the corner of a wall but steps out into the view of the enemy!\n\nResources\n---------\n\n - **Website:** http://rptools.net/ \n - **Forums:**  http://forums.rptools.net \n - **Wiki:**    http://lmwcs.com/rptools/wiki/Main_Page \n - **Discord:** https://discord.gg/gevEtpC\n\n## Maintainer's Note\n\nI produce and maintain Chocolatey packages in my spare time, for free. If you use my packages, and appreciate the time and effort I put into making and maintaining them, please consider [making a small donation](https://www.buymeacoffee.com/jtcmedia). Thank-you!", "updated": "2024-03-13T23:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/maptool/1.14.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/maptool/1.14.3", "licenseUrl": "https://github.com/RPTools/maptool/blob/main/LICENSE", "packageName": "maptool", "displayName": "MapTool (Install)", "summary": "Virtual Tabletop for playing roleplaying games with remote players or face to face.", "version": "1.14.3", "icon": "https://rawcdn.githack.com/jtcmedia/chocolatey-packages/e981cb69fb136f3bd6e1cb1a611d8f25ec4b2dce/icons/maptool.png", "author": "RPTools", "downloadCount": 1813, "tags": ["maptool", "admin", "rpg", "mapping", "map", "chat", "token", "tracker", "tabletop", "virtual", "table", "top", "battlemat", "gurps", "d&d"]}