{"description": "Markdown Monster is an easy to use and extensible Markdown Editor and Weblog Publisher. The editor sports syntax colored editing of Markdown text, inline spell checking, live, synced HTML preview, a document outline, integrated file browser and Git support. Embed images by pasting from clipboard, via dialog or dragging from the shell. Embed links, code snippets and emojiis quickly and use the built-in table editor to create nicely formatted Markdown tables easily. There is support for text snippet expansion and C# script execution to automate and extend Markdown Monster. \n    \nBut above all the editor's goal is to get out of your way and let you focus on your content creation, and to provide you with the right tools to get your job done efficiently at your pace.\n    \nDocuments can be saved to Pdf and as packaged Html, you can generate Html from partial selections to the clipboard and you can import external Html as Markdown. Markdown Monster can also publish your Markdown directly to your Weblog that supports WordPress, MetaWebLog, Jekyll or Medium APIs, and of course also works with any Markdown static site generators. You can manage multiple blogs and even download existing Html posts as Markdown and then repost them.\n\nMarkdown Monster can be extended using a .NET based add-in model and a few useful addins are available to provide features like storing images in Azure Blobs, Gist integration, a reusable Snippets manager, and more. You can also swap Markdown Parsers between Markdig and Pandoc and create or integrate custom Markdown parsers via addin integration. A command line interface lets you easily launch Markdown Monster with multiple files, or with a folder selected, and the included CLI can automate several Markdown conversions.\n\nMarkdown Monster can be evaluated for free. This package is **unlimited and fully functional**, but a [license](https://markdownmonster.west-wind.com/purchase) is required for continued use.\n\nA portable, non-admin Chocolatey install is also available in [MarkdownMonster.Portable](https://chocolatey.org/packages/MarkdownMonster.Portable).\n\n![Markdown Monster](https://markdownmonster.west-wind.com/Images/screenshot.png)", "updated": "2024-03-23T23:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/MarkdownMonster/3.2.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/MarkdownMonster/3.2.5", "licenseUrl": "https://markdownmonster.west-wind.com/purchase#License", "packageName": "MarkdownMonster", "displayName": "Markdown Monster 3.0", "summary": "Markdown Monster: The Markdown Editor and Weblog Publisher for Windows", "version": "3.2.5", "icon": "https://markdownmonster.west-wind.com/images/MarkdownMonster_icon_128.png", "author": "Rick Strahl,  West Wind Technologies", "downloadCount": 144096, "tags": ["markdown", "editor", "markdown-editor", "documentation", "weblog", "blog", "westwind", "admin"]}