{"description": "Markdown Monster is an easy to use and extensible Markdown Editor and Viewer and Weblog Publisher by West Wind Technologies. \n\nThis portable installation doesn't run an installer, doesn't require admin mode and is self-contained in its install folder and saves settings in a `PortableSettings` folder in the install folder (more info on [Portable Installation](https://markdownmonster.west-wind.com/docs/_4t90rhfy9.htm)).\n\nMarkdown Monster sports syntax colored editing of Markdown text, inline spell checking, live, synced HTML preview, embedding, dragging and pasting of images, code, links and Emoji and has built-in support for screen captures. There is support for text snippet expansion and C# script execution to automate and extend Markdown Monster. But above all the editor's goal is to get out of your way and let you focus on your content creation, and provide you with tools to get your job done efficiently.\n    \nYou can save documents to Html and PDF files. Markdown Monster can also publish your Markdown directly to your Weblog that supports WordPress, MetaWebLog or Medium APIs. You can manage multiple blogs and even download existing HTML posts as Markdown.\n\nMarkdown Monster can also be extended using an easy, but powerful .NET based add-in model and a few useful addins are available to provide features like storing images in Azure Blobs, a reusable Snippets manager, and more. You can also swap Markdown Parsers between Markdig and Pandoc and use another custom Markdown parser via addin integration.\n\nMarkdown Monster can be downloaded and evaluated for free. This package is **unlimited and fully functional**, but a [license](https://store.west-wind.com/product/markdown_monster) is required for continued use. Requires **.NET 4.7.2 or later**.\n\nThis is a portable installation that doesn't run an installer installer and keeps all configuration data in a self-contained folder. The full desktop Chocolatey install is also available in the [MarkdownMonster Package](https://chocolatey.org/packages/MarkdownMonster).\n\n![Markdown Monster](https://markdownmonster.west-wind.com/Images/screenshot.png)", "updated": "2024-03-22T11:48:31Z", "galleryUrl": "https://community.chocolatey.org/packages/MarkdownMonster.Portable/3.2.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/MarkdownMonster.Portable/3.2.3", "licenseUrl": "https://markdownmonster.west-wind.com/purchase#Licensing", "packageName": "MarkdownMonster.Portable", "displayName": "Markdown Monster Portable Install", "summary": "Markdown Monster is an easy to use and extensible Markdown Editor and viewer and Weblog Publisher", "version": "3.2.3", "icon": "https://markdownmonster.west-wind.com/images/MarkdownMonster_icon_128.png", "author": "Rick Strahl,  West Wind Technologies", "downloadCount": 30560, "tags": ["markdown", "markdown-editor", "markdown-generator", "text-editor", "markdown-blogging", "publishing", "writing", "documentation", "markdown-documentation", "westwind"]}