{"description": "Master Packager is a tool to create and edit Microsoft Windows Installer (MSI) files and repackage other installation to MSI format.\n\nOur vision is to make application packaging easy, fast and affordable that is accessible to everyone from application packager freelancer, small company and enterprises.\n\n### What are the benefits of using Master Packager?\n\n * Fast - You will never see \"not responding\" text in the tool. Modifying large MSIs is effortless. The same goes for repackaging\n * High quality - Standardize naming, ICE validation, and .dll/.exe file registration mapping are just a few examples of how this tool will reduce human errors and increases quality. \n * Simple - The user interface allow new and experience packagers to start creating packages immediately\n * Automation - Capturing, building and applying templates can be fully automated, making it possible to fully automate repackaging.\n * Free - Features you need to edit and create MSI and MST files are for Free.\n * Price - We are doing everything to provide the best Price vs. Performance. Providing the same value or better Master Packager can save you money as it can be up 10 times less expensive per license than alternatives.\n * Collaborative - With one click from the tool you can register a bug or make a feature suggestion.\n * Support -  We will worry about the tools for you, so you can focus only on the packaging\n\n See all of the features [here](https://www.masterpackager.com/features)", "updated": "2024-03-24T00:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/masterpackager/24.2.8812", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/masterpackager/24.2.8812", "licenseUrl": "https://www.masterpackager.com/eula", "packageName": "masterpackager", "displayName": "Master Packager", "summary": "Master Packager is a tool to create and edit Microsoft Windows Installer (MSI) files and repackage other installation to MSI format.", "version": "24.2.8812", "icon": "https://raw.githubusercontent.com/MasterPackager/MasterPackagerChoco/master/MasterPackager/128.png", "author": "Master Packager Ltd.", "downloadCount": 10587, "tags": ["masterpackager", "masterrepackager", "packaging", "repackaging", "msi", "mst", "responsetransform", "buildmsi"]}