{"description": "This program can be useful for:\n        * people who don't want to play on the Russian servers, and rather play on the EU West servers where more people speak English and there are far less Russians (Russians get close to 100ms on EU West).\n        * mm_dedicated_search_maxping doesn't work for some people and that is causing them to connect to high ping servers even when they have it set to low values. Using this program you can see the ping of all the servers and select which one has the lowest ping for you.\n        * players living in South America who aren't Brazilian, and want to play with people who speak English on the American servers.\n        * Australian players who want to play at down time and can't find any games. They can block the Aus servers and play on the Asian ones (they'll get around 100ms though).\n        * people in India and UAE and other countries who want to play on other servers rather than play on the hackfest that is the Dubai servers, you can block Dubai using this program. (valve locks you to the Dubai servers if you have under 80ms ping to them).\n        * people in India and other countries who want to play on the Asian Servers (which take shorter to find a match on), instead of playing on the Indian servers. (valve also locks you to the Indian servers if you have under 80ms ping to them).\n      and many more!", "updated": "2024-03-14T01:33:25Z", "galleryUrl": "https://community.chocolatey.org/packages/matchmaking-server-picker/4.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/matchmaking-server-picker/4.5", "licenseUrl": "", "packageName": "matchmaking-server-picker", "displayName": "Matchmaking Server Picker", "summary": "Control access to Counter Strike: Global Offensive Matchmaking servers by region", "version": "4.5", "icon": "http://media.steampowered.com/apps/730/icons/community_support_pass_coin3_large.c3afe0cfbd929f85fca1a63ec1815e8336dcfe7d.png", "author": "http://gamebanana.com/members/490570", "downloadCount": 1131, "tags": ["csgo", "matchmaking", "server", "firewall"]}