{"description": "Maxthon is a state-of-the-art, multi-platform web browser that regularly outperforms other top browsers and offers users a seamless browsing and sharing experience. Thanks to our supporters, Maxthon is a global phenomenon: a community of friends, colleagues\nand fans who believe surfing the web should be fast and fun.\n\n## Features\n\n- Tabbed document interface\n- Saves open tabs in case of program shutdown or system crash\n- Undo for any tabs accidentally closed\n- AD Hunter - an ad blocking utility that blocks pop-up ads, Web banner and floating ads in webpages\n- Adobe Flash, Java applet and ActiveX blocker\n- Support for custom skins\n- Customizable tabs and user interface\n- Programmable mouse gestures and mouse chording\n- External utility bar – a toolbar that allows you to open third-party programs\n- RSS reader\n- Supports many Internet Explorer plugins as well as plugins of its own\n- Partial Gecko engine support with the use of a third-party program\n- A user extensible search toolbar with 8 default search engines\n- Automatic updates\n- Groups – the ability to bookmark & open multiple pages simultaneously\n- URL aliases – open URLs by just typing a word in the address bar\n- Simple collector – a small notepad-like utility, used to collect text from web pages. Scripts and macros can be run in the current web page\n- Integrated web services – user extensible, including by default translators, Google's cached version of pages, Whois, and anonymous web proxies", "updated": "2024-03-16T18:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/maxthon.commandline/6.1.3.3000", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/maxthon.commandline/6.1.3.3000", "licenseUrl": "http://www.maxthon.com/user-agreement/", "packageName": "maxthon.commandline", "displayName": "Maxthon (Portable)", "summary": "Maxthon - Use a Better Browser. Get a Better Web", "version": "6.1.3.3000", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@75a4f3acb5fdff5fb229650e2349925603a7743b/icons/maxthon.png", "author": "Maxthon International Limited", "downloadCount": 30302, "tags": ["maxthon-commandline", "maxthon", "web", "browser", "webkit", "freeware", "cross-platform"]}