{"description": "MD5 - Command Line Message Digest Utility\nSYNOPSIS\n\nmd5 [ -csignature ] [ -l ] [ -n ] [ -u ] [ -v ] [ -dinput_text | infile… ]\n\nOPTIONS\n\n-csignature\nComputes the signature of the specified infile or the string supplied by the -d option and compares it against the specified signature. If the two signatures match, the exit status will be zero, otherwise the exit status will be 1. No signature is written; only the exit status is set. The signature to be checked must be specified as 32 hexadecimal digits.\n-dinput_text\nA signature is computed for the given input_text (which must be quoted if it contains white space characters) instead of input from infile or standard input. If input is specified with the -d option, no infile should be specified.\n-l\nUse lower case letters for hexadecimal digits \"a\" through \"f\". By default, upper case letters are used. Note that the signature argument to the -c option may use upper or lower case hexadecimal digits (or a mix) regardless of the setting of this option.\n-n\nSuppress printing the file name (or \"-\" for standard input) after the hexadecimal signature.\n-ofname\nWrite output to fname. If fname is \"-\", output is written to standard output, which is the default is no -o option is specified.\n-u\nPrint how-to-call information.\n-v\nPrint version information.\nFILES\n\nIf no infile or -d option is specified or infile is a single \"-\", md5 reads from standard input. A single \"-\" on the command line causes all subsequent arguments to be treated as file names even if they begin with \"-\". If no -o option is specified or the fname is a single \"-\", output is sent to standard output. Input and output are processed strictly serially; consequently md5 may be used in pipelines.", "updated": "2024-03-23T15:18:32Z", "galleryUrl": "https://community.chocolatey.org/packages/md5/2.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/md5/2.2", "licenseUrl": "http://www.fourmilab.ch/md5/", "packageName": "md5", "displayName": "MD5", "summary": "md5", "version": "2.2", "icon": "https://raw.github.com/ferventcoder/nugetpackages/master/md5/md5.png", "author": "Colin Plumb,  Ron Rivest", "downloadCount": 8864, "tags": ["md5", "checksum"]}