{"description": "Meazure is a tool for easily measuring and capturing portions of the screen. Tasks such as measuring the size of a window, capturing an image, determining the color of a pixel, and determining the screen size and resolution can all be easily accomplished using Meazure.\n\nMeazure provides a number of different types of tools for measuring and capturing the screen:\n\n* Cursor Tool\n* Point Tool\n* Line Tool\n* Rectangle Tool\n* Circle Tool\n* Angle Tool\n* Window Tool\n\nThe measurement tools provide a number of key features including:\n\n* Capture of arbitrary portions of the screen (Rectangle Tool, Circle Tool, and Window Tool)\n* Display of measurements in a variety of units\n* Measurement using the mouse of keyboard including fine adjustment\n\nIn addition to the tools listed above, a set of rulers and a grid can be placed on the screen. A magnifier is also provided to help position the measurement tools and to read the color of screen pixels.\n\nMeazure remembers the settings for all measurement tools between runs of the program. In addition, Meazure allows you to save the tool positions to a file. These files, called profiles, can be used to represent an alternate screen size or a required image size.\n\n#### Version Requirement\nMeazure requires Windows 10 version 1607 or newer.", "updated": "2024-03-20T16:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/meazure/4.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/meazure/4.0.0", "licenseUrl": "https://github.com/cthing/meazure/blob/master/LICENSE", "packageName": "meazure", "displayName": "Meazure", "summary": "Screen magnification, measurement, capture and color sampling for Windows.", "version": "4.0.0", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@8f649e2710be10581a9c563d92172529b6ea2014/Icons/meazure_icon.png", "author": "Baron Roberts,  Cecie", "downloadCount": 1936, "tags": ["meazure", "measurement", "ruler", "grid", "protractor", "angle", "colorpicker", "embedded", "FOSS"]}