{"description": "MediaInfo supplies technical and tag information about a video or audio file. Supports many audio and video formats, with different methods of viewing information.\n\n## Display\n\n* Container: format, profile, commercial name of the format, duration, overall bit rate, writing application and library, title, author, director, album, track number, date, duration...\n* Video: format, codec id, aspect, frame rate, bit rate, color space, chroma subsampling, bit depth, scan type, scan order...\n* Audio: format, codec id, sample rate, channels, bit depth, language, bit rate...\n* Text: format, codec id, language of subtitle...\n* Chapters: count of chapters, list of chapters...\n\n## Analyticals\n\n* Container: MPEG-4, QuickTime, Matroska, AVI, MPEG-PS (including unprotected DVD), MPEG-TS (including unprotected Blu-ray), MXF, GXF, LXF, WMV, FLV, Real...\n* Tags: Id3v1, Id3v2, Vorbis comments, APE tags...\n* Video: MPEG-1/2 Video, H.263, MPEG-4 Visual (including DivX, XviD), H.264/AVC, Dirac...\n* Audio: MPEG Audio (including MP3), AC3, DTS, AAC, Dolby E, AES3, FLAC...\n* Subtitles: CEA-608, CEA-708, DTVCC, SCTE-20, SCTE-128, ATSC/53, CDP, DVB Subtitle, Teletext, SRT, SSA, ASS, SAMI...\n\n## Features\n\n* Read many video and audio file formats\n* View information in different formats (text, sheet, tree, HTML...)\n* Customise these viewing formats\n* Export information as text, CSV, HTML...\n* Graphical user interface, command line interface, or library (.dll/.so/.dylib) versions available\n* Integrate with the shell (drag 'n' drop, and Context menu)\n* Internationalisation: display any language on any operating system\n* Localisation capability (for which volunteers are needed - please contact me!)\n\n### Package\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-23T13:33:26Z", "galleryUrl": "https://community.chocolatey.org/packages/mediainfo-cli/24.1.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mediainfo-cli/24.1.1", "licenseUrl": "https://mediaarea.net/en/MediaInfo/License", "packageName": "mediainfo-cli", "displayName": "MediaInfo CLI", "summary": "MediaInfo supplies technical and tag information about a video or audio file. Supports many audio and video formats, with different methods of viewing information.", "version": "24.1.1", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@010c95a08ae958860af2796ed0a3ad446109f5d7/icons/mediainfo-cli.svg", "author": "Jérôme Martinez", "downloadCount": 24188, "tags": ["media", "info", "tag", "metadata", "file-formats", "file-analysis", "admin"]}