{"description": "MediaCoder is a universal media transcoding software actively developed and maintained since 2005. It puts together most cutting-edge audio/video technologies into an out-of-box transcoding solution with a rich set of adjustable parameters which let you take full control of your transcoding. New features and latest codecs are added or updated constantly. MediaCoder might not be the easiest tool out there, but what matters here is quality and performance. It will be your swiss army knife for media transcoding once you grasp it.\n\nFeatures In Brief\n- Converting between most popular audio and video formats\n- H.264/H.265 GPU accelerated encoding (QuickSync, NVENC, CUDA)\n- Ripping BD/DVD/VCD/CD and capturing from video cameras\n- Enhancing audio and video contents by various filters\n- An extremely rich set of transcoding parameters for adjusting and tuning\n- Multi-threaded design and parallel filtering unleashing multi-core power\n- Segmental Video Encoding technology for improved parallelization\n\nTypical Applications\n- Improving compression / reducing size for audio and video files\n- Converting media content for playback on multimedia devices\n- Converting media content for online publication or broadcasting\n- Unifying and normalizing media standard and storage format\n- Extracting audio track from video files and discs\n- Dumping and encoding from network stream or capture device\n- Fixing corrupted or partial downloaded video files\n\nSupported Fomats\n- Lossy Audio Compression Formats:\nMP3, Vorbis, LC-AAC, HE-AAC, Opus, AC-3, MPEG Audio, MusePack, Speex, AMR, Windows Media Audio, ADPCM, mp3PRO\n- Lossless Audio Compression Formats:\nFLAC, WavPack, Monkey's Audio, OptimFrog, ALAC, TTA, PCM\n- Video Compression Formats:\nH.264/AVC, H.265/HEVC, VP8/VP9, MPEG 1/2/4, Flash Video, XviD, DivX, Theora, Dirac, H.263, RealVideo, Windows Media Video, Huffyuv, MJPEG\n- Container Formats:\nMP4, WebM, F4V, FLV, Matroska, AVI, MPEG-PS, MPEG-TS, ASF, MTS/M2TS/AVCHD, Quicktime/MOV, PMP, RealMedia, OGM\n- Storage Media and Streaming (Input):\nBluray, DVD, VCD, SVCD, CD, CUESheet, HTTP, FTP, RTSP, UDP", "updated": "2024-03-19T23:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/mediacoder/0.8.63", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mediacoder/0.8.63", "licenseUrl": "http://www.mediacoderhq.com/", "packageName": "mediacoder", "displayName": "MediaCoder", "summary": "Advanced software designed for power users in order to help them convert between various audio and video formats.", "version": "0.8.63", "icon": "https://res.cloudinary.com/mareccs/image/upload/v1613942815/chocolatey/mediacoder_ohh2hv.png", "author": "Mediatronic Pty Ltd", "downloadCount": 9895, "tags": ["mediacoder", "admin", "convert", "audio", "video", "encode", "decode", "ffmpeg", "h264", "h265", "avc", "hevc"]}