{"description": "MEGAsync is an installable application that synchronises folders between your computer and your MEGA Cloud Drive. All files and subfolders will be replicated in both directions. Changes that you make on your device will also be made on the MEGA Cloud Drive in near to real time (within the limits of link / system latency and file transfer times). Similarly, changes made in your MEGA Cloud Drive (such as renaming, moving and deleting) will also be made to the synced folders on your device.\n\n### Features\n* **Secure Global Access** - Your data is accessible anytime. Use a web browser or one of our powerful apps, available for all major platforms.\n* **End-to-End Encryption** - Unlike most other cloud storage providers, only you control who has access to your data. Not even MEGA can access it!\n* **Secure Collaboration** - Share data and communicate with your contacts securely, and see their updates in real time.\n* **Massive Storage Space** - Not only are we more secure than our major competitors, we also provide a more generous amount of free storage.\n* **Live Encrypted Backup** - With our real-time file synchronisation and versioning features, your data is always safe and recoverable.\n* **Public Source Code** - To enable independent verification of the correctness and integrity of our crypto model and its implementation, we publish the full source code of our client apps.\n\n##### Notes\n\n* The MEGAsync install is known to close all instances of Windows Explorer.  It can be reopened via **unelevated** CMD or PowerShell prompt by entering `explorer.exe`.\n* The MEGAsync client does not have a silent **uninstall**.  Two dialog windows appear confirming uninstallation.", "updated": "2024-03-23T19:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/megasync/4.12.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/megasync/4.12.2", "licenseUrl": "https://mega.nz/terms", "packageName": "megasync", "displayName": "Megasync", "summary": "Automated synchronization between your computer and your MEGA cloud", "version": "4.12.2", "icon": "https://cdn.jsdelivr.net/gh/meganz/MEGAsync@9239cbfe89a01d68e4be2b9a6a89511117d063f4/installer/app_ico.ico", "author": "Mega Limited", "downloadCount": 65599, "tags": ["megasync", "mega", "sync", "cloud", "storage", "synchronization", "client", "notsilent"]}