{"description": "MegaDownloader is a standalone, unofficial, download client for MEGA.CO.NZ, allowing you to easily download files from MEGA.CO.NZ \n\n## Why MegaDownloader?\n\n* Fast: You can download multiple files simultaneously with multiple connections per file, squeezing the bandwidth.\n* Lightweight: Takes up less than 2MB and consumes little resources. It doesn't create  giant temporary files. Just uses a small buffer in memory and stores the file directly in disk.\n* Secure: MegaDownloader does not show ads or banners when using it. It doesn't collect information from user. Only connects to MEGA.CO.NZ to download the files, and periodically checks for updates. Nothing else. And sensitive internal information is stored locally encrypted using DPAPI and AES.\n* Simple: Its interface is simple to use: add links and start downloading. That's all!\n* Complete: It allows pausing, stopping and resuming file downloads. It enqueues files, grouping them by packages, automatically decompresses RAR/Zip/7z files, detects links from the clipboard, can limit the download speed, is multilingual, can be controlled from the phone / remotely with its integrated web server, can be configured to automatically start or shut down the PC when finish, can reconnect in case of error, etc. Ah, and [you can watch videos online via streaming](http://megadownloaderapp.blogspot.com.es/2013/02/watch-videos-online-streaming-tutorial.html).", "updated": "2024-03-24T01:18:29Z", "galleryUrl": "https://community.chocolatey.org/packages/megadownloader/1.8", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/megadownloader/1.8", "licenseUrl": "https://github.com/teknowledgist/Chocolatey-packages/blob/master/manual/megadownloader/tools/LICENSE.txt", "packageName": "megadownloader", "displayName": "MegaDownloader (portable)", "summary": "A download client for MEGA.CO.NZ", "version": "1.8", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@3817646100fcd7d1cc9ca104eed6fdc18bf69d0f/Icons/megadownloader_icon.png", "author": "Andrew Soliño", "downloadCount": 755, "tags": ["megadownloader", "mega", "download", "links", "steganography", "streaming"]}