{"description": "Meinberg’s family of LANTIME NTP time servers offers flexible high performance, with proven reliability and advanced security features. With full IPv4 / IPv6 support validated in NTP time synchronization as well as the configuration interfaces (Web-based, SSH and SNMP), LANTIME time servers are designed to be deployed in networks of any size and industry. Users can assign several IP addresses and the system’s IP autoconf feature supports automatic configuration.\n\nThe GNU/Linux operating system of LANTIME SBCs (Single Board Computers) is optimized to ensure a high level of security and reliability. The system’s large display shows the state of the NTP subsystem. System configuration requires only a standard web browser to access the extensive but straightforward html interface. Alternatively, a text-based, menu-driven setup utility can be started from the shell prompt after logging into the unit via Telnet or SSH.\n\nLANTIME’s integrated security features ensure that time synchronization data can be reliably signed and secured by symmetric keys (MD5) and NTP autokey procedures. Clients are protected against manipulated time and man-in-the-middle attacks, verifying that NTP packets received were sent by the LANTIME system. Additionally, the entire LANTIME configuration can be completed using encrypted channels (e.g. SSH, HTTPS or SNMPv3). Flexible system management disables every unused or unneeded protocol to reduce possible points of attack.\n\nTo support network management systems, LANTIME time servers offer an extensive SNMP interface, accessible by SNMP V1, V2.c and V3. This allows the monitoring of all relevant system parameters, including operating system performance, network interface statistics, detailed IRIG, NTP or PTP status information, as well as the complete system configuration. The interface also can be used to alter the LANTIME configuration via SNMP set commands.\n\nBased on modular system architecture, flexible LANTIME time servers may be equipped with up to two additional Ethernet ports, including optional fiber optic network ports.", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/meinberg-ntp/4.2.8.15", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/meinberg-ntp/4.2.8.15", "licenseUrl": "https://www.meinbergglobal.com/english/sw/readme-ntpinstaller.htm#legal", "packageName": "meinberg-ntp", "displayName": "Meinberg NTP", "summary": "Meinberg’s family of LANTIME NTP time servers.", "version": "4.2.8.15", "icon": "http://cdn.rawgit.com/mikecole/chocolatey-packages/master/icons/meinberg-ntp.webp", "author": "MEINBERG Radio Clocks", "downloadCount": 6858, "tags": ["meinberg-ntp", "meinberg", "ntp", "time", "w32tm", "admin"]}