{"description": "Messenger Reviver is a messenger repair tool that allows use of Windows Live Messenger even after the migration to Skype.\nThis simple app can install working versions of Messenger 2012 or Messenger 2009 and also Revive (repair and modify) versions of Messenger 2012, 2011, and 2009 that are already installed.\nReviver checks to see if Messenger is currently installed, which versions can be modified, and if they need any new repairs.\nReviver will even know if Skype automatically removed Messenger. While Reviver will allow you to sign into Messenger for the time being, it will not extend past the full discontinuation date (estimated to be March 2014).\nReviver  will offer different options depending on whether or not Messenger is currently installed or if it was installed but removed by Skype.\nIn the first case you will be able to select from a list of detected versions of Messenger. If Messenger is not installed you can choose to install Messenger 2012 or 2009 (but not 2011) and pick from 47 supported languages.\nFinally, if Skype has removed Messenger you will be prompted to begin repairs to restore it.\nAll of these different processes are very simple and quick, allowing you to use Messenger again. The installations and repairs to the different versions of Messenger do not change or update the programs.\nThey still function the same as before. Thankfully Reviver is just a great and simple way to maintain your favorite version of Messenger without having to switch to Skype.", "updated": "2024-03-19T11:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/messengerreviver/2.2.5.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/messengerreviver/2.2.5.0", "licenseUrl": "http://en.wikipedia.org/wiki/Freeware", "packageName": "messengerreviver", "displayName": "Messenger Reviver", "summary": "Messenger Reviver is a messenger repair tool that allows use of Windows Live Messenger even after the migration to Skype.", "version": "2.2.5.0", "icon": "https://raw.github.com/tonigellida/chocolateyautomaticpackages/master/messengerreviver/messengerreviver.png", "author": "Jonathan Kay", "downloadCount": 3578, "tags": ["notSilent", "messenger", "msn", "chat", "skype"]}