{"description": "---\n\n### [choco://metax](choco://metax)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of MetaX](http://danhinsley.com/metax/784601_1.png)\n\t\n## Tag Your Movies To Look Perfect in iTunes, Apple TV or other Media Players\n\nWhen you want your movies to look as good as those purchased from iTunes, with cover art, descriptions, ratings, actors and more, you NEED MetaX.\n\nWith only a mouse click or two, MetaX will scour all the major sources of movie and TV information on the web: TVDB, TheMovieDB, iTunes as well as IMDB and Yahoo posters and display the information. You can select from multiple entries to get just the look you want, then quickly write the tags into the file so that it shows up in iTunes, Apple TV or whatever media play you use, just like it would if you had purchased the movie from iTunes.\n\nMetaX supports MP4, M4V, ASF, MOV, AVI, MKV and WMV files.\n\nNot all formats support all tags. AVI files in particular don't support most tags, including not supporting cover art.\n\n## Check out the MetaX YouTube channel\nThe [MetaX YouTube channel](https://www.youtube.com/channel/UCy17FLxMu1AIhb07017qepQ) has lots of instructional videos\n\n## Great for TV Shows\nBy using theTVDB you can tag an entire season of episodes with just a couple of clicks.\n\n## Set Ratings for Parental Control\nSet the rating of a show to allow parental controls to work. You can even use country specific ratings for the UK, Germany, France, Canada, Japan, New Zealand, Ireland and Japan.\n\n## Easy To Customize\nMetaX has lots of preferences that allow it to work the way you want it to. You can configure MetaX to copy the tagged file to a different location, set the filename or title based on information from the show (title, year, showName, season, episode and more). You can have MetaX pull the movie name or TV Show, season and episode number from the filename, you can save a copy of the untagged file, you can specify which data sources you want to use, and what order to display them in the search results, and have MetaX automatically update iTunes and MovieLibrary when it tags a file.\n\n## Import data from MyMovies or other XML files\nMetaX will import data from the MyMovies files, or from NFO files.\n\n## Find Great Cover Art\nYou can get cover art from any of the data sources (theMovieDB, theTVDb, iTunes, Amazon or Yahoo). You can also use files you've downloaded, use cut and paste from websites, and even select a frame from the movie itself!\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/metax/readme.md)**\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-23T09:03:44Z", "galleryUrl": "https://community.chocolatey.org/packages/MetaX/2.87.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/MetaX/2.87.0", "licenseUrl": "", "packageName": "MetaX", "displayName": "MetaX (Trial) (Install)", "summary": "Tag Your Movies To Look Perfect in iTunes, Apple TV or other Media Players", "version": "2.87.0", "icon": "http://danhinsley.com/metax/wpimages/wpf0af8252_06.png", "author": "Knowledge Design Software", "downloadCount": 4394, "tags": ["metax", "tagging", "video", "mp4", "m4v", "mov", "avi", "mkv", "wmv", "trial", "binary"]}