{"description": "![Screenshot of Metadata++](https://cdn.statically.io/gh/asheroto/ChocolateyPackages/01b7d0d897429e26aca74bea319ef2deab43da91/metadataplusplus/screenshot.png)\n\n[Metadata++](https://logipole.com/metadata++-en.htm) is a highly efficient tool tailored for managing metadata on 64-bit Windows 10/11 systems. It stands out for its remarkable speed and smooth user experience, ensuring quick navigation through directories, rapid directory reading, and fluid rendering of panels and thumbnails. Its portable version conveniently stores all configurations and settings in the same folder from which it is executed.\n\n### Performance Optimized\n- Fast and intuitive interface for efficient metadata management.\n\n### Broad Format Support\n- **Image/Photo Formats**: Supports nearly all image formats capable of carrying metadata including CR2, CRW, JPEG, PNG, TIFF, RAW, and WEBM.\n- **Audio Formats**: Supports a wide range of audio formats including MP3, MP4, OGG, and WAV.\n- **Video Formats**: Supports various video formats such as AVI, MP4, DivX, and WEBM.\n- **Text Formats**: Accommodates almost all text formats including XML, OOXML, PDF, and RTF.\n\n### Custom Sidecar Creation\n- Ability to create sidecars to house your custom metadata, even for files that traditionally don't support metadata. This feature allows you to rate any file format.\n\n### Additional Features\n- **Native UNICODE Display**: Ensures correct display of text and characters from any language.\n- **Search Plugin**: Enhances the ability to find and manage metadata across files.\n- **Multi-language Interface**: Available in English, French, Spanish, and Russian.\n\n### Easy Updates\n- No need to uninstall before updating; new updates install over old versions seamlessly. Just ensure all instances of Metadata++ are closed before installing an update.", "updated": "2024-03-17T16:48:27Z", "galleryUrl": "https://community.chocolatey.org/packages/metadataplusplus/2.5.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/metadataplusplus/2.5.1", "licenseUrl": "https://logipole.com/eula-en.htm", "packageName": "metadataplusplus", "displayName": "Metadata++", "summary": "Metadata++ is a fast and effective metadata viewer/editor with support for all common file formats.", "version": "2.5.1", "icon": "https://cdn.statically.io/gh/asheroto/ChocolateyPackages/eb9b246b/metadataplusplus/icon.png", "author": "Logipole", "downloadCount": 600, "tags": ["metadata++", "metadataplusplus", "metadatapp", "metadata", "editor", "viewer", "tool"]}