{"description": "MFilter is a filter plugin for the popular 7-Zip archiver designed to deliver higher compression ratios to certain multimedia file types by means of automatic pre-processing. The filter itself does not provide compression, and requires co-use of a compressing codec.\n\nSpecifically, here is what MFilter does over the files being compressed:\n\n- The filter recompresses jpeg files using Brunsli or Lepton methods. This also applies to embedded thumbnails and jpeg files attached to or embedded into other files, like pdf.\n- The filter performs delta encoding of the following raster graphic file types:\n  - uncompressed bmp\n  - pnm (ppm, pgm, pam)\n  - uncompressed tiff\n  - uncompressed dng\n  - uncompressed raw (3fr, arw, nef and others)\n  - uncompressed tga\n-The filter uses the WavPack method to compress wav-files with uncompressed PCM audio. The following file types are automatically identified and compressed:\n  - wav (including bwf/rf64 и Multiple Data Chunks (Legasy Audition Format) formats)\n  - caf (Core Audio Format)\n  - w64 (Sony Wave64)\n  - dff (Philips DSDIFF)\n  - dsf (Sony DSD stream)\n  - aif, afc (Аudio Interchange File Format, including AIFF-C format)\n  - sf2 (SoundFont)\n- The filter decodes data in BASE64 format.\n- The filter applies BCJ, ARM, ARMT, IA64, SPARC and PPC filters to the corresponding executables.", "updated": "2024-03-22T07:33:33Z", "galleryUrl": "https://community.chocolatey.org/packages/mfilter/1.1.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mfilter/1.1.2", "licenseUrl": "https://www.tc4shell.com/en/termsofuse/", "packageName": "mfilter", "displayName": "mfilter (Install)", "summary": "MFilter is a filter plugin for the popular 7-Zip archiver designed to deliver higher compression ratios to certain multimedia file types", "version": "1.1.2", "icon": "", "author": "Dec Software", "downloadCount": 410, "tags": ["mfilter", "7zip", "7-zip", "bmp", "pnm", "ppm", "pgm", "pam", "tiff", "dng", "raw", "tga", "wav", "caf", "w64", "dff", "dsf", "aif", "afc", "sf2"]}