{"description": "## Introduction\n\nThis tool is for parsing, decoding and logging information from the Master File Table ($MFT) to a csv. It is logging a large amount of data and that has been the main purpose from the very start. Having all this data in a csv is convenient for further analysis. It supports getting the $MFT from a variety of sources.\n\n## Details\n\nInput can be any of the following:\n\n    Raw/dd image of disk (MBR and GPT supported)\n    Raw/dd image of partition\n    $MFT extracted file\n    Reading of $MFT directly from a live system\n    Reading of $MFT by accessing \\.\\PhysicalDriveN directly (no mount point needed).\n    Reading of $MFT directly from within shadow copies.\n    $MFT fragments extracted from memory dumps or unallocated (see MFTCarver).\n    Single records extracted. See MftRcrd with the -w switch.\n\nThere is an option to choose which UTC region to decode for. For instance you have a disk image and the target system had a timezone configuration of UTC -9.30, then you can configure it like that and get the timestamps directly into UTC 0.00. Default is UTC 0.00, and if running on a live system, there is no need to do anything as timestamps are automatically set to UTC 0.00.\n\nThe format of output can be chosen. Currently it is possible to choose from:\n\n    All (will write to csv everything it can). Default set.\n    log2timeline: http://code.google.com/p/log2timeline/wiki/l2t_csv\n    bodyfile (v3.x): http://wiki.sleuthkit.org/index.php?title=Body_file\n\nIt is possible to parse broken/partial $MFT by configuring \"Broken $MFT\". This setting is necessary if for instance index number 0 is missing (the record for $MFT itself).\n\nAlso it is possible to configure the tool to skip fixups. This is something you may want if you are working on memory dumps. If so, you need to run MFTCarver on the memdump first. Then run mft2csv on the output file from MFTCarver. Must have both \"Broken $MFT\" and \"Skip Fixups\" configured in such a case.", "updated": "2024-03-21T06:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/mft2csv/2.0.0.49", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mft2csv/2.0.0.49", "licenseUrl": "https://github.com/jschicht/Mft2Csv/blob/master/LICENSE.md", "packageName": "mft2csv", "displayName": "Mft2Csv", "summary": "Extract $MFT record info and log it to a csv file.", "version": "2.0.0.49", "icon": "", "author": "Joakim Schicht", "downloadCount": 241, "tags": ["mft2csv", "mft", "to", "csv", "ntfs", "digital", "forensics", "incident", "response", "dfir"]}