{"description": "Microsoft Message Analyzer is a new tool for capturing, displaying, and analyzing protocol messaging traffic and other system messages. Message Analyzer also enables you to import, aggregate, and analyze data from log and trace files. It is the successor to Microsoft Network Monitor 3.4 and a key component in the Protocol Engineering Framework (PEF) that was created by Microsoft for the improvement of protocol design, development, documentation, testing, and support. With Message Analyzer, you can choose to capture data live or load archived message collections from multiple data sources simultaneously. \n\nMessage Analyzer enables you to display trace, log, and other message data in numerous data viewer formats, including a default tree grid view and other selectable graphical views that employ grids, charts, and timeline visualizer components which provide high-level data summaries and other statistics. It also enables you to configure your own custom data viewers. In addition, Message Analyzer is not only an effective tool for troubleshooting network issues, but for testing and verifying protocol implementations as well. \n\nPlease also visit Message Analyzer Team Blog (http://blogs.technet.com/MessageAnalyzer) for continued updates and helpful information.", "updated": "2024-03-23T13:33:26Z", "galleryUrl": "https://community.chocolatey.org/packages/microsoft-message-analyzer/1.4.0.20160625", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/microsoft-message-analyzer/1.4.0.20160625", "licenseUrl": "https://bitbucket.org/bartj/software_chocolateypackages/raw/HEAD/microsoft-message-analyzer/Message Analyzer Use Terms.rtf", "packageName": "microsoft-message-analyzer", "displayName": "Microsoft Message Analyzer", "summary": "Message Analyzer enables you to capture, display, and analyze protocol messaging traffic; and to trace and assess system events and other messages from Windows components.", "version": "1.4.0.20160625", "icon": "http://i.technet.microsoft.com/dynimg/IC677823.png", "author": "Microsoft", "downloadCount": 100782, "tags": ["admin", "microsoft", "message", "analyzer", "analyser", "wireshark", "network", "monitor", "packet", "trace", "sniff", "etw"]}