{"description": "Microsoft Teams is a messaging app for teams where all conversations, meetings, files, and notes can be accessed by everyone, all in one place. It's a place for collaboration and work to happen in the open.\n\nThe installed software is named:\n\n- \"Microsoft Teams classic\" for Windows 10 and Mac devices.\n- \"Micrsoft Teams classic (work or school)\" for Windows 11 devices.\n\nHere's why you should use it:\n\n- It's great.\n- It makes communicating one-on-one and with groups a snap.\n- Collaboration happens in real time.\n- Everything your team cares about (all your files, docs, contact info, and more) is in once place.\n\nThis package installs Microsoft Teams for all users using the MSI installer.\n\nThe Teams MSI will place an installer in Program Files. Whenever a user signs into a new Windows User Profile, the installer will be launched and a copy of the Teams app will be installed in that user's AppData folder. If a user already has the Teams app installed in the AppData folder, the MSI installer will skip the process for that user.\n\nSee https://docs.microsoft.com/en-us/MicrosoftTeams/msi-deployment for more information about how the MSI installer works (and is different to a regular Teams install).\n\n### Package Specific\n#### Package Parameters\nThe following package parameters can be set:\n\n * `/AllUser` - When you set this parameter, Teams Machine-Wide Installer appears in Programs and Features in Control Panel and in Apps & Machine-wide installer for VDI/WVD sessionhost.\n * `/AllUsers` - When you set this parameter, Teams Machine-Wide Installer appears in Programs and Features in Control Panel and in Apps & features in Windows Settings for all users of the computer. All users can then uninstall Teams if they have admin credentials on the computer.\n  * `/NoAutoStart` - When a user logs in to Windows, Teams is installed with the MSI and a shortcut to start Teams is added to the user's desktop. Teams won't start until the user manually starts Teams. After the user manually starts Teams, Teams automatically starts whenever the user logs in.\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install packageID [other options] --params=\"'/ITEM:value /ITEM2:value2 /FLAG_BOOLEAN'\"`).\n\neg.\n\n```\nchoco install microsoft-teams.install --params \"'/AllUsers /NoAutoStart'\"\n```\n\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n#### Package updates\n\nNew versions of this package are published automatically via the `update.ps1` script (viewable in the package source on GitHub).", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/microsoft-teams.install/1.7.0.6058", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/microsoft-teams.install/1.7.0.6058", "licenseUrl": "https://support.microsoft.com/en-us/office/microsoft-teams-subscription-supplemental-notice-60cc09bf-b02a-4a26-8e4a-ad697194bebf?ui=en-us&rs=en-us&ad=us", "packageName": "microsoft-teams.install", "displayName": "Microsoft Teams Classic Desktop App (Machine-Wide Install)", "summary": "Microsoft Teams helps your team work better together. It's one app that brings your team's conversations, meetings, files and notes together into a single place for open and seamless collaboration.", "version": "1.7.0.6058", "icon": "http://raw.githubusercontent.com/flcdrg/au-packages/master/microsoft-teams/icons/teams-logo.png", "author": "Microsoft Corporation", "downloadCount": 25181410, "tags": ["microsoft-teams", "teams", "office", "365", "chat", "collaboration", "slack", "admin"]}