{"description": "## Remark\n**microchip-studio is installed in 2 steps. The second step will be started automatically after a restart of the computer and will prompt you to install 2 certificates from:**\n- Microchip Technology, Inc.\n- Atmel Corporation.\n\n## Key Features\n- Support for 500+ AVR and SAM devices\n- Vast source code library, including drivers, communication stacks, 1,600+ project examples with source code, graphic services and touch functionality through Advanced Software Framework (ASF)\n- IDE extensions through Atmel Gallery, the online apps store, for development tools and embedded software from Microchip and third parties\n- Tune capacitive touch designs, validate system performance, monitor power consumption, and real-time data and trace graphing with Atmel QTouch Composer\n- Configure and test the performance of wireless designs with the Wireless Composer running on the target\n- Write and debug C/C++ and assembly code with the integrated compiler\n- Advanced debugging features include complex data breakpoints, nonintrusive trace support (SAM3 and SAM4 devices), statistical code profiling, interrupt trace/monitoring, polled data tracing (Cortex-M0+ devices), real-time variable tracking with optional timestamping.\n- Integrated editor with visual assist\n- Project wizard allowing projects created from scratch or from a large library of design examples\n- In-system programming and debugging provides interface to all Atmel in-circuit programmers and debuggers\n- Create transparent debug views into CPU and peripherals for easy code development and debugging\n- Full chip simulation for an accurate model of CPU, interrupts, peripherals, and external stimuli\n\nImportant Notes:\n  - microchip-studio needs a reboot to finish automatically the installation. After the restart, you will be prompted to install 2 certificates from:\n    - Microchip Technology, Inc.\n    - Atmel Corporation.\n  - microchip-studio shortcut icon will appear on the desktop after about 5/10 minutes after the restart.\n  - If you are upgrading from atmel-studio to microchip-studio, you may need to delete the following directories for each users was using atmel-studio:\n    - `$env:appdata\\Atmel\n    - `$env:localappdata\\Atmel\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/microchip-studio/screenshot.png)", "updated": "2024-03-22T23:18:26Z", "galleryUrl": "https://community.chocolatey.org/packages/microchip-studio/7.0.2594", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/microchip-studio/7.0.2594", "licenseUrl": "", "packageName": "microchip-studio", "displayName": "Microchip Studio", "summary": "Studio 7 is the integrated development platform (IDP) for developing and debugging all AVR® and SAM microcontroller applications. The Microchip Studio 7 IDP gives you a seamless and easy-to-use environment to write, build and debug your applications written in C/C++ or assembly code. It also connects seamlessly to the debuggers, programmers and development kits that support AVR® and SAM devices. Additionally, Studio includes Gallery, an online app store that allows you to extend your development environment with plug-ins developed by Microchip as well as third-party tool and embedded software vendors. Studio 7 can also seamlessly import your Arduino sketches as C++ projects, providing a simple transition path from Makerspace to Marketplace.", "version": "7.0.2594", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/microchip-studio/microchip-studio.png", "author": "Microchip Technology Inc.", "downloadCount": 309, "tags": ["microchip-studio", "integrated", "development", "platform", "idp", "AVR", "SAM", "microchip"]}