{"description": "![Screenshot of MightText for Chrome](https://lh6.googleusercontent.com/pR9wn__XWnYLDrqr3BBMTkCmXZEMN8rAkUHjclJ0otiGH1KmsCtloNHOSMTamirDkpDvXmoNU2s=s640-h400-e365-rw)\t\n\t\n###SMS from PC or Mac using your Android #. Sync Text Messages, Calls, Notifications, Photos, Battery Status\n\n* Send and Receive SMS Text Messages on your PC or Mac\n* Uses your CURRENT Android Phone Number\n* 100% Free\n* Get started in less than 60 seconds\n* Sync your phone's photos and videos instantly to MightyText\n* See your Android app notifications on your Computer (from any app - not just your sms app)\n* Sync your phone's MMS Picture Messages to your computer\n* Get low battery alerts on your computer (when your phone has low battery)\n\nStep #1:  INSTALL ANDROID APP on your phone: https://market.android.com/details?id=com.texty.sms\n\n\nNote -  MightyText Chrome extension will work well only AFTER successfully installing the MightyText Android App on your phone.  You can get the MightyText Android App here: \n\nhttps://play.google.com/store/apps/details?id=com.texty.sms\n\nSend and receive SMS text messages and MMS from Chrome using your current Android™ phone and number.\n\nYou can still send/receive texts on your phone as you normally would.\n\nMore features:\n\n* Get SMS Notifications on computer immediately when SMS hits phone\n* Missed call alert,call logs and SMS Popups\n* SMS Backup, MMS Backup\n\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-23T15:18:32Z", "galleryUrl": "https://community.chocolatey.org/packages/mightytext-chrome/19.6.20170115", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mightytext-chrome/19.6.20170115", "licenseUrl": "https://mightytext.net/tos", "packageName": "mightytext-chrome", "displayName": "MightyText for Chrome", "summary": "MightyText - SMS from PC and Text from Computer", "version": "19.6.20170115", "icon": "https://lh4.googleusercontent.com/AMN5GKiaK5seLYspNTjcHndWMrhTBsAmm_HD-5_H2s_xc4VJPedKL0i8c_zC0p1AISKjIZYB=s26-h26-e365-rw", "author": "MightyText", "downloadCount": 1269, "tags": ["mightytext", "sms", "text", "chrome", "extension"]}