{"description": "![screen shot of Millipede](http://pjsfreeware.synthasite.com/resources/millipede.png)\n\n*****************After Centipede came Millipede*****************\n\nThis game is freeware\nMillipede (c) PJ Crossley MMDCCLXIV\n\nThe Millipedes - consist of one or more attached segments which move horizontally through the playfield, moving one tile vertically when they hit the side of the screen, or a mushroom. Shoot a segment, and it will turn into a mushroom. If a centipede is split in half in this fashion, the segment behind the shot will form a head and you'll have two smaller centipedes to contend with. \nMushrooms - harmless to the touch, but take four shots to destroy. The player and centipedes can't move through them. \nPoison mushrooms - These don't kill anything. But, when a centipede hits a poison mushroom, they go straight down until they hit the bottom of the screen. \nSpiders - they come in from the side and scurry around the bottom half of the screen really fast, making wibbledy-wibbledy sounds. \nEarwig - they crawl through the top half of the screen and change mushrooms into poison mushrooms. \nbees - they occasionally drop through the screen, leaving a trail of mushrooms.\nMosquito are rarely a threat but collision kills the archer but if shot scroll the screen up a row which may cause bees to appear.\nBeetles kills player or if killed cause the screen to scroll down one line .\nKilling a inchworm slows down the game which may help you to clear the playing area.\nDDT spread poison  and can kill anything in its path.\n\n###Scoring:\n* Millipede segment: 10 points\n* Millipede head: 100 points\n* Spider: 300 points\n* Beetles: 300 points\n* Mosquitoes: 400 points\n* Bees: 200 points\n* Inchworm: 100 points\n* DDT Bombs: 800 points\n* Dragonflies: 500 points\n* Earwig: 1000 points\n* Mushroom: 1 point\n\n\n###Controls:\n* Arrow keys to move\n* Ctrl to fire\n* You can also use the mouse to play set from startup page\n\nGM7 06/11/13\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/millipede/readme.md)**", "updated": "2024-03-20T16:33:26Z", "galleryUrl": "https://community.chocolatey.org/packages/millipede/2013.11.10", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/millipede/2013.11.10", "licenseUrl": "", "packageName": "millipede", "displayName": "Millipede (Portable)", "summary": "PJ Crossley's remake of the classic Millipede game.", "version": "2013.11.10", "icon": "http://pjsfreeware.synthasite.com/resources/Rendered5.jpg", "author": "PJ Crossley", "downloadCount": 794, "tags": ["pjcrossley", "millipede", "retro", "game", "portable"]}