{"description": "An open source voxel game engine. Play one of our many games, mod a game to your liking, make your own game, or play on a multiplayer server.\n\n## Features\n### Players\n#### Choose from Multiple Games\nThere are many games to choose from. You could survive in a harsh environment, build creatively, or fight other players. Just download a game or connect to a server.\n\n#### Enormous Maps\nWith 62,000 × 62,000 × 62,000 blocks, there’s no running out of space. You can mine 31,000 blocks down, or build 31,000 blocks up.\n\n#### Multiplayer Support\nPlay by yourself, locally with your friends, or online with dozens of players on a server.\n\n#### Texture Packs\nNot happy with the look of the textures? Change them!\n\n#### Beautiful Map Generators\nChoose from many different fast map generators included in the engine, or install one as a mod.\n\n### Developers\nMake a Game\nCreate your own voxel game using our Lua API. No need to worry about tricky voxel rendering or networking; instead, write scripts to add items and control game play.\n\n#### Modding API\nUse the same Lua API to make mods for any Minetest-based game. Publish your mods on the forums, and contribute to others’ mods.\n\n#### Large Collection of Existing Mods\nThere are over 1,000 open source mods on our forums which are ready to be used, adapted or learned from.\n\n#### Friendly Community\nYou can find help with any problems on our forums or IRC channels.\n\n#### Open Source\nThe engine is open source and transparently developed. Submit an issue for anything you’re missing, or get the source code and dig into it yourself.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/minetest/screenshot.png)", "updated": "2024-03-22T11:18:31Z", "galleryUrl": "https://community.chocolatey.org/packages/minetest/5.8.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/minetest/5.8.0", "licenseUrl": "https://raw.githubusercontent.com/minetest/minetest/master/LICENSE.txt", "packageName": "minetest", "displayName": "Minetest", "summary": "An open source voxel game engine. Play one of our many games, mod a game to your liking, make your own game, or play on a multiplayer server.", "version": "5.8.0", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/minetest/minetest.png", "author": "The Minetest Team.", "downloadCount": 11734, "tags": ["minetest", "game", "minecraft", "mmorpg", "crafting", "survival"]}