{"description": "The ability to standardize and exchange health information and patient data is critical for healthcare organizations. NextGen Connect (formerly Mirth Connect) has been powering healthcare organizations for more than a decade. Designed for seamless healthcare message integration, this solution is easily configurable, easily deployed, and scalable. \n    \n#### Open source platform\n\nWith open source contributions from a global community of developers made over the course of 10 years, NextGen Connect (formerly Mirth Connect) helps you implement nearly all healthcare data exchange mechanisms.\n\n#### Cost-effective interoperability\n\nOur vendor-agnostic NextGen Connect Integration Engine delivers secure, cost-effective interoperability, enabling users to translate data into standardized formats while owning data management.\n\n#### Data where you want it\n\nOur valuable, cost-efficient HIT interoperability capabilities include full commercial support and an easy-to-use management control panel.\n\n#### Improved connections with direct messaging\n\nRegulatory requirements demand secure messaging and document exchange. Our vendor-agnostic, accredited HISP connects with your network of hospitals, providers, clinics, payers, and others.\n\n#### Better results with expert help\n\nOur experts will help you integrate and optimize your solutions, train efficiently and effectively, and―for Gold- and Platinum-level clients―provide 24x7 assistance for critical support issues.\n\n#### Enhanced skills with NextGen Connect training\n\nOur NextGen Connect fundamentals and advanced certification training courses enable users to improve their skills quickly and become a power user.\n\n#### Package details\n\nThis package installs Mirth Connect Server, Mirth Connect Server Manager and Mirth Connect CLI, but not the Mirth Connect Administrator Launcher", "updated": "2024-03-23T07:48:27Z", "galleryUrl": "https://community.chocolatey.org/packages/mirth/4.5.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mirth/4.5.0", "licenseUrl": "https://raw.githubusercontent.com/nextgenhealthcare/connect/development/server/docs/LICENSE.txt", "packageName": "mirth", "displayName": "Mirth Connect", "summary": "NextGen® Connect Integration Engine", "version": "4.5.0", "icon": "https://rawcdn.githack.com/flcdrg/au-packages/ce211e13b31785e6a8e06186f1a09c42002c7490/mirth/icons/mirth.png", "author": "Nextgen Healthcare", "downloadCount": 4551, "tags": ["mirth", "nextgen"]}