{"description": "Mission Planner is a ground control station for Plane, Copter and Rover. Mission Planner can be used as a configuration utility or as a dynamic control supplement for your autonomous vehicle. Here are just a few things you can do with Mission Planner:\n- Load the firmware (the software) into the autopilot board (i.e. Pixhawk series) that controls your vehicle.\n- Setup, configure, and tune your vehicle for optimum performance.\n- Plan, save and load autonomous missions into you autopilot with simple point-and-click way-point entry on Google or other maps.\n- Download and analyze mission logs created by your autopilot.\n- Interface with a PC flight simulator to create a full hardware-in-the-loop UAV simulator.\n- With appropriate telemetry hardware you can:\n  - Monitor your vehicle’s status while in operation.\n  - Record telemetry logs which contain much more information the the on-board autopilot logs.\n  - View and analyze the telemetry logs.\n  - Operate your vehicle in FPV (first person view).\n\n## Troubleshooting\n- Check that all the packages and their dependencies were installed, if one failed (e.g. due to network-related errors) try to reinstall it using --force or try a previous version...\n- You might need to install manually the drivers for your hardware, see https://firmware.ardupilot.org/Tools/MissionPlanner/driver.msi and/or https://firmware.ardupilot.org/Tools/WindowsDrivers.zip.\n\n## Package parameters\nThe following package parameters can be set:\n- `/InstallDir:INSTALLDIR` - Installation directory.\nTo pass package parameters, use `--params \"''\"` (e.g. `choco install missionplanner --params \"'/InstallDir:C:\\apps'\"`)", "updated": "2024-03-22T10:33:41Z", "galleryUrl": "https://community.chocolatey.org/packages/missionplanner/1.3.81", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/missionplanner/1.3.81", "licenseUrl": "https://github.com/ArduPilot/MissionPlanner/blob/master/COPYING.txt", "packageName": "missionplanner", "displayName": "Mission Planner", "summary": "Mission Planner is a full-featured ground station application for the ArduPilot open source autopilot project.", "version": "1.3.81", "icon": "https://cdn.statically.io/gh/lebarsfa/Packages/773923f/choco/icons/mpdesktop150.png", "author": "Michael Oborne", "downloadCount": 1089, "tags": ["missionplanner", "MAVLink", "ardupilot", "arducopter", "ardurover", "arduplane", "ardusub", "arduheli", "apmrover2", "antennatracker", "pixhawk", "apm", "ArduPilotMega"]}