{"description": "![Screenshot of Momentum for Chrome](https://lh3.googleusercontent.com/RJ4jnr30NkOL3zFByvWdY0JNWH_q7F4Up2I0RsRxV0m-N25MHB0IlwWg5GzCy3w-XiCK6yy_UA=s640-h400-e365-rw)\t\n\t\n###Replace new tab page with a personal dashboard featuring todo, weather, and inspiration.\n\nNew Tab page gives you a moment of calm and inspires you to be more productive. Set a daily focus, track your to dos, and get inspired with a daily photo and quote. Eliminate distractions and beat procrastination with a reminder of your focus for the day on every new tab load. Join over 1 million users and get inspired to create the life you want to live.\n\n###Featured by Tim Ferriss, BuzzFeed, TheNextWeb, Lifehacker, Reddit, Product Hunt, TheDailyMuse! ☆☆☆\n\n* To do list\n* Weather\n* Set a daily goal/focus/intention\n* New inspirational photo and quote each day\n* Subtle custom links and search\n* Return to default Chrome Tab from Links\n* Customize the dashboard by showing/hiding widgets\n* Feel good and get things done!\n\n\nABOUT PERMISSIONS\n\nLocation – Automatic weather setup only\nYahoo – Weather data only\n\nWe recognize that location sharing is a concern for many people (ourselves included) and it is a responsibility that we take very seriously.\t\n\n\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-21T08:34:20Z", "galleryUrl": "https://community.chocolatey.org/packages/momentum-chrome/0.92.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/momentum-chrome/0.92.2", "licenseUrl": "", "packageName": "momentum-chrome", "displayName": "Momentum for Chrome", "summary": "Momentum Chrome extension", "version": "0.92.2", "icon": "https://lh3.googleusercontent.com/JN1MwbErgQ_aepm_ln3cKM7WgJTg2iHk4Y8vSpM3IXPc4e1qES4SEp7vR25Qh0-mSG6Dh9htjQ=s26-h26-e365-rw", "author": "momentumdash.com", "downloadCount": 1234, "tags": ["momentum", "chrome", "extension"]}