{"description": "## Notes\nIt's a free trial of Moneydance, which is fully functional but limited to entering up to 100 manually entered transactions.\nTo purchase this product: https://infinitekind.com/purchase\n\n## Features\n### Online Banking\nMoneydance can automatically download transactions and send payments online from hundreds of financial institutions. It learns how to automatically categorize and clean up downloaded transactions.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/moneydance/screenshot1.png)\n\n### Summary\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/moneydance/screenshot2.png)\n\nThis is an overview of your finances. The information shown includes account balances, upcoming and overdue transactions and reminders, and exchange rate information. Clicking on an account or choosing an account from the drop-down account list will take you to the register for that account, where you can enter transactions or reconcile the account against a statement. Clicking on a transaction reminder will display a window where you can automatically record the transaction.\n\n### Graphs & Reports\nUse the graphing tool to generate visual reports of your income and expenses. Set the graph type, the date range, and any specific settings for the type of graph you desire. Pop-up balloons display more information about the data being graphed as you move the mouse pointer over different regions of the screen. Graphs can also be printed or saved to PNG image files.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/moneydance/screenshot3.png)\n  \n### Account Registers\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/moneydance/screenshot4.png)\n\nThe account register is used to enter, edit, and delete transactions in an account. It is visually similar to a paper checkbook register, but the calculation of balances and sorting of transactions is all done automatically. The payee auto-complete feature makes it easier to enter and categorize your transactions.\n\n### Reminders\nYou can set up a payment schedule for single or recurring transactions so you'll never miss a payment.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/moneydance/screenshot5.png)\n  \n### Mobile\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/moneydance/screenshot6.png)\n\nWhen you're on the go, you can use the Moneydance mobile app to enter or edit transactions and view balances. Changes are synced instantly and securely with your desktop. Available for free in the app store for your iPhone, iPad, and iPod touch. Now also available for your Android device free on the Play Store!\n\n### Investments\nFollow your investments and bring your portfolio into focus with support for stocks, bonds, CDs, mutual funds, and more. View the total value of your investment accounts or the performance of individual stocks and mutual funds over time. Stock splits and cost basis computations are a snap, and current prices can be downloaded automatically.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/moneydance/screenshot7.png)", "updated": "2024-03-23T18:18:37Z", "galleryUrl": "https://community.chocolatey.org/packages/moneydance/0.0.5064", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/moneydance/0.0.5064", "licenseUrl": "", "packageName": "moneydance", "displayName": "Moneydance", "summary": "Moneydance is easy to use personal finance software that is loaded with all the features you need: online banking and bill payment, account management, budgeting and investment tracking. Moneydance handles multiple currencies and virtually any financial task with ease.", "version": "0.0.5064", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/moneydance/moneydance.png", "author": "The Infinite Kind", "downloadCount": 2166, "tags": ["moneydance", "personal", "finance", "manager", "trial"]}