{"description": "# MongoDB Atlas CLI\nThe Atlas CLI is a unified command line tool for MongoDB Atlas. It can help you create, manage, and automate MongoDB Atlas resources from your command line.\n![atlascli-atlas-quickstart](https://user-images.githubusercontent.com/5663078/156184669-57c8ddce-6f0a-4e84-9311-2d996cb27942.gif)\n## Work smarter by letting your command line work harder.\nUse the Atlas CLI to create and manage MongoDB Atlas resources from your command line and easily automate them using scripts.\n## Familiar terminal interface\nIf you’re a developer or in DevOps, the terminal is your home turf. With the Atlas CLI you get a terminal-first experience so you can work with ease.\n## Unified and powerful control pane\nUse the Atlas CLI to manage not only your Atlas database but also other products in the MongoDB application data platform like Search, Data Lake, and Serverless databases.\n## Automate repeatable tasks\nUse scripts to automate common tasks like creating new users and clusters, cluster replication, managing network access, alerts ingestion, logs automation, and more.\n## Intelligent autocomplete\nGet up and running with confidence using supportive features such as autocomplete and guided workflows like the interactive Atlas quick start.\n## Usage\nTo get a list of available commands, run `atlas help`\nor check our documentation for more details.\n### Configuring Atlas CLI\nTo use `atlascli`, open your terminal, run `atlas auth login`, and follow the prompted steps.\n### Shell Completions\nIf you install via Chocolatey no additional actions are needed.\nTo get specific instructions for your preferred shell, run:\n```bash\natlas completion bash|zsh|fish|powershell --help\n```", "updated": "2024-03-23T15:33:27Z", "galleryUrl": "https://community.chocolatey.org/packages/mongodb-atlas/1.17.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mongodb-atlas/1.17.0", "licenseUrl": "https://www.apache.org/licenses/LICENSE-2.0", "packageName": "mongodb-atlas", "displayName": "MongoDB Atlas CLI", "summary": "The Atlas CLI is a unified command line tool for MongoDB Atlas", "version": "1.17.0", "icon": "https://webimages.mongodb.com/_com_assets/cms/l6p6e7hkjmr83g1wy-atlas-cli-icon.png", "author": "MongoDB", "downloadCount": 6398, "tags": ["atlascli", "mongodb", "atlas", "cli", "mongodb-atlas"]}