{"description": "MongoDB (from \"humongous\") is a scalable, high-performance, open source NoSQL database written in C++.\n\nMongoDB stores data using a flexible document data model that is similar to JSON. Documents contain one or more fields, including arrays, binary data and sub-documents. Fields can vary from document to document. This flexibility allows development teams to evolve the data model rapidly as their application requirements change.\n\nDevelopers access documents through rich, idiomatic drivers available in all popular programming languages. Documents map naturally to the objects in modern languages, which allows developers to be extremely productive. Typically, there’s no need for an ORM layer.\n\n#### Package Parameters\n\nThe following package parameters can be set:\n\n* `/dataPath:` - where MongoDB stores its database files - defaults to \"$env:ProgramData\\MongoDB\\data\\db\"\n* `/logPath:` - where MongoDB stores its logs - defaults to \"$env:ProgramData\\MongoDB\\log\"\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install packageID [other options] --params=\"'/ITEM:value /ITEM2:value2 /FLAG_BOOLEAN'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know [here](https://github.com/mkevenaar/chocolatey-packages/issues) that the package is no longer updating correctly.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/mongodb/7.3.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mongodb/7.3.0", "licenseUrl": "https://www.mongodb.com/legal/licensing/community-edition", "packageName": "mongodb", "displayName": "MongoDB", "summary": "Scalable, high-performance, open source NoSQL database written in C++", "version": "7.3.0", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@4106c5776d3ca53c63912a20b56fc3b41a535a43/icons/mongodb.png", "author": "MongoDB Inc", "downloadCount": 298470, "tags": ["cli", "database", "nosql", "admin"]}