{"description": "Why Moonshine?\n\n\t- Works with feature parity on the cloud model\n\n\tThe first IDE developed to provide cloud support for ActionScript 3 , Apache Flex®, Apache Royale® and Feathers. Now you can create your projects on the cloud and utilize the agility of a cloud based platform using Moonshine IDE.\n\n\t- 100% Cross Platform\n\n\tMoonshine is a cross platform open source application. With Moonshine you will find the luxury of developing anywhere on any platform.\n\n\t- Built specifically to focus on Apache Flex® and Royale®\n\n\tThe Apache Royale® is a continuation of the previous effort called FlexJS to produce a next-generation of the Apache Flex® SDK that enables developers to use MXML and ActionScript to generate HTML/JS/CSS applications which can run natively in browsers. The cross-compiled code can also be used in Apache Cordova® (Adobe PhoneGap) mobile applications.\n\n\t- Subversion support\n\n\tWe are providing SLIKSVN for subversion support because they provide a standalone command-line Subversion client for Windows. The installer contains all command line tools (svn, svnadmin, svnsync, svnserve, svnmucc) without application bindings or Apache modules. For more information please visit https://sliksvn.com/\n\n\t+ Ant build\n\n\t+ FDB debugger for debugging support\n\n\t+ TourDeFlex component to assist with teaching the Flex syntax\n\n\t+ Mobile application development support", "updated": "2024-03-22T01:18:24Z", "galleryUrl": "https://community.chocolatey.org/packages/moonshine-ide/3.3.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/moonshine-ide/3.3.2", "licenseUrl": "https://moonshine-ide.com/downloads/assets/LICENSE.MD", "packageName": "moonshine-ide", "displayName": "moonshine-ide (Install)", "summary": "Moonshine is a free and open source middleweight IDE built with ActionScript 3 for ActionScript 3, Feathers, Apache Flex®, Apache Royale® development with Cloud and Desktop support.", "version": "3.3.2", "icon": "https://moonshine-ide.com/downloads/assets/logo_new_1024.png", "author": "Moonshine IDE", "downloadCount": 456, "tags": ["moonshine-ide"]}