{"description": "## Overview\nMorseRabbit is a small utility designed to help you learn to tap and understand Morse Code.\n\nMorseRabbit has two training modes, each with 5 levels of difficulty:\n\n- Normal Mode: You are provided with a morse code sequence (both the visual and audible representation) and are expected to type in the correct word in time.\n- Reverse Mode: You are provided with an alphabetic sequence or a word, and are expected to tap the corresponding morse code.\n\nAfter you master the 5 training levels, you can continue your morse education with these lessons:\n\n- Lesson 6 - Words\nThis lesson uses dictionary words instead of random letters.\n- Lessons 7 and above\nIn these lessons you practice aspects of morse code that are beyond just knowing the alphabet. You can practice Prosigns (like the well known SOS), abbreviations and Q-Codes.\n\n## Usage\nIf you want to __Tap a morse sequence to see what word it generates:__\n\n- Stop the training if it is running.\n- Start tapping the Spacebar.\n- You may adjust the speed slider, to tell MorseRabbit how to listen to your taps.\n\nIf you want to __Practice in understanding morse code:__\n\n- Make sure the Reverse Training checkbox is clear.\n- Select a difficulty level.\n- Press the Start button.\n- Now, type the letters representing the morse code you hear.\n\nIf you want to __Practice morse code tapping:__\n\n- Make sure the Reverse Training checkbox is checked.\n- Select a difficulty level.\n- Press the Start button.\n- Now, use the spacebar to tap the morse code for the letter. Short press for a DIT, long press for a DAH.\n- Pressing backspace, left arrow or delete, will mark the word as failed.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/morserabbit/screenshot.png)", "updated": "2024-03-16T04:18:34Z", "galleryUrl": "https://community.chocolatey.org/packages/morserabbit/0.21", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/morserabbit/0.21", "licenseUrl": "", "packageName": "morserabbit", "displayName": "MorseRabbit", "summary": "MorseRabbit is a small utility designed to help you learn to tap and understand Morse Code.", "version": "0.21", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/morserabbit/morserabbit.png", "author": "Danny Ben Shitrit", "downloadCount": 379, "tags": ["morserabbit", "HAM", "radio", "amateur", "CW", "morse", "learn", "tutor"]}