{"description": "#### Graphical User Interface\n\nModern GUI with customizable color themes.\n\n\n#### Command Line Interface\n\nmpv.net supports mpvs property based command line switches.\n\n\n#### High quality video output\n\nVideo output that is capable of many features loved by videophiles, such as video scaling with popular high quality algorithms, color management, frame timing, interpolation, HDR, and more.\n\n\n#### On Screen Controller\n\nPlay controls with a modern flat design.\n\n\n#### GPU video decoding\n\nLeverages the FFmpeg hwaccel APIs to support DXVA2 video decoding acceleration.\n\n\n#### Active development\n\nmpv.net is under active development.\n\n\n#### Based on libmpv\n\nmpv.net is based on libmpv which offers a straightforward C API that was designed from the ground up to make mpv usable as a library and facilitate easy integration into other applications. mpv is like VLC not based on DirectShow or Media Foundation. \n\n\nFeatures\n--------\n\n- High degree of mpv compatibility, almost all mpv features are available\n- Customizable context menu defined in the same file as the key bindings\n- Config dialog\n- Shorcut key editor\n- Global hotkeys\n- Many features like the config editor and shortcut key editor are fully searchable\n- Configuration files that are easy to read and edit\n- Command palette to quickly find commands and keys\n- Modern graphical user interface with customizable color themes\n- Extension API for .NET languages (C#, VB.NET and F#)\n- Scripting API for C#, Lua, JavaScript and PowerShell\n- JSON IPC to control the player with a external programs\n- On Screen Controler (OSC, play control buttons) with modern flat design\n- Command Line Interface\n- Started from a terminal status and debug output is printed on the terminal\n- DXVA2 video decoding acceleration\n- Video output capable of features loved by videophiles, such as video scaling with popular high quality algorithms, color management, frame timing, interpolation, HDR, and more\n- File search feature powered by the popular search and index tool Everything\n- Browser extensions to start mpv.net from the browser\n- Fast seek performance\n- Fast startup performance\n- Usable as video player, audio player and image viewer with a wide range of supported formats\n- Built-in decoders, no external codecs have to be installed\n- Setup as x64 installer, portable and Chocolatey\n- Build-in media streaming (requires youtube-dl being installed)\n- File associations can be created by the setup and from the player\n- External audio and subtitle files can be loaded manually or automatically\n- Screenshot feature\n- File history feature to log time and filename\n- Watch later feature to save the position\n- Files can be enqueued from File Explorer\n- Update check and update routine", "updated": "2024-03-24T00:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/mpv.net/7.1.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mpv.net/7.1.1.0", "licenseUrl": "https://raw.githubusercontent.com/mpvnet-player/mpv.net/master/License.txt", "packageName": "mpv.net", "displayName": "mpv.net", "summary": "mpv.net is a modern media player for Windows that works just like mpv.", "version": "7.1.1.0", "icon": "https://rawcdn.githack.com/C4illin/Choco-Packages/d66d2b22e65f687dff722e8d898b1b56673ca951/mpvnet.install/icon/mpvnet-icon.png", "author": "Frank Skare (stax76)", "downloadCount": 3588, "tags": ["video-player", "audio-player", "libmpv", "youtube-dl", "media-player", "mpv", "mediainfo"]}