{"description": "# Maintainer Note\n\nWhat's the difference between this package and `mpvio`? None, but this package is stuck following a now defunct version scheme of mpv.  \nWhy does the `mpv` package use a different version than the official project? Long ago, the Windows builds of mpv were provided by a contributor who made Windows specific changes to mpv. Since the chocolatey package was following that specific build, it made sense (at the time) to mirror that build's version scheme.\n\n\n# mpv\n\na free, open source, and cross-platform media player\n\n![](https://cdn.jsdelivr.net/gh/aeliussaionji/chocopkgs@97b5178c6416b601511ccbf3d050f0387c33680b/icons/mpv-screenshot-34cd36ae.jpg)\n\n\n## Overview\n\nmpv is a free (as in freedom) media player for the command line. It supports a wide variety of media file formats, audio and video codecs, and subtitle types. \n\n\n### Scripting \n\nPowerful scripting capabilities can make the player do almost anything. There is a large selection of [user scripts on the wiki](https://github.com/mpv-player/mpv/wiki/User-Scripts). \n\n\n### On Screen Controller \n\nWhile mpv strives for minimalism and provides no real GUI, it has a small controller on top of the video for basic control. \n\n\n### High quality video output \n\nmpv has an OpenGL, Vulkan, and D3D11 based video output that is capable of many features loved by videophiles, such as video scaling with popular high quality algorithms, color management, frame timing, interpolation, HDR, and more. \n\n\n### GPU video decoding \n\nmpv can leverage most hardware decoding APIs on all platforms. Hardware decoding can be enabled at runtime on demand. \n\n\n### Embeddable \n\nA straightforward [C API](https://github.com/mpv-player/mpv/blob/master/libmpv/client.h) was designed from the ground up to make mpv usable as a library and facilitate easy integration into other applications. \n\n\n### Active development \n\nmpv is under active development, focusing on code refactoring and cleanups as well as adding features. Want a feature? [Post a patch or request it!](https://github.com/mpv-player/mpv/issues)", "updated": "2024-03-24T00:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/mpv/2023.12.10", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mpv/2023.12.10", "licenseUrl": "http://www.gnu.org/licenses/gpl-2.0.html", "packageName": "mpv", "displayName": "mpv", "summary": "a free, open source, and cross-platform media player", "version": "2023.12.10", "icon": "https://cdn.jsdelivr.net/gh/aeliussaionji/chocopkgs@97b5178c6416b601511ccbf3d050f0387c33680b/icons/mpv.png", "author": "mpv team", "downloadCount": 218300, "tags": ["mpv", "video", "media", "player", "multimedia"]}