{"description": "Master Password is a completely new way of thinking about passwords.\n\nIt consists of an algorithm that implements the core idea and applications for various platforms making the alogirthm available to users on a variety of devices and platforms.\n\n#### Benefits of using Master Password:\n\n* You don't need to think up a new strong password every time you make a new account - Master Password gives you the key for it.\n* You don't need to try remembering a password you created two years ago for that one account - Master Password gives you the key for it.\n* You don't need to try to keep password lists in sync or stored somewhere easily accessible - Master Password keys can be created anywhere.\n* You don't need to trust that a service will be online and stay online - Master Password is availale everywhere, even offline.\n* If you feel at risk of your device being stolen or confiscated, you can set a fake master password, delete my user or wipe it worry-free.\n* You don't need to worry about your password manager website getting hacked, your phone getting duplicated, somebody taking a picture of your passwords book - Master Password stores no secrets.\n\nMaster Password users have no more passwords. They have a password. Their password is their single master key for unlocking all doors.\n\nThe details of how Master Password works [are available here](https://masterpassword.app/masterpassword-algorithm.pdf).\n\n#### One, two, enter.\n\nThere are about three steps to using Master Password:\n\n1. Enter your master password.\n2. Enter the name of the site.\n3. View or copy/paste the generated (not stored!) password.\n\n# Master Password is no longer actively maintained.\n\nMaster Password is announcing a massive rewrite, modernizing the solution and clearing the way for exciting new capabilities.\n\nThe project is re-launching as [Spectre](https://spectre.app/), still fully open-source Free Software\n\nAll development effort has moved to the [Spectre project](https://gitlab.com/spectre.app) which as of the creation of this package does not have a Windows desktop option.", "updated": "2024-03-15T02:33:22Z", "galleryUrl": "https://community.chocolatey.org/packages/mpw.portable/2.7.12", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mpw.portable/2.7.12", "licenseUrl": "https://gitlab.com/MasterPassword/MasterPassword/blob/master/LICENSE", "packageName": "mpw.portable", "displayName": "MasterPassword Java-Gui", "summary": "A stateless password management solution.", "version": "2.7.12", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@7576aa4399e39c496babc2c49bbd3b27baeba10c/Icons/mpw_icon.png", "author": "Maarten Billemont", "downloadCount": 2032, "tags": ["MasterPassword", "password", "mpw", "security", "portable", "stateless", "spectre", "FOSS", "embedded"]}