{"description": "Downloads the installer for SQL Server 2014 Express Edition Service Pack 1 With Tools. \n\nPackage Specifics\n=================\nThe package uses default installation options for SQL Express.  It will also install .NET Framework 3.5 (if necessary) which is required for this package.                  \n\nPackage Parameters\n------------------\nThe following optional package parameters can be set (defaults will be used if no parameters are set):\n\n* '/INSTANCEID'             - specifies the SQL instance ID (default is SQLEXPRESS)\n* '/INSTANCENAME'           - specifies the SQL instance name (default is SQLEXPRESS)\n* '/SECURITYMODE'           - specifies the SQL security mode (SQL), if this parameter is not supplied, then Windows-only authentication mode is supported.  \n* '/SAPWD'                  - specifies the password for the SQL Server 'sa' account (required when /SECURITYMODE=SQL and ignored otherwise)\n* '/SQLSYSADMINACCOUNTS'    - specifies the logins to be members of the 'sysadmin' role\n* '/SQLSVCACCOUNT'          - specifies the startup account for the SQL service\n* '/SQLSVCPASSWORD'         - specifies the password for the 'SQLSVCACCOUNT' \n* '/SQLCOLLATION'           - specifies the collation settings for SQL server. For more information see \"https://msdn.microsoft.com/library/ms143508(v=sql.105).aspx\"            \n* '/SQLSVCSTARTUPTYPE'      - specifies the SQL Server service statup type - Automatic, Disabled or Manual (default  is 'Automatic')\n* '/BROWSERSVCSTARTUPTYPE'  - specifies the SQL Server Browser service startup mode - Automatic, Disabled or Manual (default is 'Manual')\n            \nNOTE: The current user is ALWAYS added to the SQL Server 'sysadmin' fixed server role regardless of the /SECURITYMODE parameter.\n    \nThese parameters can be passed to the installer with the use of '-params'.\nFor example: -params '\"/INSTANCEID:SQLEXPRESS /INSTANCENAME:SQLEXPRESS2014\"'\n\nThe default SQL Server Express 2014 installation parameters are (when no package parameters are specified):            \n\"/Q /IAcceptSQLServerLicenseTerms /ACTION=install /UPDATEENABLED /TCPENABLED=1 /NPENABLED=1 /SQLSVCSTARTUPTYPE=Automatic /INSTANCEID=SQLEXPRESS /INSTANCENAME=SQLEXPRESS\"\n\nRefer to \"https://msdn.microsoft.com/en-us/library/ms144259(v=sql.120).aspx\"  for further information with regards to the 'Installation Parameters'.", "updated": "2024-03-21T13:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/mssqlexpress2014sp1wt/1.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mssqlexpress2014sp1wt/1.1.0", "licenseUrl": "", "packageName": "mssqlexpress2014sp1wt", "displayName": "Microsoft SQL Server 2014 Express Edition Service Pack 1 With Tools", "summary": "SQL Server 2014 Express Edition Service Pack 1 With Tools", "version": "1.1.0", "icon": "", "author": "Microsoft", "downloadCount": 2734, "tags": ["Microsoft", "SQL", "Express", "admin"]}