{"description": "Multi Commander is a multi-tabbed file manager and is an alternative to the standard Windows Explorer. It uses the very popular and efficient dual-panel layout.\n\nMulti Commander has everything you need in your daily work with files to increase your speed and efficiency.\n\nIt has all the standard features that any file manager has, like copy, move, rename, view. But Multi Commander's big strengths are the special features that allow you to accomplish advanced tasks with ease. Tasks such as Auto-unpacking; Auto-sorting; Browsing inside archives; Editing the Windows Registry and accessing FTP; Searching for and Viewing files and pictures. There is also powerful, built-in Scripting support that allows you automate many tasks and expand its functionality. It allows you to do everything from the keyboard using shortcuts so that you can work quickly and efficiently.\n\n\nFeatures\n\nMulti Commander packed with so many features\n\n\nFast and Efficient File Management\n    Dual pane tabbed interface. Work with multiple folders open.\n    Caching that enable fast file browsing. Easily handle folders with many thousands of files.\n    Browse with ease. Show files in Detailed, List, or Thumbnail modes. Use powerful filters to limit what you want to view.\n    Background work for all tasks that take time to finish, allowing you to continue working without interruption.\n    Fast Operation. Use the mouse and drag and drop or use quick keyboard commands for all tasks.\n    Remember all your selections when you return from browsing another location in the filesystem.\n    Browse archives (Zip, 7-Zip, Rar, Tar, gz, bz2 )\n    Powerful and flexible file search.\n    View and change file permissions. Take ownership of files.\n\nCustomizable and Extensible\n    Customize layout and colors to suit your styling needs.\n    Powerful script engine allowing you to create scripts to automate tasks.\n    Extensions and plug-ins that expand the functionality of Multi Commander.\n    Open API for developers (SDK) to create extensions and plug-ins.\n\nMultimedia\n    Picture tools to convert/rotate images, view/remove EXIF tags, adjust EXIF Date.\n    Internal picture viewer for Jpg, Gif, Png, Bmp, Tiff and many RAW formats.\n    Show movie information from IMDB and Rotten Tomatoes as extra columns on your movie files.\n    Audio tools to view audio file properties, view and/or edit MP3 Tags.\n\nAdvanced\n    File Operation plug-ins that can automatically sort or unpack files when they are moved or copied.\n    MultiRename tool for the fast and safe renaming of multiple files/Folders: rule-based and supports Undo.\n    File viewer that lets you view files of any size with minimal memory usage. View as ASCII/Unicode/UTF8/Binary and Hex.\n\nNetwork Features\n    FTP viewed as a virtual filesystem (with SSL/TLS support).\n    Browse network servers and shares.", "updated": "2024-03-23T20:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/MultiCommander/13.5.0.2983", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/MultiCommander/13.5.0.2983", "licenseUrl": "https://multicommander.com/Docs/License", "packageName": "MultiCommander", "displayName": "MultiCommander (Install)", "summary": "Multi Commander is a multi-tabbed file manager and is an alternative to the standard Windows Explorer. It uses the very popular and efficient dual-panel layout.", "version": "13.5.0.2983", "icon": "https://cdn.jsdelivr.net/gh/bibimagic/Mathias_Svensson-MultiCommander/MultiCommander.png", "author": "Mathias Svensson", "downloadCount": 28112, "tags": ["MultiCommander", "commander", "filemanager", "file", "manager", "explorer", "dual-panel", "multi-tabbed"]}