{"description": "### Package Specific\n\nThis package allows configuring multipass via either of the two supported hypervisors. \nHyper-V (and it's dependant Optional Windows Features) will be enabled if supported by your operating system. The version of Hyper-V supported by Multipass requires Windows 10 Professional/Enterprise build version 17134 or later.\nVirtualBox must be preinstalled as it will not be installed with this package. If set to use VirtualBox, This package will set the driver to user VirtualBox, but other configuration may be necessary depending on your setup.\n\n#### Package Parameters\n\nThe following package parameter can be set:\n    \n * `/HyperVisor:` - Accepts 'VirtualBox' or 'Hyper-V' (default)\n    \nTo pass parameters, use `--params \"''\"` (e.g. `choco install multipass [other options] --params=\"'/HyperVisor:VirtualBox'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n#### Multipass\n\nMultipass is a lightweight VM manager for Linux, Windows and macOS. It's designed for developers who want a fresh Ubuntu environment with a single command. It uses KVM on Linux, Hyper-V on Windows and HyperKit on macOS to run the VM with minimal overhead. It can also use VirtualBox on Windows and macOS. Multipass will fetch images for you and keep them up to date.\n\nSince it supports metadata for cloud-init, you can simulate a small cloud deployment on your laptop or workstation.\n\n#### Uninstall\n\nThis package attempts to clean up files related to multipass by running it's uninstall.exe, but will not uninstall the hypervisor.", "updated": "2024-03-23T19:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/multipass/1.13.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/multipass/1.13.0", "licenseUrl": "https://github.com/canonical/multipass/blob/main/LICENSE", "packageName": "multipass", "displayName": "Multipass", "summary": "Multipass orchestrates virtual Ubuntu instances", "version": "1.13.0", "icon": "https://rawcdn.githack.com/canonical/multipass/a5e5391bf8d9ce2dcfa4af087587fcfd1c226152/data/multipass.gui.svg", "author": "Canonical Ltd", "downloadCount": 19988, "tags": ["multipass", "VM", "Hyper-V", "virtualbox", "ubuntu"]}