{"description": "## The Ultimate Music Manager and Player\n\nMusicBee makes it easy to manage, find, and play music files on your computer. MusicBee also supports podcasts, web radio stations and SoundCloud integration\nMusicBee makes it easy to organize, find and play music files on your computer, on portable devices and on the web.\n\n### Simple, Powerful, and Fast\n\nPlay your music the way you want. Turn your computer into a music jukebox. Use auto-tagging to clean up your messy music library. Enjoy a great music experience with MusicBee.\n\n### Sound Quality Matters\n\nWhether you play your music on an audiophile setup or on a laptop, MusicBee is designed with features to fulfill all your needs.\n\n### Beautiful Skins\n\nChange the appearance of MusicBee by choosing from the included skins or download more from our Add-on section.\nSkins are a great way to personalize MusicBee to your liking.\n\nYou can also make your own skin and share it with others.\n\n### Sync with Devices\n\nSync your music collection with devices you use. MusicBee supports playlist and podcast syncing, even supports audio books with 2 way syncing.\nConvert formats on the fly if your device does not support certain formats.\n\nYou can also sync your Android and Windows Phone (8.1+) devices.\n\n### Groove Music Support\n\nMusicBee has native support for Groove Music (formerly Xbox Music). You can stream directly from MusicBee or add to your existing playlist, get song recommendations from the vast Groove catalog.\n\nWant to listen to a song before buy? You can listen to preview.\n\n### last.fm, CD Ripping, Tagging tools.... plus more\n\nMusicBee packs a comprehensive set of features to make your music experience better.\n\nYet it is one of the most lightweight player using about 25-70 MB ram* with skins and add-ons, and packs all of these under 10 MB!\n\n*Tested with MusicBee 3 with a library of 200 albums, sized around 3GB.\n\n### The Best.... rated by reviewers and users\n\nMusicBee is rated one of the best music managers and players available for Windows. It packs features that will WOW you.\n\nWe have a dedicated thread for users to share their experience or check reviews from trusted sources.\n\nStart using MusicBee today. You will never go back.\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-23T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/musicbee/3.5.8698", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/musicbee/3.5.8698", "licenseUrl": "http://musicbee.wikia.com/wiki/FAQ", "packageName": "musicbee", "displayName": "MusicBee", "summary": "MusicBee makes it easy to organize, find and play music files on your computer, on portable devices and on the web.", "version": "3.5.8698", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@6b72cf334ff8fef0fb86aad0c1534f68a42a9855/icons/musicbee.png", "author": "Steven Mayall", "downloadCount": 64012, "tags": ["admin", "musicbee", "audio", "music", "player", "media", "mp3", "tagger"]}