{"description": "My Family Tree has been carefully designed to help you quickly create your family tree using a simple and intuitive interface. For those just starting out investigating their family history, it provides an easy way to visualise and share your family tree with photos, stories and basic facts about each person.  More experienced genealogists will find full support for citations and evidence and options to transfer data using the GEDCOM file format.\n\n## Features\n\n### Family charts\nBuild interactive family charts with full support for multi touch pan and zoom.  Use the novel date perspective feature for viewing charts at different points through history.\n\n### Document with tick icon Open Standards\nHighly compatible with GEDCOM supporting both import and export and full support for ANSEL text encoding.\n\n### Globe icon Localisation\nMy Family Tree has been translated into over 20 languages with spell check support for many more.\n\n### Document with text icon Reports\nGenerate over 20 types of customisable web reports from family groups to personal timelines.\n\n### Data grid icon Data grid\nEdit data in bulk using data grids with advanced filtering.  Search using phonetic \"sounds like\" matching.\n\n### Ease of access icon Accessibility\nFull support for accessibility features including high DPI displays, zoom, high contrast themes, colour filters, screen readers, keyboard navigation, and the OpenDyslexic font.\n\n### Image icon Multimedia\nScan documents and photos directly into your family tree.  View, tag and print multimedia files directly from My Family Tree.\n\n### Book icon Evidence\nMy Family Tree makes it simple to record sources and citations for all of the information stored in your family tree.\n\n### Printer icon Printing\nPrint your tree as a large multipage tiled chart or save it as an image or pdf file.\n\n### Data base icon Database\nStore all your family tree information, and multimedia in a single compact file for easier portability.\n \n### Graph icon Statistics\nAnalyse family statistics on births, deaths and marriages and view all family events in an interactive timeline.\n\n### Tools icon Tools\nCheck who's related to who with the relationship calculator and detect data discrepancies including ancestral loops.\n\n### Lock icon Privacy\nMy Family Tree allows you to protect and backup your data with encryption.  You can use privacy settings to control the information exported in reports and print outs.\n\n### Map icon Mapping\nGeocode places in your tree and view where events happened on an interactive map.  You can also export place information for use in advanced mapping services.\n\n### Calendar icon Dates\nAdvanced date input with full support for partial dates, date ranges and text only dates.  Enter dates in one of 23 calendars and display them in a localised format.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/myfamilytree/screenshot.png)", "updated": "2024-03-23T18:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/myfamilytree/14.0.4.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/myfamilytree/14.0.4.0", "licenseUrl": "https://chronoplexsoftware.com/myfamilytree/eula/index.htm", "packageName": "myfamilytree", "displayName": "My Family Tree", "summary": "My Family Tree is a genealogy application for Windows®.", "version": "14.0.4.0", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/myfamilytree/myfamilytree.png", "author": "CHRONOPLEX SOFTWARE", "downloadCount": 14432, "tags": ["myfamilytree", "genealogy", "family", "tree"]}