{"description": "## ⚡ Lightweight & Efficient\nWe put design first and ironed out the technical details of using digital money, so you can get back to business.\n      \nThere's no Monero blockchain node to run. The MyMonero server does the heavy lifting for free. Forget spending days syncing the blockchain from your phone while waiting in line to pay for coffee. Get your entire transfer history instantly on any device with only your seed words.\n\n##  🔏 Be Your Own Bank\nSend funds from anywhere, to anywhere, anytime.\nNo bank fees, no processing delays, no holds—ever.\n\nMyMonero is safe and secure. The server can't withdraw funds on your behalf because your spend key never leaves your computer.\n\n##  🤓 Smart\nA built-in rolodex keeps your private addresses, payment IDs, and yes, even OpenAlias addresses in order.\n\n##  😎  Native Privacy\nWe take privacy and security seriously: we support Monero natively because it maintains the strongest privacy technology in any digital currency.\n\nMyMonero was founded in 2014 by Monero project steward Riccardo Spagni (aka fluffypony) and was developed with the assistance of the Monero Core Team.\n\nOur developers are Monero core contributors and our apps are all open source on GitHub.\n\nYour app data is saved locally under strong encryption and only your \"view key\" is shared with the server. We keep no logs. You can also connect to your own server under Preferences.\n\n#### Package updates\n   \nNew versions of this package are published automatically via the `update.ps1` script (viewable in the package source on GitHub).", "updated": "2024-03-16T17:03:26Z", "galleryUrl": "https://community.chocolatey.org/packages/mymonero/1.3.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/mymonero/1.3.3", "licenseUrl": "https://github.com/mymonero/mymonero-app-js/blob/master/LICENSE.txt", "packageName": "mymonero", "displayName": "MyMonero", "summary": "The simplest way to use the next-generation private digital currency Monero, at the sweet spot between security, convenience, and features", "version": "1.3.3", "icon": "https://cdn.jsdelivr.net/gh/mymonero/mymonero-app-js@5c7455d30e4e20150962f5f74efd83477962a05e/build/icon.png", "author": "MyMonero (PTY) LTD", "downloadCount": 95, "tags": ["monero", "electron", "crypto", "wallet", "xmr"]}