{"description": "## Prerequisites\n**Java needs to be installed to install and use MyOpenLab.**\n\n## What is MyOpenLab?\nMyOpenLab is a Java-based software, which contains graphic blocks, each one fulfills a specific function and has properties configurable by the user, these components can be joined together to implement in a simple way the graphical part and The logic of an application.\n\n## Implemented interfaces\nThe software integrates elements to communicate with the most commercial platforms like Arduino®, Raspberry PI®, Android® and devices with Serial Communication.\nInterfaces are included as users make suggestions on the available communication channels such as the Facebook page, the YouTUBE channel, and the Forum.\n\n## MyOpenLab Community\nShare your experiences with the community of users!\nYou Can Use the forum in Spanish, English and other Languages with the participation of the developers.\nYou Can Access as a Guest to consult publications of different topics or register for a better experience!\n\nThe project was initiated by Carmelo Daniel Salafia-German Developer who designed and developed the project for several years, being the main developer until the middle of the year 2017 when he decided to transfer the development of the project to Engineer Javier Velásquez, who is currently the lead developer.\nThe distribution of the software has several examples of the use of the elements to make it easier for users to understand the logic of this program.\nUsers of this software do not necessarily have to be advanced programmers, but they must have a basic level of programming concepts.\nThe Project has been developed with Java® and Netbeans® and therefore run on different platforms if there are no hardware dependencies.\nThe software is available in German, English and Spanish.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/myopenlab/screenshot.png)", "updated": "2024-03-22T18:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/myopenlab/3.11.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/myopenlab/3.11.0", "licenseUrl": "", "packageName": "myopenlab", "displayName": "MyOpenLab", "summary": "Java® based Software for Graphical Programming.", "version": "3.11.0", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/myopenlab/myopenlab.png", "author": "Javier Velásquez", "downloadCount": 701, "tags": ["myopenlab", "java", "graphical", "programming"]}