{"description": "# NanaZip\n      NanaZip is an open source file archiver intended for the modern Windows \n      experience, forked from the source code of well-known open source file archiver\n      7-Zip.\n      \n      **All kinds of contributions will be appreciated. All suggestions, pull \n      requests and issues are welcome.**\n      \n      ## Features\n      \n      - Inherit all features from 7-Zip 22.01.\n      - Packaging with MSIX for modern deployment experience.\n      - Support the context menu in Windows 10/11 File Explorer.\n      - Enable NSIS script decompiling support for the NSIS archives. (Merged from \n        [7-Zip NSIS branch](https://github.com/myfreeer/7z-build-nsis).)\n      - Provide 7-Zip execution alias for helping users to migrate to NanaZip.\n      - Support the Brotli, Fast-LZMA2, Lizard, LZ4, LZ5 and Zstandard codecs. (Merged \n        from [7-Zip ZS branch](https://github.com/mcmilk/7-Zip-zstd).)\n      - Support the Per-Monitor DPI-Aware for all GUI components.\n      - Support the i18n for GUI edition of Self Extracting Executable.\n      - Integrate the following HASH algorithms to NanaZip from RHash (AICH, BLAKE2b,\n        BTIH, ED2K, EDON-R 224, EDON-R 256, EDON-R 384, EDON-R 512, GOST R 34.11-94, \n        GOST R 34.11-94 CryptoPro, GOST R 34.11-2012 256, GOST R 34.11-2012 512, \n        HAS-160, RIPEMD-160, SHA-224, SHA3-224, SHA3-256, SHA3-384, SHA3-512, \n        Snefru-128, Snefru-256, Tiger, Tiger2, TTH, Whirlpool) and xxHash \n        (XXH3_64bits, XXH3_128bits).\n      - Enable Control Flow Guard (CFG) to all target binaries for mitigating ROP \n        attacks.\n      - Mark all x86 and x64 target binaries as compatible with Control-flow \n        Enforcement Technology (CET) Shadow Stack.\n      - Strict handle checks at runtime to block the use of invalid handles.\n      - Disable dynamic code generation in Release builds prevents generating \n        malicious code at runtime.\n      - Block loading unexpected libraries from remote sources at runtime.\n      - Enable Package Integrity Check.\n      - Enable EH Continuation Metadata.\n      - Enable Signed Returns.", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/nanazip/2.0.450.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/nanazip/2.0.450.0", "licenseUrl": "https://github.com/M2Team/NanaZip/blob/main/License.md", "packageName": "nanazip", "displayName": "NanaZip", "summary": "The 7-Zip derivative intended for the modern Windows experience", "version": "2.0.450.0", "icon": "https://rawcdn.githack.com/M2Team/NanaZip/master/Assets/NanaZip.png", "author": "M2Team", "downloadCount": 201721, "tags": ["nanazip", "zip", "archive"]}