{"description": "CROSS PLATFORM & OPEN-SOURCE COMPOSITOR \nFOR VISUAL EFFECTS AND MOTION GRAPHICS INDUSTRY\nNatron is a powerful Digital Compositor that can handle of your 2D/2.5D needs. Its robust OIIO file formats and OpenFX architecture is what make Natron the most flexible open source compositor for the visual effects community. Its interface and functionally are the same across all platforms such as MacOS, Linux and Windows. Natron has a powerful keying, roto/rotopaint, 2D tracking tools that are staple for all current film production project that requires visual effects.\n\nThe development of Natron was supported by Inria from 2013 to 2018. \n\n\n## Features\nOn the surface Natron has a powerful GUI interface that is a flexible and intuitive multi-platform node based engine. Natron may seem to be a simple compositing application but it does have layers of complexity that will allow your creativity to reach new heights. Natron has flexible Roto and Rotopaint tool-set that can generate unlimited layers of masks, mattes and shapes. Natron has a powerful 2D and Planar tracker to help reduce hours of rotoscoping to meet personal or client deadlines. It has some strong keying or matte generation tools that has been developed from the main OFX software developers and a plethora of tools from the open source plugin developing community.\n\n### FLEXIBLE ROTOSCOPING\nMulti-layered rotoscoping with stroke capability.\n\n### TRACKER\nPowerful 2D and Planar tracker for tracking jobs.\n\n### POWERFUL KEYING TOOL\nNatron offers various keying tools for your production needs.\n\n### CURVE & DOPE-SHEET EDITOR\nPowerful curve and dope-sheet Editor with fluid interface.\n\n### GPU & NETWORK RENDERING\nGPU and Network rendering capability for faster production.\n\n### OFX COMPATIBLE\nNatron is a listed Open-source OFX host. More about OFX\n\n### SHADERTOY & G'MIC OFX PLUGINS\nShadertoy & G'MIC is also with us. Powerful and feature-rich community\n\n### COMMUNITY PLUGINS\nover 250 and ever increasing community plugins Here\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/natron.portable/screenshot.png)", "updated": "2024-03-23T11:03:37Z", "galleryUrl": "https://community.chocolatey.org/packages/natron.portable/2.5.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/natron.portable/2.5.0", "licenseUrl": "https://raw.githubusercontent.com/NatronGitHub/Natron/RB-2.3/LICENSE.txt", "packageName": "natron.portable", "displayName": "Natron Open-Source Compositing Software (Portable)", "summary": "Open Source Compositing Software For VFX and Motion Graphics.", "version": "2.5.0", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/natron.portable/natron.portable.png", "author": "Natron Team.", "downloadCount": 969, "tags": ["natron.portable", "compositing", "vfx", "motion", "graphic"]}