{"description": "*NeatMouse* is a small tool for Windows that allows controlling your mouse cursor via keyboard.\n\nThis is very useful when your physical mouse is unavailable:\n\n- If you haven’t installed its driver yet, and Windows was unable to do this automatically.\n- If you use wireless mouse and its battery is low so you need to charge it.\n- If you are a person with reduced mobility.\n*NeatMouse* also comes in handy when you need high precision in mouse pointer moving. It allows setting pointer moves accuracy up to one pixel.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/neatmouse/screenshot.png)\n\n## Key features\n1. *NeatMouse* can be activated by one of the following keys: Num Lock, Scroll Lock, Caps Lock, or by the custom hotkey.\n2. Select one of the Ctrl, Alt or Shift buttons for alternate speed modifiers. When this button is pressed, mouse pointer moves with alternate speed.\n3. Select one of the Ctrl, Alt or Shift for no-emulation mode. When this button is pressed and you press a keyboard button bound to the mouse action, this button performs its primary task as if there is no mouse emulation.\n4. Specify regular and alternate mouse speed.\n5. Bind keys for moving mouse left, right, up, down, and diagonally.\n6. Bind keys for left mouse button click, right mouse button click, middle mouse button click.\n7. Bind keys for scrolling up and down.\n8. Manage custom user settings: if you use portable version of NeatMouse, you can create different settings for your laptop and workstation.\n\nBy default, the mouse control keys for *NeatMouse* located on the keyboard numpad. The default key bindings are shown below, and each of them can be altered.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/neatmouse/screenshot1.png)\n\n*NeatMouse* has English, French, German, Greek, Italian, Polish, Romanian, Russian and Ukrainian translations. Both regular and portable versions are available. It is small, convenient, efficient and *completely free!*", "updated": "2024-03-23T06:48:30Z", "galleryUrl": "https://community.chocolatey.org/packages/neatmouse/1.05.005", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/neatmouse/1.05.005", "licenseUrl": "https://raw.githubusercontent.com/neatdecisions/neatmouse/master/LICENSE", "packageName": "neatmouse", "displayName": "NeatMouse", "summary": "Free keyboard mouse emulator.", "version": "1.05.005", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/neatmouse/neatmouse.png", "author": "Neat Decisions", "downloadCount": 832, "tags": ["neatmouse", "keyboard", "mouse", "emulator"]}