{"description": "The .NET Framework is a development platform for building apps for web, Windows, Windows Phone, Windows Server, and Microsoft Azure. It consists of the common language runtime (CLR) and the .NET Framework class library, which includes a broad range of functionality and support for many industry standards.\n\nThe .NET Framework provides many services, including memory management, type and memory safety, security, networking, and application deployment. It provides easy-to-use data structures and APIs that abstract the lower-level Windows operating system. You can use a variety of programming languages with the .NET Framework, including C#, F#, and Visual Basic.\n\nSupported Windows Client versions: Windows 11, Windows 10 versions: 21H2, 21H1, 20H2, 1903, 1809, 1803, 1709, 1703, 1607, Windows 8.1, Windows 7 SP1\n\nSupported Windows Server versions: Windows Server 2022, Windows Server 2019, Windows Server version 1803, Windows Server 2016, Windows Server 2012 R2, Windows Server 2012, Windows Server 2008 R2 SP1\n\nThe matching Developer Pack can be installed using [this package](https://chocolatey.org/packages/netfx-4.8-devpack).\n\n**This package is intended to be used by package maintainers as a dependency.** For end users the [dotnetfx](https://chocolatey.org/packages/dotnetfx) package is recommended, because it provides an easy way to upgrade the .NET Framework to a future release using standard Chocolatey mechanisms.\n\nOn systems which have a newer version of the .NET Framework installed, this package installs successfully, but does nothing.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/netfx-4.8/4.8.0.20220524", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/netfx-4.8/4.8.0.20220524", "licenseUrl": "https://www.microsoft.com/en-us/servicesagreement", "packageName": "netfx-4.8", "displayName": "Microsoft .NET Framework 4.8", "summary": "The .NET Framework is a development platform for building apps for web, Windows, Windows Phone, Windows Server, and Microsoft Azure.", "version": "4.8.0.20220524", "icon": "https://rawcdn.githack.com/jberezanski/ChocolateyPackages/f0b24b6aef7a58ec03550035644ce872aba13c23/icons/dotnet.png", "author": "Microsoft", "downloadCount": 649889, "tags": ["microsoft", ".net", "framework", "dotnet", "desktop", "clr", "redistributable", "runtime", "admin"]}