{"description": "NetHack is a single player dungeon exploration game that runs on a wide variety of computer systems, with a variety of\ngraphical and text interfaces all using the same game engine. Unlike many other Dungeons &amp; Dragons-inspired games,\nthe emphasis in NetHack is on discovering the detail of the dungeon and not simply killing everything in sight - in\nfact, killing everything in sight is a good way to die quickly. Each game presents a different landscape - the random\nnumber generator provides an essentially unlimited number of variations of the dungeon and its denizens to be\ndiscovered by the player in one of a number of characters: you can pick your race, your role, and your gender.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@0bf5df88f64a0574fba394651f89a836283b651f/automatic/nethack/screenshot.png)\n\n## Package Parameters\n\nThe following package parameter can be set:\n\n* `/AddToDesktop` - add desktop shortcuts for Nethack.  By default the shortcuts will be added for all users\ne.g. `choco install nethack --package-parameters=\"/AddToDesktop\"`\n* `/AddToStartMenu` - add entries to the Start Menu for Nethack.  By default the shortcut will be added for\nall users e.g. `choco install nethack --package-parameters=\"/AddToStartMenu\"`\n* `/User` - where the user parameter is specified any shortcuts created (using `/AddToDesktop` or `/AddToStartMenu`)\nwill only be added for the current user\ne.g. `choco install nethack --package-parameters=\"/AddToDesktop /User\"`\n\nTo have Chocolatey remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n## Notes\n\n* Two versions of Nethack will be installed by the package - Nethack and Nethack Classic.  The underlying game engine\nis the same but Nethack presents a Windows interface with graphical tiles while Nethack Classic provides the traditional\nconsole experience \n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\nIf you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T15:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/nethack/3.6.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/nethack/3.6.7", "licenseUrl": "https://www.nethack.org/common/license.html", "packageName": "nethack", "displayName": "Nethack - Single Player Dungeon Exploration", "summary": "Nethack is a free, single-player dungeon exploration game", "version": "3.6.7", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@fe013b8fec16af504e14dc2217b085507a4ea791/icons/nethack.png", "author": "Nethack Developers", "downloadCount": 4598, "tags": ["nethack", "game", "rogue", "roguelike", "rogue-like"]}