{"description": "The main intention of NiftyWindows is the provision of an easy user control of all basic window interactions like dragging, resizing, maximizing, minimizing, closing and many others. The idea is to perform the central interactions with a single hand without any need to press some tricky key combinations like other tools or window managers enforce.\n\nOne of the mostly unused mouse features is the press and drag of the RIGHT_BUTTON. The area of every window is tiled in a virtual 9-cell grid with three columns and rows. The center cell is the largest one and you can grab and move a window around by clicking and holding it with the right mouse button. The other eight corner cells are used to resize a resizable window in the same manner.\n\nThe full set of features supported by NiftyWindows is documented [here](http://www.enovatic.org/products/niftywindows/features/).\n\nThe following package parameters are supported:\n\n* `/ToolTipFeedback` - Show a tool tip when a NiftyWindows operation is being used. On by default.\n* `/AutoSuspend` - Disable NiftyWindows when an application is running fullscreen. On by default.\n* `/FocusFollowsMouse` - Automatically focus windows when the mouse passes over them. Off by default.\n* `/Left` - Enable left mouse button features. On by default.\n* `/Middle` - Enable middle mouse button features. On by default.\n* `/Right` - Enable right mouse button features. On by default.\n* `/Fourth` - Enable fourth mouse button features. On by default.\n* `/Fifth` - Enable fifth mouse button features. On by default.\n\nAs an example: `choco install niftywindows --params \"/AutoSuspend /ToolTipFeedback /Left /Right\"`.\n\nIf no parameters are passed, the default values will be used. When values are supplied, the rest of the features will be disabled. Features can be turned on or off at any point from the taskbar menu.", "updated": "2024-03-19T03:33:27Z", "galleryUrl": "https://community.chocolatey.org/packages/niftywindows/0.9.3.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/niftywindows/0.9.3.1", "licenseUrl": "https://www.gnu.org/licenses/gpl.html", "packageName": "niftywindows", "displayName": "NiftyWindows", "summary": "NiftyWindows adds to the built-in features of the window manger to increase ease of use.", "version": "0.9.3.1", "icon": "https://cdn.jsdelivr.net/gh/LiteracyFanatic/niftywindows/src/tools/NiftyWindows.png", "author": "Oliver Pfeiffer", "downloadCount": 2413, "tags": ["niftywindows"]}