{"description": "Nim is a statically typed compiled systems programming language. It combines successful concepts from mature languages like Python, Ada and Modula.\n\n### Efficient\n- Nim generates native dependency-free executables, not dependent on a virtual machine, which are small and allow easy redistribution.\n- The Nim compiler and the generated executables support all major platforms like Windows, Linux, BSD and macOS.\n- Nim's memory management is deterministic and customizable with destructors and move semantics, inspired by C++ and Rust. It is well-suited for embedded, hard-realtime systems.\n- Modern concepts like zero-overhead iterators and compile-time evaluation of user-defined functions, in combination with the preference of value-based datatypes allocated on the stack, lead to extremely performant code.\n- Support for various backends: it compiles to C, C++ or JavaScript so that Nim can be used for all backend and frontend needs.\n\n### Expressive\n- Nim is self-contained: the compiler and the standard library are implemented in Nim.\n- Nim has a powerful macro system which allows direct manipulation of the AST, offering nearly unlimited opportunities.\n\n### Elegant\n- Macros cannot change Nim's syntax because there is no need for it — the syntax is flexible enough.\n- Modern type system with local type inference, tuples, generics and sum types.\n- Statements are grouped by indentation but can span multiple lines.\n\n### Notes\n- By default this package install's Nim along with MingW compiler and added to `PATH`.\n- You can disable by passing a parameter. See [here](#package-specific)\n- Virus scanning: High quantity of false positives is found due to unsigned binaries. See https://github.com/nim-lang/Nim/issues/17820.\n\n## Package Specific\n### Package Parameters\n\nThe following package parameters can be set:\n- `/AddToPath:` - Add the binaries to `PATH`. Allowed values are either `true` or `false`. By default `true`. \n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install nim [other options] --params=\"'/AddToPath:false'\"`).\n\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n**Please Note:** This is an automatically updated package. If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/nim/2.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/nim/2.0.0", "licenseUrl": "https://github.com/nim-lang/Nim/blob/devel/copying.txt", "packageName": "nim", "displayName": "Nim (Install)", "summary": "Nim is a statically typed compiled systems programming language. It combines successful concepts from mature languages like Python, Ada and Modula.", "version": "2.0.0", "icon": "https://cdn.jsdelivr.net/gh/naveen521kk/au-packages/icons/nim.png", "author": "Andreas Rumpf", "downloadCount": 10029, "tags": ["nim", "development", "compiler", "nimrod", "foss"]}