{"description": "Search, create, edit and delete notes, all without the mouse.\n\n## Features\n\n- Markdown syntax highlighting\n- Markdown actions; toggle checkboxes, visit URLs, navigate between notes\n- Mouseless interaction; keyboard-driven user interface\n- Automatic saving of notes as you type\n- Fuzzy searching based on note names\n- Create, edit and delete notes\n\n## Description\n\nnimblenote's primary feature is being able to quickly take notes with a keyboard-driven interface, without needing a mouse.\n\nnimblenote supports Markdown, and features Markdown actions, where you can toggle checkbox items, visit links or even navigate between your notes; the potential to create your very own personal wiki of notes!\n\nWhen you first launch nimblenote, the focus of the keyboard will be within the search input. Start typing the name of a new note.\n\nHit enter and your note will be created with the name you chose. The focus of your keyboard will automatically change to the note editor.\n\nWith every change to your note, it is saved automatically.\n\nHit ESC when you've finished editing. Keyboard focus will switch back to the search input. You're now ready to create or search notes again!\n\nnimblenote uses fuzzy searching. So you only have to start typing a few letters of the name of a note for it to begin matching with notes.\n\nThe file list is used to display matching results. You can use the up or down arrow keys to move between files.\n\nIf you get lost, type in ? into the search input to display help information.\n\nnimblenote was inspired by Notational Velocity which unfortunately hasn't seen a release since 2011.", "updated": "2024-03-22T07:48:45Z", "galleryUrl": "https://community.chocolatey.org/packages/nimblenote/3.2.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/nimblenote/3.2.2", "licenseUrl": "", "packageName": "nimblenote", "displayName": "nimblenote", "summary": "Simple keyboard-driven note taking", "version": "3.2.2", "icon": "https://nimblenote.app/images/icon.png", "author": "leaves under foot ltd", "downloadCount": 317, "tags": ["nimblenote", "utility", "productivity", "note", "notes", "noted", "snippets", "writing", "notational", "markdown"]}