{"description": "Nmap (\"Network Mapper\") is a free and open source utility for network discovery and security auditing. Many systems and network administrators also find it useful for tasks such as network inventory, managing service upgrade schedules, and monitoring host or service uptime. Nmap uses raw IP packets in novel ways to determine what hosts are available on the network, what services (application name and version) those hosts are offering, what operating systems (and OS versions) they are running, what type of packet filters/firewalls are in use, and dozens of other characteristics. It was designed to rapidly scan large networks, but works fine against single hosts. Nmap runs on all major computer operating systems, and official binary packages are available for Linux, Windows, and Mac OS X. In addition to the classic command-line Nmap executable, the Nmap suite includes an advanced GUI and results viewer (Zenmap), a flexible data transfer, redirection, and debugging tool (Ncat), a utility for comparing scan results (Ndiff), and a packet generation and response analysis tool (Nping).\n\n## Features\n\n- Host discovery - Identifying hosts on a network. For example, listing the hosts that respond to TCP and/or ICMP requests or have a particular port open.\n- Port scanning - Enumerating the open ports on target hosts.\n- Version detection - Interrogating network services on remote devices to determine application name and version number.\n- OS detection - Determining the operating system and hardware characteristics of network devices.\n- Scriptable interaction with the target - using Nmap Scripting Engine (NSE) and Lua programming language.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/nmap/7.93", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/nmap/7.93", "licenseUrl": "https://svn.nmap.org/nmap/LICENSE", "packageName": "nmap", "displayName": "Nmap", "summary": "", "version": "7.93", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@a0850d2be498cbb87f9f0fd7c84bc1eafd4e58ba/icons/nmap.png", "author": "Fyodor", "downloadCount": 451733, "tags": ["nmap", "foss", "cross-platform", "port", "scanner", "network", "infosec"]}