{"description": "The Program is intended to work out-of-the-box. There is no need for specific windows versions, special video drivers, obscure plug-ins, virtual CDROM drives, system BIOS, or tweaked per-game configurations.\nThe Emulation should be complete with all hardware features fully implemented and working, though as by now it wasn't tested with too many games, so there may be still some problems with other games (bug reports are welcome).\nThe BIOS is emulated via a BIOS-clone, which is free and faster than the original PSX-BIOS. There may be still some compatibilty issues (especially as most PSX games are applying patches to the original BIOS; the BIOS clone is reproducing known patches, but may fail on unknown ones). In case of problems, please use a copy of the original BIOS (with filename PSX-BIOS.ROM in no$psx folder), and please let me know if that is fixing problems with any games.\nCDROMs are supported via complete disk images (in .CCD+IMG, .CDI, .CUE+BIN, .MDS+MDF, or .NRG format), via single-track images (.ISO files), or as raw executables (.EXE files). Decompressing .ECM and .CDZ files is supported. Subchannel data (for libcrypt'ed games) can be read from .SBI, .M3S, .SUB, .MDF files. Reading from real CDROM drives is also supported, but does require wnaspi32.dll (which appears to be a problem on WinNT/Win2K and higher).\nMinimum Requirements are around 1-2 GHz on a Pentium 3, which is maybe fast or maybe not so fast (older PSX emulators are said to be working on 200MHz computers, on the other hand, I got told that no$psx is much faster than those old emulators... I've no clue how that is possible).\nDebugging/Development functions include disassembler, debugger, profiler, code breakpoints, memory breakpoints, assembler, I/O map viewer, VRAM viewer, polygon viewer, TTY debug console window, and complete PSX hardware specs.\nPocketstation is emulated as part of no$gba v2.7 and up (the pocketstation is a PSX memory card with LCD screen; emulated in no$gba because GBA and pocketstation are both based on ARM processors).", "updated": "2024-03-19T13:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/no-cash-psx/2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/no-cash-psx/2.0", "licenseUrl": "", "packageName": "no-cash-psx", "displayName": "no-cash-psx", "summary": "Tiny PSone emulator with low system requiremments", "version": "2.0", "icon": "", "author": "martin korth", "downloadCount": 663, "tags": ["no$", "psx", "psone", "emulator", "pcsxr", "epsxe"]}