{"description": "[Plugin Manager](https://github.com/notepad-plus-plus/notepad-plus-plus) that allows you to install, update and remove plugins for [Notepad++](https://notepad-plus-plus.org). \nA centrally hosted XML file holds the list of plugins, that the plugin manager downloads and processes against the list of installed plugins.     \n\nFeatures\n- Install, Update and Remove all existing plugins\n- Notify when an installed plugin has an update available, and allow the user to update directly\n- Calculate dependencies between plugins, any plugin can depend on another plugin, which will be installed automatically if the user installs the initial plugin\n- Install all supplemental files as well as the plugin file itself (e.g. config, doc, extra libraries)\n- Automatic installation of the correct version (ANSI/Unicode) for your Notepad++\n- Validation of DLLs copied, against a central list of valid files. This slightly mitigates the risk of automatically downloading updates.\n- Only plugins that are compatible with your Notepad++ are shown\n- Plugins can be put into categories - a suggestion was made of \"Official, Common and Others\". Currently all plugins are in the \"Others\" category, as I think there needs to be some agreement as to what determines an \"Official\" plugin and which plugins are \"Common\".\n- Plugin Manager is able to update itself, and will notify the user when an update is available\n- Proxies are supported, just change the setting\n- Updates can be ignored, and the user will not be alerted to that update again, until a further new version of that plugin is released.\n- The local plugin list file is only downloaded when something has changed - the MD5sum of the file is compared to the server's version, and if it is different, then a new copy is downloaded.\n- New for 0.9: Works with plugins that are installed multiple times - update them all or individually", "updated": "2024-03-23T10:18:38Z", "galleryUrl": "https://community.chocolatey.org/packages/npppluginmanager/1.4.12", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/npppluginmanager/1.4.12", "licenseUrl": "https://raw.githubusercontent.com/bruderstein/nppPluginManager/master/LICENSE", "packageName": "npppluginmanager", "displayName": "Notepad++ Plugin Manager", "summary": "npp Plugin Manager is plugin which allows you to install, update and remove plugins from Notepad++", "version": "1.4.12", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/npppluginmanager/npppluginmanager.png", "author": "Dave Brotherstone", "downloadCount": 28255, "tags": ["notepad++", "text", "editor", "windows", "freeware", "development"]}