{"description": "## ntfsinfo\nNTFSInfo is a little applet that shows you information about NTFS volumes. Its dump includes the size of a drive's allocation\nunits, where key NTFS files are located, and the sizes of the NTFS metadata files on the volume. This information is typically\nof little more than curiosity value, but NTFSInfo does show some interesting things. For example, you've probably heard about\nthe NTFS equivalent of the FAT file system's File Allocation Table. Its called the Master File Table (MFT), and it is made up\nof constant sized records that describe the location of all the files and directories on the drive. What's surprising about the\nMFT is that it is managed as a file, just like any other. NTFSInfo will show you where on the disk (in terms of clusters) the\nMFT is located and how large it is, in addition to specifying how large the volume's clusters and MFT records are. In order to\nprotect the MFT from fragmentation, NTFS reserves a portion of the disk around the MFT that it will not allocate to other files\nunless disk space runs low. This area is known as the MFT-Zone and NTFSInfo will tell you where on the disk the MFT-Zone is\nlocated and what percentage of the drive is reserved for it.\n\n### Package-specific issue\nIf this package isn't up-to-date for some days, [Create an issue](https://github.com/tunisiano187/Chocolatey-packages/issues/new/choose)\n\nSupport the package maintainer and [![Patreon](https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@d15c4e19c709e7148588d4523ffc6dd3cd3c7e5e/icons/patreon.png)](https://www.patreon.com/tunisiano)", "updated": "2024-03-22T04:33:46Z", "galleryUrl": "https://community.chocolatey.org/packages/ntfsinfo/1.20.0.2022120601", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ntfsinfo/1.20.0.2022120601", "licenseUrl": "https://learn.microsoft.com/fr-fr/sysinternals/license-terms", "packageName": "ntfsinfo", "displayName": "NTFSInfo", "summary": "Detailed information about NTFS volumes, including the size and location of the Master File Table (MFT) and MFT-zone, as well as the sizes of the NTFS meta-data files.", "version": "1.20.0.2022120601", "icon": "", "author": "Mark Russinovich", "downloadCount": 2027, "tags": ["ntfs", "info", "sysinternals"]}