{"description": "![Promo Image](https://raw.githubusercontent.com/Merrit/nyrna/v2.18.0/assets/images/promo/promo.jpg)\n**Nyrna allows the user to pause any game or application on their PC.**\n\nSimilar to the incredibly useful sleep/suspend function found in consoles like the Nintendo Switch and Sony PlayStation; suspend your game (and its resource usage) at any time, and resume whenever you wish - at the push of a button.\n\n\n## Suspend Games\n\n- Pause cutscenes to read the subtitles, examine the scene, answer the door, etc.\n- Pause games that can't normally be paused (single-player games like Dark Souls, Elden\n  Ring, etc)\n- Suspend games whose pause screens keep the system running hot or playing\n  unwanted music\n- Suspend inbetween checkpoints (example: Hollow Knight)\n\n\n## Suspend Applications\n\nNyrna can be used to suspend normal, non-game applications as well. For example:\n\n- 3D renders\n- video encoding\n- software compilation\n\nThe CPU and GPU resources are being used by said task - maybe for hours - when\nyou would like to use the system for something else. With Nyrna you can suspend\nthat program,\nfreeing up the resources (excluding RAM) until the process is resumed,\nwithout losing where you were - like the middle of a long job, or a gaming session\nbetween save points.\n\n---\n\nNyrna works on Linux with X11 and Microsoft Windows (tested on Windows 10).\n\n\n[Nyrna Website](https://nyrna.merritt.codes)\n\n\n## Disclaimer\n\nModifying running applications comes with the possibility that the application will crash.\n\nWhile this is rare, it is a known possibility that Nyrna can do nothing about.\n\nPlease make sure to **save** your data or game before attempting to use Nyrna.\n\n\n## FAQ\n\n**Can I suspend to disk so that I can restore after reboot / free up RAM usage / etc?**\n\nUnfortunately no. [CRIU](https://criu.org/) looks very promising to allow us to do this (on Linux), however it [does not currently support suspending GUI applications](https://criu.org/X_applications).", "updated": "2024-03-23T17:48:30Z", "galleryUrl": "https://community.chocolatey.org/packages/nyrna/2.19.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/nyrna/2.19.0", "licenseUrl": "https://github.com/Merrit/nyrna/blob/v2.19.0/LICENSE", "packageName": "nyrna", "displayName": "Nyrna", "summary": "Suspend any game or application.", "version": "2.19.0", "icon": "https://cdn.statically.io/gh/Merrit/nyrna/19b993b3/icons/nyrna.ico", "author": "Merritt", "downloadCount": 2679, "tags": ["systray", "foss", "suspend", "gaming", "tool"]}