{"description": "## GNU Octave - Scientific Programming Language\n\nGNU Octave is a high-level language, primarily intended for numerical computations. It provides a convenient command line interface for solving linear and nonlinear problems numerically, and for performing other numerical experiments using a language that is mostly compatible with Matlab. It may also be used as a batch-oriented language.\n\nOctave has extensive tools for solving common numerical linear algebra problems, finding the roots of nonlinear equations, integrating ordinary functions, manipulating polynomials, and integrating ordinary differential and differential-algebraic equations. It is easily extensible and customizable via user-defined functions written in Octave’s own language, or using dynamically loaded modules written in C++, C, Fortran, or other languages.\n\n## Features\n\n* Powerful mathematics-oriented syntax with built-in plotting and visualization tools\n* Drop-in compatible with many Matlab scripts\n* Octave Forge, a central location for development of packages for GNU Octave, similar to Matlab's toolboxes.\n* Free software, runs on GNU/Linux, macOS, BSD, and Windows\n\n## Package parameters\n\nThe following package parameters can be set:\n\n* `/DesktopIcon` - Add icons for Octave to the Desktop. By default no icons are added.\n* `/StartMenu`   - Add icons for Octave to the Start Menu. By default no icons are added.\n* `/LocalUser`   - Install only for local user. By default any Octave shortcuts will be installed for all users.\n\nExample: `choco install octave.install --params \"/DesktopIcon /StartMenu /LocalUser\"`\n\n## Notes\n\n* The package makes Octave available through the `octave` (GUI) and  `octave-cli` (CLI) shims following installation", "updated": "2024-03-24T00:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/octave.portable/8.3.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/octave.portable/8.3.0", "licenseUrl": "https://www.gnu.org/software/octave/license.html", "packageName": "octave.portable", "displayName": "GNU Octave (Portable)", "summary": "Scientific Programming Language, largely compatible with Matlab", "version": "8.3.0", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@aa4dfe9a33e28ea4a94616e84b3648527d4fa87f/icons/octave.png", "author": "John W. Eaton", "downloadCount": 101022, "tags": ["octave", "matlab", "math", "numerical", "computations", "foss", "cross-platform"]}