{"description": "Octant is a tool for developers to understand how applications run on a Kubernetes cluster. It aims to be part of the developer's toolkit for gaining insight and approaching complexity found in Kubernetes. Octant offers a combination of introspective tooling, cluster navigation, and object management along with a plugin system to further extend its capabilities.\n\n## Features\n\n#### Resource Viewer\n\nGraphically visualizate relationships between objects in a Kubernetes cluster. The status of individual objects are represented by color to show workload performance.\n\n#### Summary View\n\nConsolidated status and configuration information in a single page aggregated from output typically found using multiple kubectl commands.\n\n#### Port Forward\n\nForward a local port to a running pod with a single button for debugging applications and even port forward multiple pods across namespaces.\n \n#### Log Stream\n\nView log streams of pod and container activity for troubleshooting or monitoring without holding multiple terminals open.\n\n#### Label Filter\n\nOrganize workloads with label filtering for inspecting clusters with a high volume of objects in a namespace.\n\n#### Cluster Navigation\n\nEasily change between namespaces or contexts across different clusters. Multiple kubeconfig files are also supported.\n\n#### Plugin System\n\nHighly extensible plugin system for users to provide additional functionality through gRPC. Plugin authors can add components on top of existing views.", "updated": "2024-03-23T20:48:38Z", "galleryUrl": "https://community.chocolatey.org/packages/octant/0.25.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/octant/0.25.1", "licenseUrl": "https://github.com/vmware-tanzu/octant/blob/master/LICENSE", "packageName": "octant", "displayName": "Octant", "summary": "A highly extensible platform for developers to better understand the complexity of Kubernetes clusters.", "version": "0.25.1", "icon": "", "author": "VMware Tanzu", "downloadCount": 19409, "tags": ["octant", "kubernetes", "kubectl", "heptio", "dashboard", "pod", "tanzu"]}