{"description": "![Screenshot of Microsoft Office Online for Chrome](https://lh3.googleusercontent.com/S98w_v-qLUAr6OX6ZcfJbqqRTGd1J22L_fWSo55nUSgBMijVwX_9Ib_U7pfoHY8CNCJ5pSynKA=s640-h400-e365-rw)\t\n\t\n###View, edit, and create Office files in your browser.\n\nBuilt for Chrome – Use Word, Excel, PowerPoint, OneNote, and Sway Online without needing Office installed.\n\nCreate with confidence – Use familiar formatting and layout options to express your ideas in full fidelity.\n\nWork on the go – Get to your files from anywhere, thanks to integration with OneDrive and OneDrive for Business.\n\nCopy and paste conveniently – Use Copy and Paste buttons on the ribbon and right-click menu, or use keyboard shortcuts for copying and pasting.\n\nBy installing the app, you agree to these terms and conditions: \n\nPLEASE NOTE: Refer to your license terms for Microsoft Office Online software (the \"software\") to identify the entity licensing this supplement to you and for support information. You may use a copy of this supplement with each validly licensed copy of the software. You may not use the supplement if you do not have a license for the software. The license terms for the software apply to your use of this supplement.\n\nPrivacy Policy: http://aka.ms/privacy\n\t\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-21T17:03:27Z", "galleryUrl": "https://community.chocolatey.org/packages/office-online-chrome/1.5.0.20170115", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/office-online-chrome/1.5.0.20170115", "licenseUrl": "", "packageName": "office-online-chrome", "displayName": "Microsoft Office Online for Chrome", "summary": "Microsoft Office Online Chrome extension", "version": "1.5.0.20170115", "icon": "https://lh3.googleusercontent.com/wZMwJuLJFa8G-gituAAdM0ckm9tpYdj6fnmVtEg-Sdxu2a77auIvDOwt1PBGAYIIebDZr40=s26-h26-e365-rw", "author": "Microsoft Corporation", "downloadCount": 2126, "tags": ["microsoft", "office", "online", "chrome", "extension"]}