{"description": "Olex² is a simple to use program containing numerous tools for the structure analysis and publication, including Fourier maps and voids calculation and visualisation, space group determination, calculation of esd's for almost any possible geometrical parameters, CIF translation to HTML and other documents, hydrogen atom placement and many others. The graphical user interface is the result of 10 years of striving to provide the best possible experience to modelling even the most challenging structures with ease.  The software originated at Durham University and has been in active development since 2004. \n\n#### Features\n\n* Stereo visualisation\n* Full history of the structure - from solution - to the refinement\n* Structure analysis - pi-pi and other interactions, easy s.u. (esd) on many geometrical parameters calculation\n* Own olex2.refine structure refinement module\n* Seamless integration with [Shelxl](http://shelx.uni-ac.gwdg.de/SHELX/) - switch between Shelxl and olex2.refine in no time\n* Integration with [Platon](https://chocolatey.org/packages/platon/) software - every knowledge Platon has is unlocked\n* Multi-platform Windows-Linux-Mac (thanks to wxWidgets)\n* [Superflip GUI](http://superflip.fzu.cz/superflip.html), [ShelXT](http://shelx.uni-ac.gwdg.de/SHELX/shelxt_keywords.php), Sir and other structure solution programs at the push of the button\n* Postscript and bitmap (jpg, png etc) output to high resolution\n* Advanced tools for disorder modelling using rigid body refinemet\n* Structure reports (and CIF) - by managing metadata are always up to date even after a new structure solution!\n* Electron density maps (and they are live for contour maps)\n* Numerous drawing styles, including a few of predefined\n* Customisable main Menu and the GUI toolbar\n* Embedded Python and macro binding to the command line or interface elements\n\n### Install Options\nBy default, this package deposits Olex² in C:\\ProgramData\\ and will *not* install a desktop icon.\n\n* `/Icon` - Installs the desktop icon.\n* `/INSTALLDIR:` - Deposits Olex² to a directory you specify\n\nExample usage:  `choco install olex2 -params '\"/INSTALLDIR:\"\"c:\\Program Files\"\"\"'`\n_(note: the double-double quotes around the path are only needed if it contains spaces)_", "updated": "2024-03-19T20:34:08Z", "galleryUrl": "https://community.chocolatey.org/packages/olex2/1.3.0.6408", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/olex2/1.3.0.6408", "licenseUrl": "http://www.olex2.org/olex2-distro/1.2/update/licence.rtf", "packageName": "olex2", "displayName": "Olex²", "summary": "Solve, refine and finish small-molecule crystal structures", "version": "1.3.0.6408", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@dc663d22e1e1815f8608d0e87865b29e1e4b35f0/Icons/olex2color_icon.png", "author": "Oleg Dolomanov,  Horst Puschmann", "downloadCount": 6531, "tags": ["olex2", "crystallography", "chemistry"]}