{"description": "# OneFetch\n\nOnefetch is a command-line Git information tool written in `Rust` that displays project information and code statistics for a local Git repository directly on your terminal. The tool is completely offline - no network access is required.\n\n![Preview1](https://rawcdn.githack.com/o2sh/onefetch/main/assets/screenshot-1.png)\n\nBy default, the repo's information is displayed alongside the dominant language's logo, but you can further configure onefetch to instead use an image - on supported terminals -, a text input or nothing at all.\n\nIt automatically detects open source licenses from texts and provides the user with valuable information like code distribution, pending changes, number of dependencies (by package manager), top contributors (by number of commits), size on disk, creation date, LOC (lines of code), etc.\n\n![Preview2](https://rawcdn.githack.com/o2sh/onefetch/main/assets/screenshot-2.png)\n\nOnefetch can be configured via command-line flags to display exactly what you want, the way you want it to: you can customize ASCII/Text formatting, disable info lines, ignore files and directories, output in multiple formats (Json, Yaml), etc.\n\nAs of now, onefetch supports more than 50 different programming languages; if your language of choice isn't supported: Open up an issue and support will be added.", "updated": "2024-03-23T21:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/onefetch/2.19.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/onefetch/2.19.0", "licenseUrl": "https://github.com/o2sh/onefetch/blob/main/LICENSE.md", "packageName": "onefetch", "displayName": "OneFetch", "summary": "Onefetch is a command-line Git information tool written in Rust that displays project information and code statistics for a local Git repository directly on your terminal.", "version": "2.19.0", "icon": "https://rawcdn.githack.com/o2sh/onefetch/main/assets/onefetch.svg", "author": "o2sh,  contributors", "downloadCount": 1399, "tags": ["onefetch", "git", "repo", "info", "repoinfo"]}