{"description": "OpenCV is released under a BSD license and hence it's free for both academic and commercial use. It has C++, C, Python and Java interfaces and supports Windows, Linux, Mac OS, iOS and Android. OpenCV was designed for computational efficiency and with a strong focus on real-time applications. Written in optimized C/C++, the library can take advantage of multi-core processing. Enabled with OpenCL, it can take advantage of the hardware acceleration of the underlying heterogeneous compute platform. Adopted all around the world, OpenCV has more than 47 thousand people of user community and estimated number of downloads exceeding 9 million. Usage ranges from interactive art, to mines inspection, stitching maps on the web or through advanced robotics.\n\n### Package Info\nThis version is from the master branch of development, which is the cutting edge of OpenCV development.\n\nThis package installs precompiled OpenCV binaries.  This does not allow you to customize the features compiled into your installation.  This download is about 172 MB.\nIf you wish to customize the features compiled in your installation, then you must compile OpenCV yourself.  This requires [Git](https://chocolatey.org/packages/git) and [CMake](https://chocolatey.org/packages/cmake).  You can follow the instructions at [opencv.org](https://docs.opencv.org/master/d3/d52/tutorial_windows_install.html \"OpenCV build tutorial\") to build using [Microsoft Visual Studio](https://chocolatey.org/packages/visualstudio2017community \"Visual Studio Chocolatey Package\").\n\n### Package Parameters\nPass the package argument /InstallationPath to set where OpenCV will unzip itself.  Left alone, it will unzip in your Chocolatey Tools directory.  Remember, it will always unzip itself to a new folder called \\opencv in the directory you chose.\nPass the package argument /Environment to add OpenCV to your user environment variables, which may or may not be necessary depending on your specific needs.  Check the installation guide on OpenCV's website to determine the precise directory structure you want to add to your \npath.  The OPENCV\\_DIR variable will be created/replaced, and Path will be appended with %OPENCV\\_DIR%\\bin.\n\n#### Examples\nAdd the install path to your environment: ```choco install opencv --package-parameters '/Environment'```\nInstall to a specific directory: ```choco install opencv --package-parameters '/InstallationPath:'C:\\test'```\nInstall to a specific directory and add to your environment: ```choco install opencv --package-parameters '/InstallationPath:'C:\\test' /Environment'```", "updated": "2024-03-24T00:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/OpenCV/4.9.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/OpenCV/4.9.0", "licenseUrl": "https://opencv.org/license", "packageName": "OpenCV", "displayName": "OpenCV", "summary": "Open Source Computer Vision", "version": "4.9.0", "icon": "https://cdn.rawgit.com/philiparola/chocolatey-packages/8bbda56cc71494a5d674ecb63ef0882915e9a91e/opencv/opencv.png", "author": "Itseez", "downloadCount": 118367, "tags": ["opencv", "programming", "library", "image", "processing"]}