{"description": "OpenAudible: Your Ultimate Audiobook Manager\n\nOpenAudible is a powerful, user-friendly audiobook manager designed to simplify and elevate your audiobook listening experience. With its comprehensive suite of features, OpenAudible seamlessly integrates with your existing Audible library, making it easier than ever to organize, access, and enjoy your favorite audiobooks.\n\nKey Features:\n\nCross-Platform Compatibility: OpenAudible is available on Windows, Mac, and Linux, ensuring that you can manage your audiobook collection across all your devices.\n\nLibrary Organization: Effortlessly sort and categorize your audiobooks with OpenAudible's intuitive interface. Create custom collections, search by author or title, and view detailed information about each book.\n\nAudiobook Conversion: OpenAudible's built-in conversion tools allow you to transform your audiobooks into multiple formats, including MP3, M4B, and more, ensuring compatibility with your preferred devices and apps.\n\nAudio Splitting and Merging: Customize your listening experience by splitting and merging audiobook chapters, making it easy to create personalized playlists for your daily commute or workout sessions.\n\nAutomatic Metadata Retrieval: OpenAudible automatically retrieves and updates metadata for your audiobooks, providing accurate and up-to-date information, including cover art, author, and publication details.\n\nExport: OpenAudible allows you to export your book list to multiple formats, including web, json, Excel, Google Sheets, and Mac Numbers.\n\nImport: Import books with a simple drag and drop.\n\nSeamless Integration: OpenAudible is designed to work seamlessly with your existing Audible audiobook library, as well as free audiobook sources like Librivox.\n\nRegular Updates and Support: Our dedicated developers constantly update OpenAudible, ensuring that you always have access to the latest features and improvements.\n\nDiscover the ultimate audiobook management experience with OpenAudible, and transform the way you listen to your favorite titles. Try OpenAudible today and unlock the full potential of your audiobook collection.\n\nOpenAudible loves, but is unaffiliated with audible.com", "updated": "2024-03-22T19:19:16Z", "galleryUrl": "https://community.chocolatey.org/packages/openaudible/4.1.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/openaudible/4.1.1", "licenseUrl": "https://www.apache.org/licenses/LICENSE-2.0", "packageName": "openaudible", "displayName": "OpenAudible", "summary": "OpenAudible is a cross-platform audible audiobook manager designed for Audible users. With over 1300 stars by github developers, OpenAudible is the trusted Audible audiobook content manager.", "version": "4.1.1", "icon": "https://openaudible.org/icons/64x64.png", "author": "OpenAudible", "downloadCount": 12241, "tags": ["openaudible", "download", "audible", "audiobook", "mp3", "m4b", "audio", "book"]}