{"description": "![Screenshot of Open Screenshot](https://lh3.googleusercontent.com/ltnVppk82E64OJnrZJZluHE_0TLKxCMsYL2ODOjkkG3Jaifss32u6-fFiJkhjHJI0d2WXIVY8A=s640-h400-e365-rw)\t\n\t\n###The most powerful and freeware app for capture entire page, Save and Edit and Annotate and Print and Share\n\n【Webpage Screenshot】\n\nThis is a open-source extension for taking screenshots. \n\nThis extension is able to capture 100% of both the vertical and horizontal content appearing on any webpage on the Internet. \nIt is very easy to save the captured file onto your computer or print it / or share it to any social network.\n\nYou can host and share unlimited images forever for free.\n\nGithub:\nhttps://github.com/aminag/openscreenshot\n\nFork:\nhttps://github.com/aminag/openscreenshot/fork\n\n【Features】\n\n* Annotate it with rectangles, circles, arrows, lines and text.\n* Blur sensitive info by using the Spray.\n* Print the screenshot - It's awesome.\n* UNLIMITED STORAGE for storing your screenshot online!\n* Capture local files (ex: c:\\)\n* Create PDF.\n* Create Thumbnails.\n* You can Save the screenshot on your computer as PNG file.\n* Attach the screenshot directly to Gmail messages..\n* Upload To Google Drive\n* Post to facebook.\n* You can EDIT THE PAGE before taking the screenshot (change any text, titles)\n* Create note in Evernote (Like Evernote Web Clipper, buy we are capture entire page.\n* Send captured image to any email address.\n* Twett to Twitter.\n* Post to VK.\n* Send the screenshot to your mobile (By using QR Code/QRCode).\n* Upload screenshot to WordPress gallery.\n* Post To Google+ (Google Plus)\n* Pin it to Pinterest.\n* Send to outlook (hotmail/bing)\n* Search the screen shot using TinEye service. (See if the image stoled from somewhere else).\n* Create new post at Blogger.\n* Post to Tumblr the screenshot.\n\n\nUsage of the Open Screenshot extension requires granting it permission to capture anonymized click stream data.  Anonymous usage and browsing activity may be collected for research purposes and may be shared in aggregate with third parties. No personally identifying information will be captured in connection with this data.\n\t\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-19T22:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/open-screenshot-chrome/24.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/open-screenshot-chrome/24.0", "licenseUrl": "https://github.com/Aminadav/OpenScreenshot/blob/master/LICENSE.txt", "packageName": "open-screenshot-chrome", "displayName": "Open Screenshot for Chrome", "summary": "", "version": "24.0", "icon": "https://lh3.googleusercontent.com/UsEwLLRaLfTseNFPSMtquKtRAvOvPjEashZ0FXVKJNldjZnpc1M98uF5UteyQ5HpTKKTDEm1jA=s26-h26-e365-rw", "author": "openscreenshot.com", "downloadCount": 815, "tags": ["chrome", "extension"]}