{"description": "---\n### [choco://openhab](choco://openhab)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of openHAB](https://www.openhab.org/faa4c619ae9c16f8e98ef67151476221.png)\n\t\n### Introduction\n\nMore and more new cool devices and technologies arrive at our homes every day. But though they are all aimed at enhancing our lifestyle they all lack one important feature: a common language they could speak to each other to create a really automated and smart environment at home. The main goal of openHAB is to provide an integration platform to fix this issue.\n\n### What is openHAB?\nopenHAB is a software for integrating different home automation systems and technologies into one single solution that allows over-arching automation rules and that offers uniform user interfaces.\n\nThis means that openHAB\n\n* is designed to be absolutely vendor-neutral as well as hardware/protocol-agnostic\n* can run on any device that is capable of running a JVM (Linux, Mac, Windows)\n* lets you integrate an abundance of different home automation technologies into one\n* has a powerful rule engine to fulfill all your automation needs\n* comes with different web-based UIs as well as native UIs for iOS and Android\n* is fully open source\n* is maintained by a passionate and growing community\n* is easily extensible to integrate with new systems and devices\n* provides APIs for being integrated in other systems\n\n### Who is the Target Audience?\n\nopenHAB is highly flexible and customizable, but this comes at a cost. You have to invest some time for learning its concepts and to set up an individual system tailored to your needs. Many parts of the setup require textual configuration, potentially accessing log files for debugging, etc. Therefore setting up openHAB is mainly a job for tech-savvy people - it is not a commercial off-the-shelf product that you plug in and that is ready to go.\n\nNonetheless, this only applies to the setup and configuration of the system, which is usually done by a single person in the household, while all other family members are merely using the system. And here is where openHAB shines: It is very stable, has apps for all different end devices, allows voice interaction, etc, so once installed, it has a very high WAF.\n\n**SOCIAL MEDIA:**\n[Facebook](https://www.facebook.com/openHAB-153141161476518/) | [Twitter](https://twitter.com/openHAB) | [Google+](https://plus.google.com/u/0/+OpenhabOrg) | [YouTube](https://www.youtube.com/playlist?list=PLGlxCdrGUagz6lfgo9SlNLhdwI4la_VSv)\n\n**CLIENTS:**\n[Android App](https://play.google.com/store/apps/details?id=org.openhab.habdroid) | [iOS App](https://itunes.apple.com/us/app/openhab/id492054521?mt=8) | [Windows App](https://www.microsoft.com/en-us/p/openhab/9nmq39ctwxgt)\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/openhab/readme.md)**\n\n***\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n***", "updated": "2024-03-23T01:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/openhab/3.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/openhab/3.1.0", "licenseUrl": "https://github.com/openhab/openhab-distro/blob/master/LICENSE", "packageName": "openhab", "displayName": "openHAB", "summary": "openHAB - a vendor and technology agnostic open source automation software for your home", "version": "3.1.0", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/openhab/openhab_icon.png", "author": "openHAB Community and the openHAB Foundation", "downloadCount": 14242, "tags": ["openhab", "home", "automation", "smart", "java", "binary", "foss", "cross-platform"]}