{"description": "![Screenshot of OST2PST Wizard](http://ost2pstware.com/img/guide/step4.png)\n\t\n###The Key features of this software are listed below:\n\nMigrate OST to other formats such as PSTformatshtml formatsetc.\nProvides preview of OST data files\nUser can specify storage location of resultant file\nRecovers highly corrupted OST file by transforming OST to PST or to other formats.\nApply naming convention to save the Output file\nRestoration of permanently deleted OST Mailbox data.\n\n###Convert OST file\nOST2PST is a specialised program to migrate OST data files into PST files. It provides you an option to add OST file and then migrate OST to PST in just one click. The result generated can be saved at preferred location.\n\n###Restore deleted OST data\nThis multitasker tool also manages your deleted files. OST2PST Converter, can easily restore all your permanently deleted items or files. Both soft and hard deleted items can be re-obtained by converting OST to Outlook PST or other file formats.\n\n###Change OST to Other formats\nThis software has multiple features, it can convert OST to PST, formatshtml formats format. This one tool can perform conversion of OST files in more than 2 file formats. You can select any of these format to recover and migrate OST data to required file format.\n\n###Maintains folder structure\nOST2PST Converter software migrate OST to PST,formatshtml formats etc., retaining the data consistency. This means it maintains all hierarchical folder structure in the resultant output file. It create PST file with the same sequence of folder and sub folder as it was in source corrupted OST file\n\n###Recover Corrupt OST\nUsing OST2PST tool you can easily recover your OST files. It converts highly corrupted outlook offline folder data (.OST files) into healthy state PST files. Thus it safeguards and recovers your important information stored in corrupted OST files\n\n###Supports all Outlook Version\nThis software is designed to work efficiently with all version of Outlook. It can easily convert OST to PST file of updated version of Outlook. It will generate error free output and gives satisfactory result to end user\n\n###Preview Option\nYou can view your OST file before starting the conversion process. After adding the required file, you can select any of the item or folder to get a preview of it. You can see the preview of ost mails along with attachments.\n\n###Saving Options\nIt offers you multiple saving options. You can specify location to save resultant file as desirable, you can also apply naming convention while converting ost to other format except pst. It's a all in one converter.\n\n###Standard License\n* $49\n* Suitable for Personal use only\n* Valid for 2 Machines\n* Save OST to PST, EML, EMLX\n\n###Pro License\n* $99\n* Multiple Saving Options\n* Save OST to PST, EML, EMLX, MSG, PDF, HTML, MBOX, MHT", "updated": "2024-03-22T21:33:45Z", "galleryUrl": "https://community.chocolatey.org/packages/ost2pst-wizard/4.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ost2pst-wizard/4.2", "licenseUrl": "http://ost2pstware.com/eula.html", "packageName": "ost2pst-wizard", "displayName": "OST2PST Wizard (Trial) (Install)", "summary": "A perfect tool developed to save OST to PST files", "version": "4.2", "icon": "http://ost2pstware.com/img/logo.png", "author": "OST2PSTWARE", "downloadCount": 946, "tags": ["ost2pstware", "ost2pst", "ost", "pst", "converter", "outlook", "exchange", "trial", "admin"]}