{"description": "![Screenshot of Exclaimer Outlook Photos](https://e1fb6cb20426c9f446d7-c189afbaf93f5496308e0de3fd0efbd4.ssl.cf1.rackcdn.com/outlook-photos-update-photos_800x589.jpg)\n\nExclaimer Outlook Photos is a fully free product. There's no requirement to license it and we withhold no functionality from the product you download – it's not a free version of the product: the only version is always free.\n\nGive everyone a photo portrait in the Outlook People Pane, their SharePoint profile and on Microsoft Skype for Business.\n\nWe auto-match pictures to names or other data in the Active Directory – matching the user 'Karen Green' with her photo in 'KarenGreen.jpg' so you don't have to.\n\nDon't worry if your photos aren't the right size, we'll automatically crop and center them so you get the right content and the right sized photos.\n\nAnd it's not just about importing, our familiar and intuitive interface lets you browse everyone's photo and filter for different containers in your AD so you're not overwhelmed if you work in a large organization.\t\n\n##FEATURES\n\n###Turn A Company Into A Community\n\nIn Outlook - Users and groups can get photo portraits in the Outlook Social Connector (sometimes called the Outlook People Pane) in seconds.\n\nIn SharePoint - SharePoint doesn't use the same Active Directory photo field as Outlook – but we support them all, so you can still see each user's portrait in Microsoft's essential collaboration tool.\n\nIn Skype for Business - Give Microsoft's fastest growing unified communication platform a social spin too – with photos next to the user's name in conversations and next to their entry in the contacts list.\n\nAuto-Match - A 'KarenGreen.jpg' would automatically match to Karen Green's profile, for example, or you can match based on other Active Directory data, not just names – like employee IDs.\n\nBatch-Import - Whether it's a network folder, flash drive or some other container – we'll grab all your files in one swoop and add them to the Active Directory.\n\nNo Changes Required - Outlook Photos is simply an import tool – we've packed in all kinds of capabilities and functionality we think you'll need, but we never ask you to make adjustments to Exchange, Outlook or any of your resources.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/outlook-photos/readme.md)**", "updated": "2024-03-20T07:48:37Z", "galleryUrl": "https://community.chocolatey.org/packages/outlook-photos/2.1.2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/outlook-photos/2.1.2.0", "licenseUrl": "https://www.exclaimer.com/outlook-photos/", "packageName": "outlook-photos", "displayName": "Exclaimer Outlook Photos (Install)", "summary": "Get Peoples Pictures in Outlook, Sharepoint and Skype easily.", "version": "2.1.2.0", "icon": "https://a8b03ffbc00ed4da54a1-0c6684360696717b63d89dbc0edb802c.ssl.cf1.rackcdn.com/exclaimer-logo_192x41.png", "author": "Exclaimer Limited", "downloadCount": 1303, "tags": ["exclaimer", "outlook", "photos", "ad", "active", "directory"]}