{"description": "Pale Moon is an Open Source, Goanna-based web browser available for Microsoft Windows and Linux (with other operating systems in development), focusing on efficiency and ease of use.\n\nPale Moon offers you a browsing experience in a browser completely built from its own, independently developed source that has been forked off from Firefox/Mozilla code a number of years ago, with carefully selected features and optimizations to improve the browser's stability and user experience, while offering full customization and a growing collection of extensions and themes to make the browser truly your own.\n\nThis browser, even though fairly close to Gecko-based browsers like Mozilla Firefox and SeaMonkey in the way it works, is based on a different layout engine and offers a different set of features. It aims to provide close adherence to official web standards and specifications in its implementation (with minimal compromise), and purposefully excludes a number of features to strike a balance between general use, performance, and technical advancements on the Web.\n\n# Features\n\n- Optimized for modern processors\n- Based on our own optimized layout engine (Goanna)\n- Safe: forked from mature Mozilla code and regularly updated\n- Secure: Additional security features and security-aware development\n- Supported by our user community, and fully non-profit\n- Familiar, efficient, fully customizable interface\n- Support for full themes: total freedom over any element's design\n- Support for easily-created lightweight themes (skins)\n- Smooth and speedy page drawing and script processing\n- Increased stability: experience fewer browser crashes\n- Support for many Firefox extensions\n- Support for a growing number of Pale Moon exclusive extensions\n- Extensive and growing support for HTML5 and CSS3\n- Broad support for image formats: Supports WebP and JPEG-XR\n- Many customization and configuration options\n\n## Notes\n\n- **If the package is out of date please check [Version History](#versionhistory) for the latest submitted version. If you have a question, please ask it in [Chocolatey Community Package Discussions](https://github.com/chocolatey-community/chocolatey-packages/discussions) or raise an issue on the [Chocolatey Community Packages Repository](https://github.com/chocolatey-community/chocolatey-packages/issues) if you have problems with the package. Disqus comments will generally not be responded to.**", "updated": "2024-03-23T08:48:37Z", "galleryUrl": "https://community.chocolatey.org/packages/palemoon/33.0.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/palemoon/33.0.1", "licenseUrl": "https://repo.palemoon.org/MoonchildProductions/Pale-Moon/src/branch/master/LICENSE", "packageName": "palemoon", "displayName": "Pale Moon browser", "summary": "A Firefox-based web browser optimized for modern hardware.", "version": "33.0.1", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@d1b8b6861269e2381fa4e8ca92b1856149b0e4c8/icons/palemoon.png", "author": "Moonchild Productions", "downloadCount": 68843, "tags": ["Internet", "Browser", "Firefox", "Optimized", "admin"]}