{"description": "Pandabank manages and provides secure storage of your Pandacoins while earning 2.5% annual interest.  Pandacoin is different from Bitcoin or Litecoin in that coins can be earned without expensive mining equipment.  New pandacoins are generated from existing pandacoins at a rate of 2.5% per annum.  This occurs while PandaBank is running and requires negligible system resources.\n\nPandacoin is a peer-to-peer Internet currency that enables instant, near-zero cost payments to anyone in the world. Pandacoin is an open source, global payment network that is fully decentralized without any central authorities. Mathematics secures the network and empowers individuals to control their own finances. Pandacoin features faster transaction confirmation times and improved storage efficiency than the leading math-based currency. With substantial industry support, trade volume and liquidity, Pandacoin is a proven medium of commerce complementary to Bitcoin.\n\nPandacoin is a fork of Dogecoin.  The modifications to the network protocol are: \n\n* proof-of-stake algorithm\n* 2.5% annual inflation\n\n### Disk Requirements - Pandacoin blockchain (public transactional database) size\n* As of 05 February 2015, the total size of the PND blockchain was __375.92 MB__ \n\n### Previous Version Compatibility - Pandacoin blockchain hard-forks\n* http://pandacoinpnd.org/news/\n\n### Pandacoin Android wallet\n* https://play.google.com/store/apps/details?id=cc.pandacoin.wallet\n\n### Source code\n* https://github.com/Pandacoin-project/Pandacoin", "updated": "2024-03-20T17:03:25Z", "galleryUrl": "https://community.chocolatey.org/packages/pandabank.install/3.0.2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pandabank.install/3.0.2.0", "licenseUrl": "http://opensource.org/licenses/MIT", "packageName": "pandabank.install", "displayName": "PandaBank (Install)", "summary": "Decentralized, peer-to-peer (P2P) transactional system which achieves consensus via distributed proof-of-stake computing", "version": "3.0.2.0", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/ec866b7e9220d8ac105ae7b0b19f1e1f7677377a/icons/pandacoin.png", "author": "Pandacoin Developers", "downloadCount": 1098, "tags": ["pandacoin", "pnd", "wallet", "cryptocurrency", "p2p"]}