{"description": "---\n\n### [choco://paraffin](choco://paraffin)\n\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support](https://community.chocolatey.org/packages/choco-protocol-support)\n\n---\n\n## Paraffin - Making WiX Easier\n\n[Windows Installer XML](http://wixtoolset.org/) is a fantastic tool for building installers. One small weakness with WiX is keeping your file fragments up to date. While the Heat tool creates the fragments easily, you have to manually edit the `.WXS` when adding and removing files. Paraffin has been around for a while, but the original requirements sum up the project nicely.\n\nThe goal for PARAFFIN was that it would build immediately consumable WiX fragments with a minimum of fuss on your part. PARAFFIN should meet the following requirements for initially creating a `.WXS` fragment for a directory:\n\n- `PARAFFIN.EXE` created unique values to the `Component`, `Directory`, and `File` elements' `Id` attribute so you do not have to worry about conflicts across large projects\n- `PARAFFIN.EXE` creates a `ComponentGroup` element in the output file with all `Component` elements in the file automatically specified with `ComponentRef` values\n- You can optionally exclude specific file extensions from being added to the `.WXS` fragment\n- You can optionally exclude directories from inclusion by specifying a partial name\n- You can optionally specify if you want GUID values automatically generated for all components\n- You can optionally specify multiple files per `Component` (the default is one file per component)\n- You can optionally specify that you do not want to recurse directories other than the one specified\n- You can optionally specify an alias for the directory name when setting the `File` element's `Source` attribute so you do not have hard coded drive and directory names in the output `.WXS` file\n\nAfter you've created a `.WXS` fragment with PARAFFIN, you don't want to have to edit the fragment manually, so PARAFFIN supports the following requirements for creating an updated output file from an existing `.WXS` fragment:\n\n- The updated output is written to a `.PARAFFIN` file so the original `.WXS` fragment is not disturbed\n- All command line options specified when creating the initial `.WXS` fragment are automatically set when updating a file created by PARAFFIN\n- Any new directories and files found are automatically added to the output file\n- Any directories and files that are no longer part of the directory structure are removed from the output file\n\nSince the original release of Paraffin a few other requirements have been added:\n\n- You can specify the directory reference when initially creating the `WXS` file\n- Directories and files can be excluded by name or regular expression\n- Support for adding fragment information through `.ParaffinMold` files so you can more easily support installation options such as services\n- Adding include files to the top of the produced `.WXS` file\n- Specifying the `DiskID` is supported so you can handle giant installers easier\n- Full support for minor upgrades with transitive properties set so you can remove files on the minor upgrade and produce zero byte files so your installer builds\n- Support for reporting if subsequent runs of Paraffin are reporting different output (i.e., adding or removing files)", "updated": "2024-03-20T17:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/paraffin/3.7.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/paraffin/3.7.1", "licenseUrl": "https://github.com/Wintellect/Paraffin/blob/3.7.1/CPL.TXT", "packageName": "paraffin", "displayName": "Paraffin", "summary": "A tool for generating Windows Installer XML (WiX) 3.6/4.0 file fragments.", "version": "3.7.1", "icon": "", "author": "John Robbins", "downloadCount": 49, "tags": ["paraffin", "windows-installer", "windows", "installer", "wix", "wxs", "fragment", "cli", "portable", "foss"]}