{"description": "![Screenshot of Password Control](http://www.wisesoft.co.uk/Products/PasswordControl/Images/enabled_user.PNG)\n\n###Overview\n\nPassword Control is a tool designed to allow helpdesk staff and other IT support personnel to reset user passwords.  It has a simple and intuitive interface that many users find more productive than a custom MMC console.  Password Control is designed to work with **Active Directory** based domains.  It also features other functions such as the ability to enable and disable user accounts (you can edit a config file to remove these features if required). \n\nThe \"G\" button shown in the screenshot above (next to the password box) is used to generate random passwords.  By default the generated password will contain a random combination of upper case and lower case characters and digits.  Symbols can also be included and you can alter the length of the password generated above that of your minimum password length setting.  You can also choose to use a \"pass phrase\" or a custom password mask.  A pass phrase is simply a combination of two words seperated by a space. A mask gives you the ability to set the exact format of the password. e.g. 5 lowercase characters followed by 2 digits, A random word followed by 3 digits, a specific password etc.\n\nPlease read [this](http://www.wisesoft.co.uk/software/passwordcontrol/basics.aspx) document to help you get started.\n\n###Features\n\n* Enable/Disable Accounts.\n* Password Reset with automatic account unlock.\n* Password Generation.  A random password can be generated of a specified length with the option of uppercase, lowercase, digits and symbols.  A pass phrase can also be used or you can specify a custom mask for generating passwords.\n* Unlock user accounts.\n* Change various account options. e.g. \"Password Never Expires\", \"User must change password at next logon\" etc\n* Connect As Feature - Quick and easy method of running Password Control as a user with enhanced privileges.\n* Multi-Domain support. The domain can easily be changed using the menu and the domain list is built automatically from the trusted domains in your enterprise. You can also add additional domains by hand or configure Password Control so that is connects to a specific domain controller. By default, Password Control will connect to any available domain controller in the current domain, but this behavior can easily be changed.\n* Searching capabilities - Easy to search for user accounts when the account name is not known.  A sinple search feature is included to search for users based on a combination of firstname and surname.  An advanced search feature is also included that reuses the existing Microsoft object search dialog with which you are probably already familiar.\n* Ability to customize which properties are displayed for user accounts. Display virtually any attribute.\n* Domain Policy - A quick method to determine which password policy settings are defined for your domain.\n* Extensible design - additional features can be added with scripts.\n* Picture Gallery feature for users storing photos in Active Directory.\n* Bulk Password Control for changing Passwords for many user accounts. Note: this feature will be part of a separate application called Bulk AD Users in the next release. \n* Bulk Modify for changing attributes of many user accounts. Note: this feature will be part of a separate application called Bulk AD Users in the next release. \n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/password-control/readme.md)**", "updated": "2024-03-20T17:33:26Z", "galleryUrl": "https://community.chocolatey.org/packages/password-control/2.4.3061.39299", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/password-control/2.4.3061.39299", "licenseUrl": "", "packageName": "password-control", "displayName": "Password Control (Install)", "summary": "Bulk AD Users - A tool that allows bulk updates to Active Directory User Attributes", "version": "2.4.3061.39299", "icon": "https://raw.githubusercontent.com/bcurran3/ChocolateyPackages/master/password-control/PasswordControl_icon.png", "author": "David Wiseman", "downloadCount": 870, "tags": ["wisesoft", "password", "control", "users", "active", "directory", "util", "utility", "helpdesk", "admin"]}