{"description": "A key component of staying safe online is keeping your computer up-to-date. Hackers and virus writers love outdated software. It might contain a security vulnerability or \"hole\" that can provide them with access to your computer. Outdated software can also be buggy, or have performance issues, which is usually fixed with a newer version of the software. These are two of the main reasons why it is important to keep the software on your computer updated (or \"patched\").\n\nPatch My PC Updater is a free, easy-to-use program that keeps over 100 programs up-to-date on your computer. It is also an easy way to install any of these programs on to your computer.When you open Patch My PC Updater, it will scan your system for outdated programs.\n\nWhether you are a computer novice, semi-tech savvy, the go-to tech person for your family and friends, or an IT professional, Patch My PC Updater will make patching your PC easy.\n\n## Features\n\n- Easy to use User Interface\n- Outdated software will show in Red\n- Up to date will show in Green\n- Not installed software will show up as Black\n- Patches many common third party products e.g. Reader, Flash, Java, Quicktime and More\n- Portable and very small around 500 Kb.\n- Scan and install needed Windows updates\n- Quickly uninstall multiple programs\n- Enable or disable programs\n- Set updates to happen on a schedule\n\n## Notes\n\n- Link to start menu is no longer working. Looking for a package writer who can fix this.", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/patch-my-pc/4.5.0.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/patch-my-pc/4.5.0.4", "licenseUrl": "https://patchmypc.net/about", "packageName": "patch-my-pc", "displayName": "Patch my PC", "summary": "Patch My PC creates software to patch third party applications to fix security vulnerabilities.", "version": "4.5.0.4", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@e181cd354f3b03be5a92e204b4e3a03274578e40/icons/patch-my-pc.png", "author": "Patch My PC", "downloadCount": 140012, "tags": ["patch-my-pc", "admin", "software", "update", "updates", "freeware"]}