{"description": "![Screenshot of PC Decrapifier](https://d3342og8rhzilt.cloudfront.net/assets/pcdc-2-d129042923fc81ca07365939d5213bc6.png)\n\nIs your PC running slow? Even brand new PCs often come with LOTS of pre-installed software that can cause that new machine to come to a crawl. Not to mention all of the annoying pop-ups! Others may have a PC that's a couple years old and we're the ones that installed a bunch of junk! It happens to the best of us. We try a bunch of programs over time and forget to remove them.\n\nThe PC Decrapifier is here to help! It's a free tool for you to use that helps remove programs, unnecessary startup items and icons that can slow down your PC. It takes you step by step, giving you recommendations on what to remove, many of which can be removed unattended. \n\n####About\nThe PC Decrapifier is a program designed to suggest and remove unwanted software. It can be used to clean off most of the annoying software that is typically shipped with new PCs.\n\n####Super Easy\nThe PC Decrapifier provides an easy step-by-step process to help you remove the garbage clogging up your computer.\n####You're In Control\nNothing is removed without your approval. We show you the list before anything is removed.\n####Community Recommendations\nDecide what to remove based on our community of PC Decrapifier users.\n####Just download and run it. There is no installer. There's no UNinstaller. It's all self-contained.", "updated": "2024-03-23T20:33:47Z", "galleryUrl": "https://community.chocolatey.org/packages/pc-decrapifier/3.0.1.20161106", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pc-decrapifier/3.0.1.20161106", "licenseUrl": "", "packageName": "pc-decrapifier", "displayName": "The PC Decrapifier", "summary": "The PC Decrapifier ...it's like TP for your PC", "version": "3.0.1.20161106", "icon": "https://d3342og8rhzilt.cloudfront.net/assets/pc-decrapifier-logo-3726730c47740a1a5cb08e05a63d93df.png", "author": "pcdecrapifier.com", "downloadCount": 8237, "tags": ["pcdecrapifier", "decrapifier", "system", "cleanup"]}