{"description": "# PDFTK Builder is a free graphical interface to the Windows version of PDFTK making it much easier to use.\n\t\n\t*Join* - ‘Join’ allows you to combine pages from multiple PDF documents and/or rearrange pages in a single document (reorder, delete, & duplicate). Multiple documents will be joined in the order they are listed in the 'Source Documents' window. If you wished to insert pages from one document into the middle of another, the main document would have to be listed twice, once before (listing pages to appear before) and once after (listing pages to appear after) the document containing the pages to be inserted. If page ranges are not specified, PDFTK Builder will assume all pages for that document are to be included. Page ranges for each document in the list can be indicated by using a single page number, or a hyphen between start and end pages (reversed page orders are allowed). Multiple ranges are indicated by using commas or semi-colons between ranges.\n\n\t*Split* - separates each page of a PDF file into separate (numbered) PDF documents.\n\n\t*Background*, Stamp & Page Numbering - ‘Background’ allows you to add a background to each page in a document or just the first page. The 'background' (eg a company logo, or a 'draft' watermark) must be another PDF document (the first page of that document if it has more than one page). ‘Stamp’ is very similar to ‘background’ except that the ‘stamp’ is placed on top of the source document. Page numbering initially defaults to stamping numbers in the bottom right corner of an A4 document in portrait orientation. These default values can be changed in PdftkBuilder.ini. (Layout dimensions are defined in 1/72 inches.)\n\n\t*Rotate* - 'Rotate' enables you to rotate a range of pages in a document.\n\n\t*Password Protection:* The new document can be password protected (encrypted) by providing 'owner' and 'user' passwords. The 'owner' password does not stop users from reading the document, but it does restrict the actions that users can perform on that document - printing, copying, decrypting etc. Specifying a 'user' password will stop anyone without either 'user' or 'owner' passwords from opening and reading the document.\n\n\tThe package will be installed in the default location (C:\\Program Files (x86)\\PDFTK Builder)", "updated": "2024-03-22T12:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/pdftkbuilder/3.9.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pdftkbuilder/3.9.4", "licenseUrl": "https://www.gnu.org/copyleft/gpl.html", "packageName": "pdftkbuilder", "displayName": "pdftkbuilder (Install)", "summary": "PDFTK Builder is a free graphical interface to the Windows version of PDFTK making it much easier to use.", "version": "3.9.4", "icon": "", "author": "Angus Johnson", "downloadCount": 5184, "tags": ["pdftkbuilder", "pdf", "documents", "admin"]}