{"description": "PDF-XChange PRO is the ultimate PDF solution. It's a bundle package that combines the three best-selling applications that Tracker Software produces:\n\n- PDF-XChange Editor Plus is a hugely dynamic and fully-customizable PDF application. Create, view, edit, annotate, OCR* and sign PDF files – and that’s just the beginning. If you work with PDF then this fully-customizable product will optimize your work process to levels that no other product can achieve. Create PDF files from scanned documents, images, text files, Markdown files and much more. Open, edit and convert Microsoft Office documents.* Avail of over thirty tools to assist in the creation of document comments, annotations, links and fillable forms. These tools make editing PDFs a finely-tuned, precise process that produces documentation and image files of the highest quality. Our user-friendly functionality is diverse enough to meet the needs of all practitioners from novices to professionals.**\n- PDF-Tools is a worldwide leader in the creation and manipulation of PDF and image files. Highly user-friendly, it can be used to convert files of almost any format to/from PDF. Avail of seventy built-in standard tools, as well as functionality to clone and edit these tools and their variables as you desire. Use the Actions Library to fully customize your tools and the Tool Actions Sequence to determine the order in which they perform operations. Combine seventy-seven available actions to create your own tools - out of billions of possibilities. PDF-Tools is compatible with large PDF files and can also handle a huge number of files simultaneously – batch conversion is its strength.\n- PDF-XChange Standard Printer is Tracker Software’s best-selling virtual printer - the ultimate application for the creation and virtual printing of industry-standard PDF files. It’s compatible with files from almost all Windows applications, such as Word, Excel and AutoCAD, and features an optimized engine for superb conversion of images and image-based text characters. The files it creates are surprisingly small, given their quality – allowing for faster uploads/downloads, a reduction in storage space and increased data retention - even at high levels of compression. PDF-XChange Standard also features MS Office integration, which provides extra functionality such as adding clickable tables of contents and embedded URL support that facilitates the creation of external links.\n\n#### Package Parameters\n\nThe following package parameters can be set:\n\n * `/NoDesktopShortcuts` - Do not create shortcut on desktop.\n * `/NoUpdater` - Do not install updater service.\n * `/NoViewInBrowsers` - Do not configure to open PDF files inside browsers.\n * `/NoSetAsDefault` - Do not set as default application for PDF files.\n * `/NoProgramsMenuShortcuts` - Do not create program menu group for installed application and their components.\n * `/KeyFile:[file]` - Pass [file] (which should be a .xcvault file downloaded from Tracker Software) in as your license file.\n\nThese parameters can be passed to the installer with the use of `-params`.\nFor example: `-params '\"/NoDesktopShortcuts\"'`, `--params \"/KeyFile:C:\\Users\\foo\\Temp\\PDFXChangeEditor.xcvault\"`.", "updated": "2024-03-23T09:18:55Z", "galleryUrl": "https://community.chocolatey.org/packages/PDFXchangePro/10.2.1.385", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/PDFXchangePro/10.2.1.385", "licenseUrl": "https://www.tracker-software.com/licensing", "packageName": "PDFXchangePro", "displayName": "PDF-XChange Pro", "summary": "PDF-XChange PRO is the ultimate PDF solution.", "version": "10.2.1.385", "icon": "https://rawcdn.githack.com/flcdrg/au-packages/4b1e2d6d9764ff0a993c9624eef7fc7c10cda675/PDFXchangePro/icons/pdfxchangepro.png", "author": "Tracker Software", "downloadCount": 21371, "tags": ["PDFXchangeEditor", "pdf", "reader", "editor", "ocr", "pdfxchangeviewer", "admin"]}