{"description": "![Screenshot of PDQ Deploy](https://cdn.statically.io/gh/asheroto/ChocolateyPackages/b7157f61/pdq-deploy/screenshot.png)\n\n## What Can PDQ Deploy Do?\n\n### Install MSIs to Multiple Computers\nNeed to install an MSI? Just create a new PDQ Package and point it to the MSI. If the installation has more than a single MSI file, be sure to check the “Include Entire Directory” checkbox.\n\n### Install EXEs to Multiple Computers\nNeed to install an EXE? All you need to do is verify that the application can be installed silently. (By default MSIs have this ability, but EXEs need to be explicitly told to run silently.) Not every EXE supports this feature, but most do.\n\nThe challenge will be to determine the correct method to run it silently. The silent parameter (sometimes called a switch) can be /s or /S, /q or /Q, /quiet, /qn, and a host of other options. Sometimes the installations are case sensitive, so be sure to use exactly what the vendor states is the correct switch.\n\n### Ready-to-Deploy Installs in the Package Library\nWe created the Package Library so that our users wouldn't have to spend time with every Java or Flash update that comes down the pike. When you are a Pro or Enterprise mode customer you get access to the Package Library you can get common apps that are already in PDQ Packages, and are ready for deploying to all your computers. See the full list of ready-to-go silent installs.\n\n### Customize Your Installs\nWith PDQ Deploy you can install just about any application or patch just by pointing a PDQ Deploy package to an EXE or MSI. You can also make changes to the packages that you downloaded from the Package Library.\n\n### What if my Installation has more files than just an MSI or EXE?\nMany installations require more than a single install file.\n\nTo be sure that these files are used during the installation, be sure to check the “Include Entire Directory” checkbox when you point the PDQ Package to the MSI or EXE.\n\n**Memory Requirements:** 4 GB\n\n**OS Requirements:** Windows 10, 11, 8x, Server 2012x or higher\n\n[MORE INFO ON WEBSITE](https://www.pdq.com/pdq-deploy/)\n\n**SOCIAL MEDIA:**\n[Twitter](https://twitter.com/AdmArsenal) | [YouTube](https://www.linkedin.com/company/pdq.com) | [Linkedin](https://www.linkedin.com/company/pdq.com) | [spiceworks](https://community.spiceworks.com/pages/pdq)", "updated": "2024-03-23T09:18:55Z", "galleryUrl": "https://community.chocolatey.org/packages/pdq-deploy/19.3.537", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pdq-deploy/19.3.537", "licenseUrl": "https://www.pdq.com/end-user-license-agreement/", "packageName": "pdq-deploy", "displayName": "PDQ Deploy (Install)", "summary": "PDQ Deploy is a systems management tool that enables you to install software on Windows computers across the network without installing an agent.", "version": "19.3.537", "icon": "https://cdn.statically.io/gh/asheroto/ChocolateyPackages/f8e5bf05/pdq-deploy/icon.png", "author": "PDQ", "downloadCount": 12486, "tags": ["arsenal", "pdq", "deploy", "tool", "software", "patch", "deployment", "admin", "trial"]}