{"description": "---\n\n### [choco://performancetest](choco://performancetest)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n\n![Screenshot of PerformanceTest](https://www.passmark.com/source/img_posts/cpu_test.jpg)\n\t\nFast, easy to use, PC speed testing and benchmarking. PassMark PerformanceTest allows you to objectively benchmark a PC using a variety of different speed tests and compare the results to other computers.\n\n* Find out if your PC is performing at its best.\n* Compare the performance of your machine to similar machines.\n* Measure the effect of configuration changes and upgrades.\n* Avoid paying big bucks for poor performance.\n* Make objective independent measurements on which to base your\npurchasing decision.\n* Use the advanced tests to create you own benchmark scenarios\n\nThirty two standard benchmark tests are available in five test suites plus there are eight advanced testing windows for custom benchmarking.\n\nStandard test suites\n\n* CPU tests Mathematical operations, compression, encryption, physics.\n* 2D graphics tests Vectors, bitmaps, fonts, text, and GUI elements.\n* 3D graphics tests DirectX 9 to DirectX 12 in 4K resolution. DirectCompute and OpenCL\n* Disk tests Reading, writing and seeking within disk files + IOPS\n* Memory tests Memory access speeds and latency\n\nAdvanced configurable tests\n\n* Advanced Disk\n* Advanced CD / DVD\n* Advanced 3D graphics\n* Advanced Networking (for Ethernet, Internet and Wireless)\n* Advanced Memory\n* Advanced Visualized Physics\n* Advanced DirectCompute\n\nPassMark Rating and comparable baselines\n\nIn addition to the standard tests, there are 5 summary results plus the overall \"PassMark Rating\" result. The benchmark results are presented as easy to read charts so that you don't need to spend hours studying the number to know the result.\n\nA major advantage is the support for built-in baseline results which allows you to compare computer systems (a baseline is a standard set of results from another computer). These baseline results can be used to determine how fast your computer is in comparison with other computer systems.\n\nPerformanceTest comes with six baseline results as well as the ability to search and download thousands more from our online database of user submission.\n\nAdditional Features\n\nThe application includes the following additional features:\n\n* Comprehensive online help\n* Supports hyper-threading, and multiple CPUs testing\n* Detailed disk speed graphs\n* Supports printing results\n* The ability to save your benchmark results to disk as a new baseline\n* A customizable \"Notes\" field for storing your own information along with the saved Benchmark result.\n* Support for copying the results to other applications (eg. MS-Word)\n* Export results to HTML, text, GIF, and BMP formats\n* Single test execution, execution of a test suite or execution of all tests with a single mouse click.\n* A summary 'Mark' figure for each test suite plus the calculation of the PassMark Rating figure.\n* An easy to use point and click interface\n* A summary system information screen including CPU type, CPU speed, Total RAM, Video Hardware, Cluster size, etc..\n* The ability to compare the performance of your computer to multiple 'Baseline' computers at the one time.\n* Flexible license, move the software\n\n**Platforms:** XP SP3, Vista, Server 2003, 2008, 2012, 2016, Windows 7, Windows 8, Windows 10\n\n**Requirements:** Pentium4 CPU or better, DirectX 9 or higher video, 2GB RAM, 300MB of free disk space. (DX12 video card recomended)\n\n**Free 30 day evaluation, then US$29.00 to purchase.**\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/performancetest/readme.md)**\n    \n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-23T05:48:29Z", "galleryUrl": "https://community.chocolatey.org/packages/performancetest/11.0.1006", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/performancetest/11.0.1006", "licenseUrl": "https://www.passmark.com/legal/disclaimer.htm", "packageName": "performancetest", "displayName": "PassMark PerformanceTest (Install)", "summary": "PerformanceTest - Easy PC Benchmarking", "version": "11.0.1006", "icon": "https://www.passmark.com/source/img_posts/pt_download.png", "author": "PassMark® Software", "downloadCount": 12575, "tags": ["passmark", "performancetest", "benchmark", "benchmarking", "trial"]}