{"description": "Personal Backup is a program for saving personal data to any destination folder. This folder may be located on a local fixed or removable drive, on a Windows network server or on an FTP server. The 32-bit version runs under Windows 7, 8 and 10 (32- and 64-bit), Windows Vista, Windows XP and Windows Server 2003/2008(R2)/2012(R2), the 64-bit only under Windows 7,8 and 10 (64-bit) and Windows Server 2008(R2)/2012(R2).\n You can configure and store as many backup tasks as you wish. The selection of the files to be backed up is made on a by-folder basis. All subfolders are included automatically, but the user can exclude or include any subdirectories from or in the backup by selection or by filter. Additional criteria are the selection by file type, file age and/or file name filter.\nAt the destination folder the original drives (C:, D:, etc.) appear as subdirectories named LwC, LwD, etc. The original directory structure remains unchanged beneath these folders. All files may be compressed in gzip, either in toto or separated by subfolders as zip files. Optionally all data can be AES algorythm-encrypted.\nPerforming the backup can be done manually or automatically. During the backup the program checks whether the file to be saved is newer than one already backed up. Only new files and files with newer timestamps are saved. An alternate criteria is the archive bit of the files.\nAutomatic backups can be started on logon, at a selectable time of day, on logoff or on shutdown. You can make scheduled backups with destination paths changing daily or weekly.\nFor individual schedules it is easy to start a backup using the Windows Task Scheduler and the command line options of the program.", "updated": "2024-03-23T17:48:30Z", "galleryUrl": "https://community.chocolatey.org/packages/PersonalBackup/6.3.1300", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/PersonalBackup/6.3.1300", "licenseUrl": "http://personal-backup.rathlev-home.de/license.html", "packageName": "PersonalBackup", "displayName": "personalbackup (Install)", "summary": "Personal Backup is a program for saving personal data to any destination folder.", "version": "6.3.1300", "icon": "http://personal-backup.rathlev-home.de/images/pb-button.png", "author": "Dr. Jürgen Rathlev", "downloadCount": 24182, "tags": ["personal", "backup", "data", "restore", "security", "admin"]}