{"description": "# PHPStorm\nPhpStorm is built on top of the open-source IntelliJ Platform, which we've been developing and perfecting for over 15 years. Enjoy the fine-tuned, highly customizable experience it provides to fit your development workflow.\n# FEATURES\n## Intelligent coding assistance\nPhpStorm is a PHP IDE that actually 'gets' your code. It supports PHP 5.3/5.4/5.5/5.6/7.0/7.1, provides on-the-fly error prevention, best autocompletion & code refactoring, zero config debugging, and an extended HTML, CSS, and JavaScript editor.\n#### Smart PHP Code Editor\nThe IDE provides smart code completion, syntax highlighting, extended code formatting config, on-the-fly error checking, code folding, supports language mixtures and more. Automated refactorings that treat your code with care, helping to make global project settings easily and safely.\n#### Code Quality Analysis\nHundreds of code inspections verify your code as you type and inspect the whole project for possible errors or code smells. Quick-fixes for most inspections make it easy to fix or improve the code instantly. Alt+Enter shows appropriate options for each inspection.\n#### Easy Code Navigation & Search\nPhpStorm helps you get around your code more efficiently and save time when working with large projects. Jump to a method, function or variable definition in just one click, or search for its usages.\n\n[MORE ABOUT CODING ASSISTANCE](//jetbrains.com/phpstorm/features/php_code_editor.html)\n## Debugging, Testing and Profiling\n#### Debugging\nZero-config debugging makes it really easy to debug your PHP applications. Besides, PhpStorm provides numerous options for debugging your PHP code with Visual Debugger, so you can: inspect variables and user-defined watches, set breakpoints and evaluate an expression in runtime, debug remote applications, debug a page in multiple sessions simultaneously, and more.\n#### Testing\nYou can develop PHPUnit tests right in PhpStorm and run them instantly from a directory, file or class, by using the context menu options. Code Coverage from PHPUnit shows how much of your code is covered with tests.\n#### Profiling\nYou can profile your applications with Xdebug or Zend Debugger and check aggregated reports in PhpStorm.\n\n[MORE ABOUT DEBUGGING](//jetbrains.com/phpstorm/features/debugging_testing_profiling.html)\n## HTML/CSS/JavaScript Editor\n#### HTML & CSS\nAll the cutting edge web development technologies are supported including HTML5, CSS, SASS/SCSS, LESS, CoffeeScript, Jade/Pug, etc. Live Edit gives you an opportunity to see all the changes instantly in the browser without refreshing the page.\n#### JavaScript\nThe smartest JavaScript Editor is bundled with the IDE, offering code completion, validation and quick fixes, refactorings, JSDoc type annotations support, debugging and unit testing, support for Frameworks, and more.\n#### New Technologies\nPhpStorm provides a streamlined experience for the full development cycle with new languages such as TypeScript, CoffeeScript, and Dart.\n\n[MORE ABOUT HTML/CSS/JAVASCRIPT EDITOR](//jetbrains.com/phpstorm/features/html_css_js_editor.html)\n## Development Environment\n#### Databases & SQL\nPhpStorm provides tools and code assistance features for working with databases and SQL in your projects. Connect to databases, edit schemas and table data, run queries, and even analyze schemas with UML diagrams. SQL code can be injected to other languages or edited in SQL Editor, with syntax highlighting, smart code completion, on-the-fly code analysis, code formatting and navigation available.\n#### Other Features\nPerform many routine tasks right from the IDE with support for Vagrant support, Docker, Composer, git, SVN, Mercurial, and more.\n\n[MORE ABOUT DEVELOPMENT ENVIRONMENT](//jetbrains.com/phpstorm/features/development_environment.html)\n___\n#### _Maintainer Notes_\n_PhpStorm EAP builds are available using the_ **`--prerelease`** _flag_\n```\nchoco install phpstorm --prerelease\n```", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/phpstorm/2023.3.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/phpstorm/2023.3.6", "licenseUrl": "https://www.jetbrains.com/phpstorm/buy/", "packageName": "phpstorm", "displayName": "JetBrains PHPStorm", "summary": "PHPStorm - Lightning-smart PHP IDE", "version": "2023.3.6", "icon": "https://raw.githubusercontent.com/mastacheata/chocolatey-packages/phpstorm/icon_PhpStorm.png", "author": "JetBrains s.r.o.", "downloadCount": 85981, "tags": ["PHP", "HTML", "CSS", "IDE", "jetbrains", "idea", "PhpStorm", "EAP", "PhpStorm-EAP", "developer", "productivity", "code", "admin", "trial"]}