{"description": "Pik is a tool to manage multiple versions of ruby on Windows. It can be used from the Windows command line (cmd.exe), Windows PowerShell, or Git Bash. I have yet to test on cygwin.\n__Pik Commands__\n * add - Adds another ruby location to pik.\n * benchmark|bench - Runs bencmarks with all versions that pik is aware of.\n * checkup|cu - Checks your environment for current Ruby best practices.\n * config - Adds/modifies configuration options.\n * default - Switches back to the default settings.\n * gem - Runs the gem command with all versions that pik is aware of.\n * gemsync - Synchronizes gems from the version specified to the current version.\n * help - Displays help information.\n * implode - Removes your pik configuration.\n * info - Displays information about the current ruby version.\n * install|in - Downloads and installs different ruby versions.\n * list|ls - Lists ruby versions that pik is aware of.\n * rake - Runs the rake command with all versions that pik is aware of.\n * remove|rm - Removes a ruby location from pik.\n * ruby|rb - Runs ruby with all versions that pik is aware of.\n * run - Runs command with all versions of ruby that pik is aware of.\n * switch|sw|use - Switches ruby versions based on patterns.\n * tag - Adds the given tag to the current version.\n * tags - Runs the pik command against the given tags.\n * uninstall|unin - Deletes a ruby version from the filesystem and removes it from Pik.\n * update|up - updates pik.\n\nFor help on a particular command, use 'pik help COMMAND'.", "updated": "2024-03-18T05:33:32Z", "galleryUrl": "https://community.chocolatey.org/packages/pik/0.3.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pik/0.3.0", "licenseUrl": "https://github.com/vertiginous/pik/blob/master/README.rdoc", "packageName": "pik", "displayName": "Pik (Ruby)", "summary": "Pik is a tool to manage multiple versions of ruby on Windows.", "version": "0.3.0", "icon": "", "author": "Gordon Thiesfeld", "downloadCount": 6853, "tags": ["pik", "ruby", "admin"]}