{"description": "Pixelorama is a free and open source pixel art editor, proudly created with the Godot Engine, by Orama Interactive. Whether you want to make animated pixel art, game graphics, tiles and any kind of pixel art you want, Pixelorama has you covered with its variety of tools and features. Free to use for everyone, forever!\n\n## Current features:\n\n- A variety of different tools to help you draw, with the ability to map a different tool in each left and right mouse buttons.\n- Are you an animator? Pixelorama has its own animation timeline just for you! You can work at an individual cel level, where each cel refers to a unique layer and frame. Supports onion skinning, cel linking, motion drawing and frame grouping with tags.\n- Custom brushes, including random brushes.\n- Create or import custom palettes.\n- Import images and edit them inside Pixelorama. If you import multiple files, they will be added as individual animation frames. Importing spritesheets is also supported.\n- Export your gorgeous art as `PNG`, as a single file, a spritesheet or multiple files, or `GIF` file.\n- Pixel perfect mode for perfect lines, for the pencil, eraser and lighten/darken tools.\n- Autosave support, with data recovery in case of a software crash.\n- Horizontal and vertical mirrored drawing.\n- Tile Mode for pattern creation.\n- Rectangular and isometric grid types.\n- Scale, rotate and apply multiple image effects to your drawings.\n- Multi-language localization support! See our [Crowdin page](https://crowdin.com/project/pixelorama) for more details.", "updated": "2024-03-23T22:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/pixelorama/0.11.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pixelorama/0.11.3", "licenseUrl": "https://github.com/Orama-Interactive/Pixelorama/blob/master/LICENSE", "packageName": "pixelorama", "displayName": "Pixelorama", "summary": "A free and open-source 2D sprite editor, made with the Godot Engine!", "version": "0.11.3", "icon": "https://rawcdn.githack.com/Ambossmann/auto-packages/842af509a11be2f48d24db5d280e1ff67b39537e/icons/pixelorama.png", "author": "Orama Interactive and contributors", "downloadCount": 808, "tags": ["pixelorama"]}