{"description": "**Playnite** is open source video game library manager with one simple goal: Provide unified interface for all your games.\n\n#### Import popular libraries\nLink games from Steam, Origin, GOG, Battle.net and Uplay services, including games that are not installed! Windows Store (UWP) games are also supported.\n\n#### Emulation support\nPlaynite supports wide variety of console emulators.\n\n#### Themes\nPlaynite's look can be fully customized, from simple color changes to complete layout re-designs.\n\n#### Extensions\nPlaynite can be extended with plugins (written in .NET languages) or by scripts (PowerShell and IronPython are currently supported).\n\n#### Fullscreen mode\nFullscreen mode with full controller support is available.\n\n#### Playtime counter\nPlaynite counts time of your game sessions (any game including emulated ones) and can also import your play times from Steam and GOG.\n\n#### Fast\nPlaynites user interface is fast and light on resources, even with large libraries.\n\n#### Portable\nPlaynite can run from any portable storage with option to configure database location for automatic sync via services like DropBox or Google Drive.\n\n#### Completely Free\nNo Playnite features are locked behind paywall and complete source code is available under MIT license.\n\n#### Safe\nPlaynite doesn't store any user information. It stores the same amount of information like web browser when linking accounts (cookies).\n\n#### igdb.com integration\nPlaynite can automatically download metadata for your custom games (covers, descriptions and other information).", "updated": "2024-03-23T22:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/playnite/10.32.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/playnite/10.32.0", "licenseUrl": "https://github.com/JosefNemec/Playnite/blob/master/LICENSE.md", "packageName": "playnite", "displayName": "Playnite", "summary": "Open source video game library manager and launcher with support for 3rd party libraries like Steam, GOG, Origin, Battle.net and Uplay. Including game emulation support, providing one unified interface for your games.", "version": "10.32.0", "icon": "https://cdn.statically.io/gh/TheCakeIsNaOH/chocolatey-packages/36cdec772744c373abeaf3e791fca7a60742d69d/Icons/playnite.png", "author": "Josef Numec", "downloadCount": 46318, "tags": ["playnite", "game", "management", "launcher", "steam", "gog", "uplay", "emulator", "battlenet", "origin"]}