{"description": "Plexamp is a small music player for your desktop, with a number of unique features. Throw your best FLACs at it and experience sonic bliss!\n\nFor a more detailed look at Plexamp's features (and a fun origin story!) check out our [write-up](https://medium.com/plexlabs/introducing-plexamp-9493a658847a).\n\nWhile Plexamp is unsupported, we've provided [Frequently Asked Questions](http://plexamp.com/#help) to aid in your musical adventure.\n\n## Built with Love, Right at Home on your Desktop\n\nGlobal media key support, a high-quality audio path, and a permanent home in your tray.\n\n### Gapless Playback\n\nNo more buzz kill when listening to live albums. Seamlessly transition between tracks on an album.\n\n### Visualizers\n\nBeautiful animations for music, with key colors extracted from album art.\n\n### Loudness Leveling and Smart Transitions\n\nStop reaching for the volume knob. Loudness is normalized and smart transition points are computed between tracks, ensuring optimal listening flow.\n\n### SoundPrints and Waveform Seeking\n\nEnjoy beautiful graphical views of songs, and seek easily to specific places in a song.\n\n### Library and Artist Radio\n\nExplore your library in new ways with Library Radio, Time Travel Radio, and Artist Radio.\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-23T22:18:48Z", "galleryUrl": "https://community.chocolatey.org/packages/plexamp/4.10.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/plexamp/4.10.0", "licenseUrl": "https://www.plex.tv/about/privacy-legal/plex-terms-of-service/", "packageName": "plexamp", "displayName": "Plexamp", "summary": "Plexamp is a small music player for your desktop, with a number of unique features.", "version": "4.10.0", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@d5053b0608730a56c96f7d13b30199671b48ae32/icons/plexamp.png", "author": "Plex", "downloadCount": 16765, "tags": ["plex", "plexamp", "multimedia", "mp3", "audio", "player", "free", "binary"]}