{"description": "There are many sophisticated media management programs available for organising digital media however the key differences that Podcast Utilities has are\n\n*Portable* Podcast Utilities is a “portable” application, in that it does not need to be installed and can be run from any drive type, local network or removable flash drive\n\n*Cross Platform* Podcast Utilities can be run on Windows, Linus or Mac machines by using the .NET Core cross platform version of the utilities.\n\n*Configurable* Almost any synchronisation solution can be configured, for example copy 3 of this podcast, all of these podcasts, in this order, and leave a certain amount of space on the device. The number of concurrent downloads can easily be configured.\n\n*Lightweight* The application does not use large amounts of memory in a system tray icon all the time its not being used, it only uses system resources when its being run.\n\n*Support for UMS* PodcastUtilities supports USB Mass Storage (UMS) devices, where the device appears as a drive letter in Explorer like a flash drive\n\n*Scriptable* Podcast Utilities lends itself to being run as a scheduled task or from a script. The API is “headless” and can easily be called and used from other applications\n\n*Open Source* The source is open and available\n\n*Free* There is no cost to using Podcast Utilities for any use.\n\n*No need for an iTunes account* Podcasts promoted on iTunes can be downloaded however there is no need to have an iTunes account.\n\nThis is the cross platform version and does not support MTP, if you want MTP support (Windows only) version then try the [podcastutilities package](https://community.chocolatey.org/packages/podcastutilities). You probably dont need to install both.", "updated": "2024-03-16T00:18:42Z", "galleryUrl": "https://community.chocolatey.org/packages/podcastutilities-core/3.1.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/podcastutilities-core/3.1.0.0", "licenseUrl": "https://github.com/derekwilson/PodcastUtilities/blob/master/LICENSE.txt", "packageName": "podcastutilities-core", "displayName": "PodcastUtilities Core Install", "summary": "PodcastUtilities are a set of utilities designed to help manage digital media on removable drives. Utilities are provided to Download Podcasts, Sync Podcasts and Generate Playlists", "version": "3.1.0.0", "icon": "", "author": "Andrew Trvarrow, Derek Wilson", "downloadCount": 276, "tags": ["PodcastUtilities", "podcast", "dowload", "sync"]}