{"description": "Portqry.exe reports the status of a TCP/IP port in one of the following three ways:\n\n- Listening\n\nA process is listening on the port on the computer that you selected. Portqry.exe received a response from the port.\n\n- Not Listening\n\nNo process is listening on the target port on the target system. Portqry.exe received an Internet Control Message Protocol (ICMP) \"Destination Unreachable - Port Unreachable\" message back from the target UDP port. Or if the target port is a TCP port, Portqry received a TCP acknowledgement packet with the Reset flag set.\n\n- Filtered\n\nThe port on the computer that you selected is being filtered. Portqry.exe did not receive a response from the port. A process may or may not be listening on the port. By default, TCP ports are queried three times, and UDP ports are queried one time before a report indicates that the port is filtered.\nPortqry.exe can query a single port, an ordered list of ports, or a sequential range of ports.\n\n## Examples\nThe following command tries to resolve \"reskit.com\" to an IP address and then queries TCP port 25 on the corresponding host:  \n`portqry -n reskit.com -p tcp -e 25`\n\nThe following command tries to resolve \"169.254.0.11\" to a host name and then queries TCP ports 143,110, and 25 (in that order) on the host that you selected. This command also creates a log file (Portqry.log) that contains a log of the command that you ran and its output.  \n`portqry -n 169.254.0.11 -p tcp -o 143,110,25 -l portqry.log`\n\nThe following command tries to resolve\nmy_server to an IP address and then queries the specified range of UDP ports (135-139) in sequential order on the corresponding host. This command also creates a log file (my_server.txt) that contains a log of the command that you ran and its output.  \n`portqry -n my_server -p udp -r 135:139 -l my_server.txt`\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/portqry/screenshot.png)", "updated": "2024-03-20T10:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/portqry/2.0.20191106", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/portqry/2.0.20191106", "licenseUrl": "", "packageName": "portqry", "displayName": "PortQry Command Line Port Scanner", "summary": "Portqry.exe is a command-line utility that you can use to help troubleshoot TCP/IP connectivity issues.", "version": "2.0.20191106", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/portqry/portqry.png", "author": "Microsoft", "downloadCount": 11847, "tags": ["portqry", "network", "troubleshoot", "connectivity", "tcp", "udp"]}