{"description": "PowerShell cmdlet helpers for working with the GitHub API.\n\n* New-GitHubOAuthToken - creates an OAuth token for use with GitHub\n* Get-GitHubOAuthTokens - Used to list all the authorizations you have provided\nto applications / tooling\n* Set-GitHubUserName - Adds the username to the current PowerShell session and\nsets a global User environment variable\n* Set-GitHubOrganization - Adds the organization to the current PowerShell\nsession and sets a global User environment variable\n* Get-GitHubRepositories - List all your repositories - gives a fork indicator,\na date for when the last update (push) occurred, how many open issues and size\n* New-GitHubRepository - Creates a new GitHub repository and clones it locally\nby default.\n* New-GitHubFork - Forks a repository, clones it locally, then properly adds a\nremote named upstream to point back to the parent repository.  Aborts if there\nis a directory in the current working directory that shares the name of the\nrepository.\n* Get-GitHubIssues - List issues against the repository for the current working\ndirectory, or can list issues against a specific repo and owner.\n* New-GitHubPullRequest - Initiates a new pull request to the upstream repo.\n* Get-GitHubPullRequests - List pull requests against the repository for the\ncurrent working directory, or can list pull requests against all forks from a user.\n* Get-GitHubTeams - The default parameterless version will use the GITHUB_ORG\nenvironment variable to get the list of teams, their ids and members.\n* Get-GitHubEvents - Will list, in chronological order, the last 30 events that\nyou have generated\n* Clear-GitMergedBranches - Will remove any local branch cruft from branches\nthat have been merged into the master branch.", "updated": "2024-03-24T00:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/Posh-GitHub/0.0.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Posh-GitHub/0.0.2", "licenseUrl": "", "packageName": "Posh-GitHub", "displayName": "Posh-GitHub - PowerShell GitHub API helpers", "summary": "PowerShell cmdlet helpers for working with GitHub", "version": "0.0.2", "icon": "https://github.com/Iristyle/ChocolateyPackages/raw/master/Posh-GitHub/Posh-GitHub.png", "author": "Ethan J Brown", "downloadCount": 18858, "tags": ["powershell", "shell", "git", "github"]}