{"description": "A PowerShell IDE which offers numerous unique and helpful features.\n\n* Learn PowerShell quickly from the interactive learning center\n* Execute PowerShell fast and accurately using the powerful IDE\n* Access hundreds of pre-loaded scripts from the QuickClick Library\n* Use the script editor to code & debug PowerShell faster\n* Visit the IDERA PowerShell Community for the latest tips and scripts\n\n### Interactive Learning Center\nExperience PowerShell by example. Short tutorials guide you through basic concepts at your own pace. The comprehensive learning center also includes dynamically created help topics from currently installed PowerShell CmdLets, Snap-Ins, Modules, Providers and WMI objects.\n\n### Powerful IDE\nThe Console allows you to work interactively with PowerShell from a feature rich Windows UI. The Start page offers easy access to tasks, recent files and Getting Started topics. Plus, many productivity tools including System Explorer, Variables Monitor, Code Snippets, Command History, Remoting and many others.\n\n### Pre-loaded Scripts\nAccess hundreds of pre-loaded scripts for SQL Server, SharePoint, Active Directory and Exchange from the QuickClick™ Library. The tree structure organization lets you easily execute scripts in the Interactive Console, edit in the Code Editor and publish as self-contained XML documents that can be shared with colleagues and friends. PowerShell Plus includes all the scripts from the IDERA PowerShell Scripts for SQL Server free download.\n\n### Advanced Script Editor\nThe advanced debugger and script editor lets you build and test complex PowerShell scripts, try one line PowerShell commands from an embedded console, and sign your script with a security certificate all from a single workspace. Editor and encoding features include: code folding, bookmarks, breakpoints, formatting, find and replace, and much more.\n\n### Download Community Scripts\nSearch and download thousands of community scripts from PoshCode and Tech Net script center libraries – directly from the PowerShell Plus console and editor. Plus, publish and share scripts you have created to any network share.\n\n**NOTE**: This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T15:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/powershellplus/11.50.0.42619", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/powershellplus/11.50.0.42619", "licenseUrl": "https://www.idera.com/legal/termsofuse", "packageName": "powershellplus", "displayName": "Powershell Plus", "summary": "A PowerShell IDE which offers numerous unique and helpful features.", "version": "11.50.0.42619", "icon": "https://cdn.rawgit.com/pauby/ChocoPackages/2de2df9d/icons/powershellplus.png", "author": "IDERA,  Inc.", "downloadCount": 3594, "tags": ["admin", "idera", "powershell", "ide", "programmer", "editor"]}