{"description": "---\n\n### [choco://prime95.portable](choco://prime95.portable)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of Prime95](https://upload.wikimedia.org/wikipedia/commons/c/c0/Prime95_screenshot.png)\t\n### CPU Stress / Torture Testing\nPrime95 has been a popular choice for stress / torture testing a CPU since it's introduction, especially with overclockers and system builders. Since the software makes heavy use of the processor's integer and floating point instructions, it feeds the processor a consistent and verifiable workload to test the stability of the CPU and the L1/L2/L3 processor cache. Additionally, it uses all of the cores of a multi-CPU / multi-core system to ensure a high-load stress test environment.\n\n\nFrom the most recent \"[stress.txt](https://www.mersenne.org/download/stress.txt)\" file included in the download:\n\n\nToday's computers are not perfect. Even brand new systems from major manufacturers can have hidden flaws. If any of several key components such as CPU, memory, cooling, etc. are not up to spec, it can lead to incorrect calculations and/or unexplained system crashes.\n\n\nOverclocking is the practice of increasing the speed of the CPU and/or memory to make a machine faster at little cost. Typically, overclocking involves pushing a machine past its limits and then backing off just a little bit.\n\n\nFor these reasons, both non-overclockers and overclockers need programs that test the stability of their computers. This is done by running programs that put a heavy load on the computer. Though not originally designed for this purpose, this program is one of a few programs that are excellent at stress testing a computer.\n\n\nThe [Prime95 Wikipedia page](https://en.wikipedia.org/wiki/Prime95#Use_for_stress_testing) has an excellent overview on using Prime95 to test your system and ensure it is working properly. The tips presented there should be helpful regarding how long to run the torture test and provide a solid guideline on how long to run the Prime95 stress test.\n\n\n#### Performing a stress test is simple:\n\n1. Download the software and unzip the files to your desired location. (Chocolatey does that for you!)\n2. Run the Prime95 executable and select \"Just Stress Testing\" when asked.\n3. The default options are sufficient to do a well balanced stress test on the system.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/prime95.portable/readme.md)**\n    \n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-23T19:33:31Z", "galleryUrl": "https://community.chocolatey.org/packages/prime95.portable/30.3.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/prime95.portable/30.3.6", "licenseUrl": "http://www.mersenne.org/legal/#EULA", "packageName": "prime95.portable", "displayName": "Prime95 (Portable)", "summary": "Free Mersenne Prime Search Software - Prime95", "version": "30.3.6", "icon": "http://www.mersenne.org/images/logo.gif", "author": "George Woltman", "downloadCount": 5112, "tags": ["prime95", "stress", "test", "burn-in", "portable"]}