{"description": "User Profile Wizard Release 24\nSimple. Scalable. Low cost\nUser Profile Wizard 24 is the latest version of ForensiT's powerful workstation migration tool. User Profile Wizard will migrate your current user profile to your new user account so that you can keep all your existing data and settings.\n\n\nLarge-scale migration made easy\nUser Profile Wizard has been used to automatically migrate millions of workstations to new domains. It can be used to migrate workstations to a new domain from any existing Windows network; it can join standalone computers to a domain for the first time, or migrate workstations from a domain back to a workgroup; it can also migrate user profiles to Azure AD user accounts.\n\n\nNo need to lose personal data and settings\nA User Profile is where Windows stores your stuff. Normally, when you change your user account Windows will create a new profile for you, and you lose all your data and settings - your “Documents”, “Pictures” and “Music” files and all the other information that makes your computer personal to you, like your desktop wallpaper, Internet favorites and the lists of documents you've recently opened.\n\nUser Profile Wizard is an easy-to-use migration tool that means this doesn’t need to happen – you can simply migrate your original profile to your new user account. User Profile Wizard does not move, copy or delete any data. Instead it configures the profile “in place” so that it can be used by your new user account. This makes the process both very fast and very safe.\n\nWith the User Profile Wizard Deployment Kit you can build a scalable, enterprise solution to automatically migrate tens of thousands of workstations.\n\n\nBenefits\nMigrates all user profile data and settings on Windows 10 and Windows 7\nAutomatically joins a machine to a new domain\nMigrates profiles to Azure AD\nSupports domain migrations over a VPN\nSupports all Active Directory and Samba domains\nMigrates from a domain back to a workgroup\nIncludes Enterprise strength scripting support\nSupports push migrations of remote machines\nTried and trusted - over 2.5 million licenses sold\n\nMore information\nPlease refer to the User Profile Wizard User Guide for full details on using User Profile Wizard.  If you would like to evaluate the Corporate Edition of User Profile Wizard please contact sales@ForensiT.com.", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/profwiz/3.24", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/profwiz/3.24", "licenseUrl": "https://www.forensit.com/Profwiz/END-USER LICENSE AGREEMENT.rtf", "packageName": "profwiz", "displayName": "User Profile Wizard Release 24", "summary": "User Profile Wizard comes in two editions. Read our User Profile Wizard Feature Comparison to find out what features are availble in the Corporate and Professional editions. The Corporate Edition is licensed per workstation. The Professional Edition is licensed per technician.", "version": "3.24", "icon": "https://rawcdn.githack.com/boubou/chocolatey/42982687155b12e773ed67c41a0549bf098b6af2/packages/icons/forensitdomainmigration.jpg", "author": "ForensiT Ltd", "downloadCount": 5768, "tags": ["domain", "migration", "user", "profile", "wizard"]}