{"description": "Psi is a free instant messaging application designed for the open protocol XMPP network. Fast and lightweight, Psi is fully open-source and compatible with Windows, Linux, and Mac OS X.\n\nExtensible Messaging and Presence Protocol (XMPP) is an open technology for real-time communication, which powers a wide range of applications including instant messaging, presence, multi-party chat, voice and video calls, collaboration, lightweight middleware, content syndication, and generalized routing of XML data.  See http://xmpp.org/\n\nBecause XMPP allows gateways to other services, which many servers support, it can also connect to Yahoo!, AIM, Gadu-Gadu, ICQ and Microsoft networks. Other services available using gateway servers, include RSS and Atom news feeds, sending SMS messages to cellular networks and weather reports.\n\nPsi has built in GnuPG support for message encryption.  With Psi's full Unicode support and localizations, easy file transfers, customizable iconsets, and many other great features, you'll learn why users around the world are making the switch to free, open instant messaging.\n\n### User support forum\n* https://groups.google.com/forum/#!forum/psi-users\n\n### Source code\n* https://github.com/psi-im/psi\n* https://groups.google.com/forum/#!forum/psi-users\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-23T22:33:38Z", "galleryUrl": "https://community.chocolatey.org/packages/psi.portable/1.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/psi.portable/1.4", "licenseUrl": "https://github.com/psi-im/psi/blob/master/COPYING", "packageName": "psi.portable", "displayName": "Psi (Portable)", "summary": "Instant messaging application for the XMPP network", "version": "1.4", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@d8c446cc443361885a3ac97f172d559c02e5a713/icons/psi.png", "author": "Justin Karneges, Kevin Smith", "downloadCount": 1345, "tags": ["xmpp", "messenger", "chat", "gnupg", "qt"]}