{"description": "Psiphon Circumvention System is an [open source](https://psiphon.ca/en/open-source.html#content) relay-based Internet censorship circumventer.\n\nThe system consists of a client application, which configures a users computer to direct Internet traffic; and a set of servers, which proxy client traffic to the Internet. As long as a client can connect to a Psiphon server, it can access Internet services that may be blocked to the user via direct connection.\n\n#### Design goals\n* The Internet is not World Wide if someone somewhere is denied access.\n* The right to freedom of opinion and expression affects us all, even if censorship does not.\n\n#### Security note\nTo accomplish its design goals, Psiphon uses computer security technology including encryption and digital signatures. Using these algorithms does not mean Psiphon 3 offers additional security properties such as privacy or authentication of destination sites for users' Internet traffic. [[ref](https://bitbucket.org/psiphon/psiphon-circumvention-system/src#markdown-header-security-properties)]\n\nFor additional information about how Psiphon works, please see the [FAQ](https://psiphon.ca/en/faq.html#content).\n\n#### Cloud service client\nPsiphon is a program that uses various tunnelling technologies to securely connect to a cloud service. Please be aware that this program is anti-censorship and does not guarantee privacy. To determine what information is collected by your usage of the service and how it may be used, please see the [privacy policy](https://psiphon.ca/en/privacy.html#content).", "updated": "2024-03-23T21:33:37Z", "galleryUrl": "https://community.chocolatey.org/packages/psiphon/3.0.0.20150720", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/psiphon/3.0.0.20150720", "licenseUrl": "https://psiphon.ca/en/license.html", "packageName": "psiphon", "displayName": "Psiphon", "summary": "Relay-based Internet censorship circumventer", "version": "3.0.0.20150720", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/b73d2c5821ffb73f332d3227721eccd3bec0a012/icons/psiphon.png", "author": "Psiphon Inc", "downloadCount": 3041, "tags": ["anti-censorship", "tunnel", "proxy", "vpn", "ssh", "cloud", "p2p"]}