{"description": "Dump event log records.\n\nThe Resource Kit comes with a utility, elogdump, that lets you dump the contents of an Event Log on the local or a remote computer. PsLogList is a clone of elogdump except that PsLogList lets you login to remote systems in situations your current set of security credentials would not permit access to the Event Log, and PsLogList retrieves message strings from the computer on which the event log you view resides.\n\n#### Command line usage\n\nThe default behavior of _PsLogList_ is to show the contents of the System Event Log on the local computer, with visually-friendly formatting of Event Log records. Command line options let you view logs on different computers, use a different account to view a log, or to have the output formatted in a string-search friendly way.\n\n__psloglist__ [- ] [\\\\\\\\computer[,computer[,...] | @file [-u username [-p password]]] [-s [-t delimiter]] [-m #|-n #|-h #|-d #|-w][-c][-x][-r][-a mm/dd/yy][-b mm/dd/yy][-f filter] [-i ID[,ID[,...] | -e ID[,ID[,...]]] [-o event source[,event source][,..]]] [-q event source[,event source][,..]]] [-l event log file] <_eventlog_>\n\n__@file__\n`     Execute the command on each of the computers listed in the file.`\n\n__-a__\n`     Dump records timestamped after specified date.`\n\n__-b__\n`     Dump records timestamped before specified date.`\n\n__-c__\n`     Clear the event log after displaying.`\n\n__-d__\n`     Only display records from previous n days.`\n\n__-c__\n`     Clear the event log after displaying.`\n\n__-e__\n`     Exclude events with the specified ID or IDs (up to 10).`\n\n__-f__\n`     Filter event types with filter string (e.g. \"-f w\" to filter warnings).`\n\n__-h__\n`     Only display records from previous n hours.`\n\n__-i__\n`     Show only events with the specified ID or IDs (up to 10).`\n\n__-l__\n`     Dump records from the specified event log file.`\n\n__-m__\n`     Only display records from previous n minutes.`\n\n__-n__\n`     Only display the number of most recent entries specified.`\n\n__-o__\n`     Show only records from the specified event source (e.g. \\\"-o cdrom\\\").`\n\n__-p__\n`     Specifies optional password for user name. If you omit this you will be prompted to enter a hidden password.`\n\n__-q__\n`     Omit records from the specified event source or sources (e.g. \\\"-q cdrom\\\").`\n\n__-r__\n`     SDump log from least recent to most recent.`\n\n__-s__\n`     This switch has _PsLogList_ print Event Log records one-per-line, with comma delimited fields. This format is convenient for text searches, e.g. psloglist | findstr /i text, and for importing the output into a spreadsheet.`\n\n__-t__\n`     The default delimeter is a comma, but can be overriden with the specified character.`\n\n__-u__\n`     Specifies optional user name for login to remote computer.`\n\n__-w__\n`     Wait for new events, dumping them as they generate (local system only).`\n\n__-x__\n`     Dump extended data`\n\n__eventlog__\n`     eventlog.`", "updated": "2024-03-23T00:48:31Z", "galleryUrl": "https://community.chocolatey.org/packages/psloglist/2.81", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/psloglist/2.81", "licenseUrl": "https://technet.microsoft.com/en-us/sysinternals/bb469936", "packageName": "psloglist", "displayName": "PsLogList", "summary": "Dump event log records", "version": "2.81", "icon": "", "author": "Mark Russinovich", "downloadCount": 1556, "tags": ["eventlog", "dump", "tools", "sysinternals"]}