{"description": "PsService is a service viewer and controller for Windows. Like the SC utility that's included in the Windows NT and Windows 2000 Resource Kits, PsService displays the status, configuration, and dependencies of a service, and allows you to start, stop, pause, resume and restart them. Unlike the SC utility, PsService enables you to logon to a remote system using a different account, for cases when the account from which you run it doesn't have required permissions on the remote system. PsService includes a unique service-search capability, which identifies active instances of a service on your network. You would use the search feature if you wanted to locate systems running DHCP servers, for instance.\n\n#### Command line usage\n\nThe default behavior of _PsService_ is to display the configured services (both running and stopped) on the local system. Entering a command on the command-line invokes a particular feature, and some commands accept options. Typing a command followed by \"- \" displays information on the syntax for the command.\n\n__psservice__ [\\\\\\\\computer [__-u__ username] [__-p__ password]] <_command_> <_options_>\n\n__query__\n`     Displays the status of a service.`\n\n__config__\n`     Displays the configuration of a service.`\n\n__setconfig__\n`     Sets the start type (disabled, auto, demand) of a service.`\n\n__start__\n`     Starts a service.`\n\n__stop__\n`     Stops a service.`\n\n__restart__\n`     Stops and then restarts a service.`\n\n__pause__\n`     Pauses a service`\n\n__cont__\n`     Resumes a paused service.`\n\n__depend__\n`     Lists the services dependent on the one specified.`\n\n__security__\n`     Dumps the service's security descriptor.`\n\n__find__\n`     Searches the network for the specified service.`\n\n__\\\\\\\\computer__\n`     Targets the NT/Win2K system specified. Include the -u switch with a username and password to login to the remote system if your security credentials do not permit you to obtain performance counter information from the remote system. If you specify the -u option, but not a password with the -p option, _PsService_ will prompt you to enter the password and will not echo it to the screen.`", "updated": "2024-03-18T04:33:31Z", "galleryUrl": "https://community.chocolatey.org/packages/psservice/2.25", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/psservice/2.25", "licenseUrl": "https://technet.microsoft.com/en-us/sysinternals/bb469936", "packageName": "psservice", "displayName": "PsService", "summary": "View and control services", "version": "2.25", "icon": "", "author": "Mark Russinovich", "downloadCount": 1470, "tags": ["service", "tools", "sysinternals"]}