{"description": "Suspend and resume processes.\n\nPsSuspend lets you suspend processes on the local or a remote system, which is desirable in cases where a process is consuming a resource (e.g. network, CPU or disk) that you want to allow different processes to use. Rather than kill the process that's consuming the resource, suspending permits you to let it continue operation at some later point in time.\n\n#### Command line usage\n\nRunning _PsSuspend_ with a process ID directs it to suspend or resume the process of that ID on the local computer. If you specify a process name _PsSuspend_ will suspend or resume all processes that have that name. Specify the -r switch to resume suspended processes.\n\n__pssuspend__ [__- __] [__-r__] [\\\\computer [__-u__ username] [__-p__ password]] <_process name_ | _process id_>\n\n__-__\n`     `Displays the supported options.\n\n__-r__\n`     `Resumes the specified processes specified if they are suspended.\n\n__\\\\computer__\n`     `Specifies the computer on which the process you want to suspend or resume is executing. The remote computer must be accessible via the NT network neighborhood.\n\n__-u username__\n`     `If you want to suspend a process on a remote system and the account you are executing in does not have administrative privileges on the remote system then you must login as an administrator using this command-line option. If you do not include the password with the -p option then _PsSuspend_ will prompt you for the password without echoing your input to the display.\n\n__-p password__\n`     `This option lets you specify the login password on the command line so that you can use _PsSuspend_ from batch files. If you specify an account name and omit the -p option _PsSuspend_ prompts you interactively for a password.\n\n__process id__\n`     `Specifies the process ID of the process you want to suspend or resume.\n\n__process name__\n`     `Specifies the process name of the process or processes you want to suspend or resume.", "updated": "2024-03-21T16:18:36Z", "galleryUrl": "https://community.chocolatey.org/packages/pssuspend/1.07", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pssuspend/1.07", "licenseUrl": "https://technet.microsoft.com/en-us/sysinternals/bb469936", "packageName": "pssuspend", "displayName": "PsSuspend", "summary": "Suspend and resume processes", "version": "1.07", "icon": "", "author": "Mark Russinovich", "downloadCount": 1502, "tags": ["suspend", "sysinternals"]}