{"description": "---\n\n###[choco://pst-merger](choco://pst-merger)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of PST Merger](http://www.pst-merger.com/i/ScreenShots/select_files_and_folders_screenshots.png)\n\t\n##Merge Outlook PST files with Free PST Merger.\n\t\nIf you have numerous PST (Outlook Personal Folders) files on your computer, it gets difficult to manage all of them. By using PST Merger, you can merge all PST files into a single file just in a few clicks.\nFree PST merger is useful when you have to combine two PST files. Free PST Merger allows you to merge Outlook PST files into a new PST file. It is a simple PST merge tool that does not require special IT knowledge.\nUse PST Merger Pro for merging more than two files or when you need advanced PST merging management features like filters or folders selection. By using this tool, you can copy or combine the content from several Microsoft Outlook files to a specified file. You can also transfer the specified Microsoft Outlook data from several files to a new Outlook file. This allows you to transfer only important Outlook folders to your new PST file. Merge any items from PST files, such as, Inboxes, Calendars, Contacts, Journals, Tasks etc. to another PST file. One more advantage is that you can store your new PST file in any convenient location. You can easily open PST files with OST PST Viewer.\nIf you have to merge PST files frequently, PST Merger will save your valuable time by merging Outlook PST files in just a couple of clicks. In case your PST files contain a lot of data, to merge such files manually may not be possible. Using PST Merger can combine PST files of Microsoft Outlook with ease.\n\nSee [website](http://www.pst-merger.com/) for complete list of features. (Too big to list here.)\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/autobootdisk/readme.md)**\n\t\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-22T21:33:45Z", "galleryUrl": "https://community.chocolatey.org/packages/pst-merger/1.03.5016", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pst-merger/1.03.5016", "licenseUrl": "http://www.4team.biz/TermsAndPrivacy.aspx", "packageName": "pst-merger", "displayName": "Free PST Merger (Install)", "summary": "Free PST Merger - merge multiple PST files into a single file.", "version": "1.03.5016", "icon": "http://www.pst-merger.com/i/logo.png", "author": "4Team Corporation", "downloadCount": 1904, "tags": ["4team", "outlook", "pst", "merger"]}