{"description": "Synchronise your files without also sharing them with a stranger in the cloud.  Pulse is a low-level synchronisation engine for developers and technically-savvy users. If the thought of opening up a Terminal window makes you feel queasy, wait for Heartbeat.\n\n*  Private. Your data is only stored on your own devices. You don’t have to share with a stranger in a cloud.\n*  Encrypted. All communication is secured using TLS. Uses perfect forward secrecy to prevent eavesdroppers from ever gaining access to your data.\n*  Authenticated. Every node is identified by a strong cryptographic certificate. Only nodes you have explicitly allowed can connect to your cluster.\n*  Source code is available under GNU GPL v3 or later: https://source.ind.ie/project/pulse/tree/master\n*  Fork of Syncthing \n\nFor developers, Pulse offers a:\n\n*  simple and straighforward workflow.\n*  Web UI. Configure and monitor Pulse via a responsive and powerful interface accessible via your browser.\n*  Portable. Works on Mac OS X, Windows, Linux, FreeBSD and Solaris. Run it on your desktop computers and synchronise them with your server for backup.\n*  Simple. Pulse doesn't need IP addresses or advanced configuration. It just works over LAN and over the Internet. Every machine is identified by an ID. Just give your ID to you friends, share a folder, and watch.\n*  Powerful. Synchronise as many folders as you need with different people.", "updated": "2024-03-23T16:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/pulse/0.1.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pulse/0.1.4", "licenseUrl": "https://source.ind.ie/project/pulse/tree/master#license", "packageName": "pulse", "displayName": "Pulse", "summary": "Distributed file synchronisation engine", "version": "0.1.4", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/341e0a0169c6f598cdb86b184b666d5108117790/icons/pulse.png", "author": "ind.ie", "downloadCount": 3662, "tags": ["api", "backup", "synchronisation", "engine"]}