{"description": "Purple Pen is course setting software for orienteering. Purple Pen makes it easy to design orienteering courses and their associated control descriptions.\n\nDesign your courses visually — directly on any OCAD map, OpenOrienteering Map, or PDF map. View the course and the control descriptions at the same time, and simply click on the control descriptions to set the correct description for each control. Purple Pen automatically does all the busywork:\n\n- Print maps with courses overprints directly (without needing OCAD), or export course maps to OCAD or OpenOrienteering Mapper for final printing, or create PDF files for a print shop.\n- Use either an OCAD map (OCAD versions 6-12 supported), OpenOrienteering Mapper map, PDF map, or bitmap map (JPG, GIF, PNG, TIFF, BMP).\n- Print a perfectly formatted control description sheet, with symbolic or textual descriptions (or both). Textual descriptions are automatically generated. Description sheets can be placed onto the map.\n- Calculate the length of each course automatically.\n- Make sure that the codes and descriptions of shared controls are in sync.\n- View or print an all controls map.\n- Easily change control codes — one at a time or all at once.\n- Calculate how many competitors are visiting a control or running a leg.\n- Print master punch cards for easy control card checking.\n- Export course data to event management or electronic punching software (IOF standard XML format, version 2 or version 3).\n- View or print several different reports about the courses and controls.\n- Download control locations to your mobile GPS device.\n- Supports both the IOF 2000 and 2018 control description standards.\n\nBest of all, Purple Pen is completely free software.", "updated": "2024-03-16T10:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/purplepen/3.5.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/purplepen/3.5.0", "licenseUrl": "", "packageName": "purplepen", "displayName": "Purple Pen", "summary": "Simple, versatile, and free course setting software for orienteering", "version": "3.5.0", "icon": "https://cdn.jsdelivr.net/gh/usm-community/chocolatey-packages@master/icons/purplepen.png", "author": "Peter Golde", "downloadCount": 837, "tags": ["Purple", "Pen", "PurplePen", "course", "orienteering"]}