{"description": "![Screenshot of Pushbullet Chrome extension](https://lh3.googleusercontent.com/Y7RXy25ZCVYJ7dRbEJkOeKsKSrxf4O9sAQoaKc6nbZia3QGgL7YLes2X0bdCFVu2RAysCsWiNw=s640-h400-e365-rw)\n\t\n###Bringing together your devices, friends, and the things you care about.\n\nPushbullet is \"the app you never knew you needed\", according to CNET. Here's why:\n\nSTAY CONNECTED\n• Conveniently send and receive SMS messages from your computer (requires Android)\n• Reply to messages from many popular apps including WhatsApp, Kik, and Facebook Messenger (requires Android)\n• Easily share links and files between your devices, or with friends\n\nNEVER MISS A NOTIFICATION\n• See all of your phone's notifications on your computer, including phone calls (requires Android)\n• Dismiss a notification on your computer and it goes away on your phone too\n• Use Pushbullet Channels to subscribe to timely notifications about things you care about\n\nSAVE TIME\n• Text from your computer using your keyboard instead of grabbing your phone\n• The easiest way to get a link or file onto your phone to open or share\n• Deal with notifications on your computer as they arrive\n\n\"Pushbullet Is a Fantastic App Every Phone Should Have\" - Gizmodo\n\n\"TNW’s Apps of the Year: PushBullet for Android\" - TNW\n\n★ Secure: Protect your notifications and SMS with end-to-end encryption\n★ Used by millions of people and counting\n★ Translated into over a dozen languages by an awesome group of our own users\n\nSee all the places Pushbullet is available: https://www.pushbullet.com/apps\n\t\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-22T00:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/pushbullet-chrome/336.0.20170115", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pushbullet-chrome/336.0.20170115", "licenseUrl": "https://www.pushbullet.com/tos", "packageName": "pushbullet-chrome", "displayName": "Pushbullet for Chrome", "summary": "Pushbullet Chrome extension", "version": "336.0.20170115", "icon": "https://lh4.googleusercontent.com/gpPq_ErVW-i1W3mFuqqAN5LCN_upxlQIqNfKtLOLyzb9CzM1_ZfO37f57YEPIRg4vqn00mAS2Q=s26-h26-e365-rw", "author": "pushbullet.com", "downloadCount": 1453, "tags": ["pushbullet", "chrome", "extension"]}