{"description": "PVS-Studio is a tool for detecting bugs and security weaknesses in the source code of programs, written in C, C++, C# and Java. It works under 64-bit systems in Windows, Linux and macOS environments, and can analyze source code intended for 32-bit, 64-bit and embedded ARM platforms. \n\nCheck [this page](https://pvs-studio.com/en/pvs-studio/) to get more info.\nThis software requires an activation key. You can get trial [here](https://pvs-studio.com/en/pvs-studio/try-free/).\n\nDefault installation contains a core command-line analyzer engine (C, C++, C#).\tThe 'Core' component is a mandatory one, it contains a core command-line analyzer engine, which is required for all of the IDE extension plug-ins to operate. You can also install the following additional components: Standalone, MSVS2010, MSVS2012, MSVS2013, MSVS2015, MSVS2017, MSVS2019, MSVS2022, IDEA, JavaCore, Rider, CLion.\nBrief description of components:\n- components with 'MSVS' prefix in their name are corresponding to Microsoft Visual Studio plug-in extensions;\n- the Standalone component installs compiler monitoring system, which allows to analyze any kind of C, C++ project as long as such project uses one of the supported compilers;\n- the 'IDEA' component corresponds to the PVS-Studio plugin for the IntelliJ IDEA development environment;\n- the 'JavaCore' component corresponds to the analyzer core for Java;\n- the 'Rider' component corresponds to the PVS-Studio plugin for the Rider development environment.", "updated": "2024-03-23T21:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/pvs-studio/7.29.79138.771", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pvs-studio/7.29.79138.771", "licenseUrl": "http://files.pvs-studio.com/License.rtf", "packageName": "pvs-studio", "displayName": "PVS-Studio", "summary": "PVS-Studio is a tool for detecting bugs and security weaknesses in the source code of programs, written in C, C++, C# and Java.", "version": "7.29.79138.771", "icon": "http://files.pvs-studio.com/logo.png", "author": "PVS-Studio", "downloadCount": 6986, "tags": ["PVS-Studio", "static-code-analysis", "C++", "C#", "Java", "SAST", "MISRA", "CWE", "CERT", "OWASP"]}