{"description": "![Screenshot of AOMEI PXE Boot Tool](http://www.backup-utility.com/help/images/pxe-boot/image002.jpg)\n\n##A free tool attached with AOMEI Backupper\n\nBoot multiple client computers within same LAN through the network\nbooting from an image file on a server computer for system maintenance\nand optimization.\t\n\n###Overview of AOMEI PXE Boot Tool\n\nThe main function of AOMEI PXE Boot Tool is to boot your computers from an image file on network. It’s easy to use it. After installation, you just need a few clicks following the guide. Besides, it supports synchronous boot of multiple computers.\n\n###When to Use AOMEI PXE Boot Tool?\n\n* You need to maintain or install system for multiple computers and it’s impossible to insert CD or USB into these computers one by one.\n* Your computer cannot start normally already and it can’t boot through loading image file on inner hard drive.\n* You have a server and a lot of clients within LAN, but these clients may have no CD-ROM drive and USB ports.\n* Or the CD-ROM drive and USB ports are unavailable.\n* Or, you have no CD or USB image at hand to boot up the multiple clients.\n\n###Advantages of AOMEI PXE Boot Tool\n####Strong Compatibility\nCompared with other PXE boot tools, AOMEI PXE Boot Tool supports bootable micro-system created by you. Therefore, if you have a powerful Linux bootable ISO or Windows PE bootable ISO, you can easily maintain the computers within LAN through network with your micro-system.\n\n####Freeware\nAOMEI PXE Boot is a free software for personal and system manager, aims to provide users with a faster and easier method to build your PXE server and cheer users. So, please be assured use.\n\n####Easy Interaction\nSpecial designed for network boot, easy interaction and uses it in two steps:\n* Install AOMEI PXE Boot to a master computer, select an image file and start service.\n* For the client computers need to be maintained from network boot, set its BIOS boot mode as \"Network boot\".", "updated": "2024-03-17T23:04:12Z", "galleryUrl": "https://community.chocolatey.org/packages/pxe-boot-tool/1.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/pxe-boot-tool/1.5", "licenseUrl": "http://www.backup-utility.com/terms.html", "packageName": "pxe-boot-tool", "displayName": "AOMEI PXE Boot Tool (Install)", "summary": "AOMEI PXE Boot Tool FREE", "version": "1.5", "icon": "http://www.aomeitech.com//partners/marketing-material/logo/aomeilogo-jpg.jpg", "author": "AOMEI", "downloadCount": 1731, "tags": ["aomei", "pxe", "boot", "tool", "admin"]}