{"description": "virtualenv is a tool to create isolated Python environments. Since Python 3.3, a subset of it has been integrated into the standard library under the venv module. The venv module does not offer all features of this library, to name just a few more prominent:\n- is slower (by not having the app-data seed method),\n- is not as extendable,\n- cannot create virtual environments for arbitrarily installed python versions (and automatically discover these),\n- is not upgrade-able via pip,\n- does not have as rich programmatic API (describe virtual environments without creating them).\n\nThe basic problem being addressed is one of dependencies and versions, and indirectly permissions. Imagine you have an application that needs version 1 of LibFoo, but another application requires version 2. How can you use both these libraries? If you install everything into your host python (e.g. python3.8) it’s easy to end up in a situation where two packages have conflicting requirements.\n\nOr more generally, what if you want to install an application and leave it be? If an application works, any change in its libraries or the versions of those libraries can break the application. Also, what if you can’t install packages into the global site-packages directory, due to not having permissions to change the host python environment?\n\nIn all these cases, virtualenv can help you. It creates an environment that has its own installation directories, that doesn’t share libraries with other virtualenv environments (and optionally doesn’t access the globally installed libraries either).", "updated": "2024-03-23T09:48:54Z", "galleryUrl": "https://community.chocolatey.org/packages/python3-virtualenv/20.25.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/python3-virtualenv/20.25.1", "licenseUrl": "https://github.com/pypa/virtualenv/blob/main/LICENSE", "packageName": "python3-virtualenv", "displayName": "Virtualenv", "summary": "A tool for creating isolated virtual python environments.", "version": "20.25.1", "icon": "", "author": "Bernat Gabor", "downloadCount": 2723, "tags": ["python3-virtualenv", "python", "virtual", "environment", "venv"]}