{"description": "Cheetah:\n\n    - is supported by every major Python web framework.\n    - is fully documented and is supported by an active user community.\n    - can output/generate any text-based format.\n    - compiles templates into optimized, yet readable, Python code.\n    - blends the power and flexibility of Python with a simple template language that non-programmers can understand.\n    - gives template authors full access to any Python data structure, module, function, object, or method in their templates. Meanwhile, it provides a way for administrators to selectively restrict access to Python when needed.\n    - makes code reuse easy by providing an object-oriented interface to templates that is accessible from Python code or other Cheetah templates. One template can subclass another and selectively reimplement sections of it. Cheetah templates can be subclasses of any Python class and vice-versa.\n    - provides a simple, yet powerful, caching mechanism that can dramatically improve the performance of a dynamic website.\n    - encourages clean separation of content, graphic design, and program code. This leads to highly modular, flexible, and reusable site architectures, shorter development time, and HTML and program code that is easier to understand and maintain. It is particularly well suited for team efforts.\n    - can be used to generate static html via its command-line tool.\n\n    Note that this package will install _namemapper.pyd for the appropriate\n    Python version as well.", "updated": "2024-03-21T23:48:29Z", "galleryUrl": "https://community.chocolatey.org/packages/Python.Cheetah/2.4.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Python.Cheetah/2.4.4", "licenseUrl": "https://github.com/cheetahtemplate/cheetah/blob/master/LICENSE", "packageName": "Python.Cheetah", "displayName": "Python-Powered Open Source Template Engine", "summary": "Cheetah is an open source template engine and code generation tool, written in Python. It can be used standalone or combined with other tools and frameworks. Web development is its principle use, but Cheetah is very flexible and is also being used to generate C++ game code, Java, sql, form emails and even Python code.", "version": "2.4.4", "icon": "https://github.com/Iristyle/ChocolateyPackages/raw/master/Python.Cheetah/Python.Cheetah.jpg", "author": "Tavis Rudd,  R. Tyler Croy,  Open Source contributors", "downloadCount": 6455, "tags": ["Python", "template", "cheetah", "code", "generation"]}