{"description": "QElectroTech, or QET in short, is a libre and open source desktop application to create diagrams and schematics.\nThe software is primarily intended to create electrical documentation but it can also be used to draw any kinds of diagrams, such as those made in pneumatics, hydraulics, process industries, electronics...\nGenerally speaking, QET is a **CAD/CAE editor focusing on schematics drawing features.**\n\nThis means that there are no embedded simulating or calculating functionalities and it is not planned to implement them.\n\n![Venn diagram example](https://qelectrotech.org/gallery/photos/equipement_d%27un_volet_roulant.png)\n\n### Features\n* Toolbars and panels can be enabled/disabled, moved and displayed the way you want to work.  \n* Stack panels (as tabs), place them on the sides (as docks), or completely separated from the main window (as windows).  \n* The GUI fits to small or big screens, and even to multi-display configurations.\n* Translated in 19 languages.  \n* Create professional quality technical documentation\n* Size, look, and information of the folios (sheets) are fully configurable.  \n* Individually set vertical and horizontal headers (printed rulers), number of columns and rows and width/height of each column/row.\n* Create and edit titlebocks with the embedded titleblock editor to display with custom variables.\n* Add a full automatic generated table of content with 2 mouse clicks.\n* Choose from more than 7.000 included electric, logic, pneumatic, hydraulic and fluid symbols.  \n* ...create your own elements (symbols or anything else) with the element editor.  \n* Quickly search all collections with the integrated search engine.  \n* Draw complex schematics with drag-and-drop from the collection panel.\n* Aligned elements are automatically connected or connected from point to point by pulling a conductor with the mouse.\n* Link elements together to display a cross reference text.  \n* Cross references are automatically updated on the fly.\n* Modify the path of any conductor\n* Accurately zoom with the mouse wheel over the drawing area to catch the smallest details.\n* Export elements' information to a parts list in .csv format.\n* Print or export to pdf whole documents or selected parts.\n* Alternatively, export to vector (svg) or pixel (png, jpg, bmp) format images.\n* Open and edit several projects at the same time\n* Import images (.bmp, .jpg, .png, .svg) and basic shapes (lines, rectangles, ellipses, polygons)\n* Edit the thickness, the line style and the color of conductors\n* Define autonumber patterns for conductors, symbols and folios\n* Take advantage of the open xml standard of elements and projects to create custom tools\n* Search and replace Widget (Ctrl + F) in entire project\n* Conductor numbers can be exported to csv file.", "updated": "2024-03-22T18:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/qet/0.90.7758", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/qet/0.90.7758", "licenseUrl": "https://www.gnu.org/licenses/old-licenses/gpl-2.0.en.html", "packageName": "qet", "displayName": "QElectroTech", "summary": "Free software to create electric diagrams", "version": "0.90.7758", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@565c145ea86b3a3726cfd2a3c184c9bf29178247/Icons/qet_icon.png", "author": "QET contributors", "downloadCount": 2159, "tags": ["QET", "QElectroTech", "electric", "diagrams", "schematics", "CAD", "OSS", "embedded"]}