{"description": "QGIS is a user friendly Open Source Geographic Information System (GIS) licensed under the GNU General Public License. QGIS is an official project of the Open Source Geospatial Foundation (OSGeo). It runs on Linux, Unix, Mac OSX, Windows and Android and supports numerous vector, raster, and database formats and functionalities.\n\n#### General Features\n* View data -- Spatially-enabled tables and views, vector formats, raster and imagery formats, GRASS raster and vector data and online spatial data.\n* Explore data and compose maps -- Interactively explore spatial data with a friendly GUI with many helpful tools.\n* Create, edit, manage and export data -- Vector and raster layers in several formats.\n* Analyze data -- vector analysis, sampling, geoprocessing, geometry and database management tools including the complete GRASS functionality of more than 400 modules.\n* Publish maps on the Internet -- QGIS can be used as a WMS, WMTS, WMS-C or WFS and WFS-T client, and as a WMS, WCS or WFS server. \n* Extensible functionality through plugins\n* Python console\n\nThis package will install the identified, \"Long Term Release\" version of QGIS intended for stability.  If you want to install a version more rich with features but potentially less stable, try the [package for the latest release of QGIS](https://chocolatey.org/packages/QGIS).  These packages can now co-exist!\n\n#### Keeping old releases\nUpon installation/upgrade, this package will attempt to remove the newest version of QGIS *less than or equal to* this package version.  (It will no longer remove non-\"LTR\" versions.)  If you would like to skip the uninstallation of any older versions, use the a \"Keep\" package parameter as follows:\n\n`choco install qgis-ltr -params '\"/Keep\"'`\n\nThis parameter will be ignored if the newest version has the same major.minor value as this package because the QGIS installer won't allow two different builds of the same major.minor release.  (I.E. Version 2.18.14 has the same \"2.18\" as version 2.18.20.)  This parameter would allow you to keep a v2.14.x install of QGIS when installing a v2.18.x package.\n\nUninstallation should remove only the installed, Chocolatey package version.", "updated": "2024-03-23T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/QGIS-LTR/3.34.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/QGIS-LTR/3.34.4", "licenseUrl": "http://www.gnu.org/licenses/gpl.html", "packageName": "QGIS-LTR", "displayName": "QGIS LTR (Long Term Release)", "summary": "A Free and Open Source Geographic Information System", "version": "3.34.4", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@d71a34f3e4b56ff7a0e36af2d2a7eb2a8422765b/Icons/qgis_icon.png", "author": "OSGeo", "downloadCount": 287406, "tags": ["qgis", "GIS", "mapping", "geographic", "geospatial", "admin"]}