{"description": "Quantum Shooter is a variant of our flagship game, Quantum Moves. However, in Quantum Shooter, you are invited into a new but hostile environment! You are Agent87, a shooter inspired by games like Crimsonland.\n\nArmed with a simple gun, you are assaulted by relentless hordes of enemies. Be ready to seize the opportunity offered by the extremely powerful quantum weapon when you have the chance to reload. This should help you survive but keep in mind that the power you unlock depends on your ability to manipulate the atom!\n\nWill you be able to survive long enough? Can you prevent the spiders from taking your life under the siege?\n\n#### How to play: \n\nNavigate on the platform using the arrows. Direct your weapon with the cursor of your mouse. Try to reach the reload zones when they appear; it is your chance to improve your weapon! Be ready to manipulate the wave using your mouse to direct it towards the cylinder of the weapon.\n\nKeep an eye on the power bar at the bottom of the screen. The higher it is when you release the wave in the cylinder, the more powerful your weapon will be!\n\nWhile playing, keep an eye on your health bar at the left of the screen – and on the time of course! Too hard? Find a mate and let him/her take over either the keyboard or the mouse.\n\n#### ScienceAtHome    \n* To contribute to our research, make sure you play our games with an active internet connection, as we are gathering data for our scientists based on your performance.\n* [Privacy policy](https://www.scienceathome.org/privacy)", "updated": "2024-03-10T13:33:58Z", "galleryUrl": "https://community.chocolatey.org/packages/quantumshooter/0.1.20160513", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/quantumshooter/0.1.20160513", "licenseUrl": "http://creativecommons.org/licenses/by/3.0/", "packageName": "quantumshooter", "displayName": "Quantum Shooter", "summary": "Learn about quantum physics and help build quantum computers by playing games", "version": "0.1.20160513", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/67b967422d1fd2607e227b592dd069a6cd34ff02/icons/quantumshooter.png", "author": "ScienceAtHome", "downloadCount": 1253, "tags": ["gaming", "citizen-science", "quantum-physics"]}