{"description": "**Smart. Easy. Fast.**\n\nRadiAnt is a PACS-DICOM viewer for medical images designed to provide you with a unique experience.\nWith its intuitive interface and unrivaled performance, you'll never look back.\n\n## Features\nOpening DICOM studies from CD/DVD/BluRay disks and local or network folders.\n\n- Searching and downloading DICOM studies from PACS locations (servers, workstations, modalities).\n\n- A simple and intuitive interface with full-screen mode.\n\n- Multi-touch support for Windows 8/8.1/10 enabled devices.\n\n- Excellent performance – 64-bit version available, multi-core and multi-processor support, asynchronous reading (you can browse images while they are being opened), advanced memory management system which facilitates concurrent opening of studies with thousands of images. All provided within a compact application (installer size is just around 3MB).\n\n- Image operations:\n\n  - Fluid zooming and panning.\n\n  - Brightness and contrast adjustment, and negative mode.\n\n  - Preset window settings for Computed Tomography (lung, bone, etc.).\n\n  - Rotations (90 and 180 degrees), and flips (horizontal and vertical).\n\n- Regions of Interest (ROIs):\n\n  - Measurement of segment length.\n\n  - Measurement of mean, minimum and maximum parameter value (e.g. density in Hounsfield Units in Computed Tomography) within circle/ellipse and its area.\n\n  - Measurement of angle value (normal and Cobb angle).\n\n  - Measurement of deviation.\n\n  - Pen tool for freehand drawing.\n\n- Browsing of several series concurrently in multiple panels with automatic synchronization between series with images acquired in the same plane (e.g. Computed Tomography series before and after contrast media administration) or manual synchronization between series from different studies with similar patient orientation and cross reference lines in series with different image planes (e.g. Magnetic Resonance study).\n\n- 3D cursor tool\n\n- Display of dynamic sequences/series (CINE) with adjustment of frames per second.\n\n- 2D (orthogonal) Multi-planar Reconstruction (2D MPR).\n\n- 3D (oblique) Multi-planar Reconstruction (3D MPR) with MIP (maximum intensity projection), MinIP (minimum intensity projection) and Avg (average) modes.\n\n- 3D Volume Rendering (VR).\n\n- GPU acceleration for 3D VR and 3D MPR views (for Nvidia GPUs).\n\n- Fusion of series with different modalities (e.g. PET-CT) or with different protocols (e.g. MR T1/T2 – DWI).\n\n- Time-intensity curves (TIC, e.g. for Breast MRI).\n\n- Support for DICOM overlays (annotations or graphic overlays included in the file).\n\n- Export of DICOM images to JPEG and BMP picture formats and DICOM series/sequences to movies in WMV format.\n\n- Display DICOM file structure with searchable DICOM tags, their descriptions and values.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/radiant/screenshot.png)", "updated": "2024-03-23T08:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/radiant/2023.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/radiant/2023.1", "licenseUrl": "https://www.radiantviewer.com/terms", "packageName": "radiant", "displayName": "RadiAnt DICOM Viewer", "summary": "RadiAnt is a PACS-DICOM viewer for medical images.", "version": "2023.1", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/radiant/radiant.png", "author": "Medixant", "downloadCount": 12283, "tags": ["radiant", "PACS-DICOM", "DICOM", "viewer", "medical", "images", "trial"]}