{"description": "## RaiDrive, How to connect\nIt’s easy. Take it slow.\n\n### STEP1. ADD DRIVE\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/raidrive/screenshot1.png)\n- Click the Add button to the right of the menu bar\n- After selecting storage, click the OK button\n### STEP2. CLOUD SIGN-IN\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/raidrive/screenshot2.png)\n- Sign in with your cloud service account (Google, Microsoft or Dropbox account)\n- ***RaiDrive DOES NOT save your password***.\n\n**Yeah~ Ready!**  \n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/raidrive/screenshot3.png)  \nYou can see the drive you added in the **File Explorer**.\nUse it like a drive right now.\n\n## What is RaiDrive?\nHelper to make cloud storage Windows drive\n\n### Cloud Drive\nMake cloud storage like Google Drive, Google Photos, OneDrive, and Dropbox your Windows Drive. You no longer need to use your browser to find files.\n### Network Drive\nYou do not need to download all of the files in your cloud storage. Connect cloud storage to network drives for immediate use.\n### Edit File\nYou can edit and save files instantly with your favorite programs such as Word, Excel, PowerPoint and Photoshop. Of course, you can also copy and move files. Experience true cloud storage now.\n### Security\nIt is safe. Google, Microsoft, and Dropbox are protecting your files. RaiDrive allows you to make folders and files appear in Windows Explorer, using the methods they provide officially.\n### Speed\nIt’s faster than the browser. You can create a drive only two times by selecting Storage and clicking OK. Simplifies procedures to provide a more pleasant experience.\n### Free\nAll of this is absolutely free.\nWe look forward to adding more features in the future.\n\n## Cloud Storage\nYou do not need to download any files now. Connect now using RaiDrive.\n\n### ![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/raidrive/googledrive.png) Google Drive\nAre you using Gmail? You already have a Google Drive. How much is 15GB. Check it now and connect to your Windows drive.\n\n### ![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/raidrive/googlephotos.png) Google Photos\nAre you using an Android smartphone like Galaxy? You are already getting infinite photo backup service. Check out the memories right now.\n\n### ![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/raidrive/onedrive.png) OneDrive\nIf you are using Microsoft Windows, you already have OneDrive. You can connect now to the email you used to sign in to Windows.\n\n### ![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/raidrive/dropbox.png) Dropbox\nDo you use Dropbox? Now you can easily use synced files with your smartphone. You can copy or move files with File Explorer.", "updated": "2024-03-23T21:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/raidrive/2022.6.92", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/raidrive/2022.6.92", "licenseUrl": "", "packageName": "raidrive", "displayName": "RaiDrive", "summary": "RaiDrive is a Windows utility that maps cloud storage services (Google Drive, Google Photos, OneDrive, Dropbox) as Windows drives. It allows for easy integration of cloud-based filesystems to the desktop without having to sync/download all the files in the cloud storage to the local disk.", "version": "2022.6.92", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/manual/raidrive/raidrive.png", "author": "OpenBoxLab", "downloadCount": 62723, "tags": ["raidrive", "map", "filesystem", "cloud", "storage", "services", "google", "drive", "photos", "onedrive", "dropbox"]}