{"description": "## Requirements\n\nRancher Desktop requires the following on Windows:\n\n - Windows 10 build 1909 or higher. The Home edition is supported.\n - Running on a machine with [virtualization capabilities](https://docs.microsoft.com/en-us/windows/wsl/troubleshooting#error-0x80370102-the-virtual-machine-could-not-be-started-because-a-required-feature-is-not-installed).\n - Persistent internet connection.\n\nRancher Desktop requires [Windows Subsystem for Linux](https://docs.microsoft.com/en-us/windows/wsl/install-win10) on Windows; this will automatically be installed as part of the Rancher Desktop setup. Manually downloading a distribution is not necessary.\n\nIt is also recommended to have:\n - 8 GB of memory\n - 4 CPU\n\nAdditional resources may be required depending on the workloads you plan to run.\n\n__Note__: You can use Rancher Desktop as a Non-Admin user on a Windows machine. However, an Admin's intervention is required during the installation process for the below components.\n\n - __WSL2__ - You need Admin privileges to install WSL2, which is an essential component of Rancher Desktop.\n - __Rancher Desktop Privileged Service__ - You need Admin privileges to install the Rancher Desktop privileged service, which is required to expose applications/services, running inside containers, on all interfaces on the host machine. However, you can skip the installation of the Rancher Desktop Privileged Service with the limitation that you will not be able to expose applications/services on any interface except `127.0.0.1`.\n\n\n\n## Kubernetes and Container Management on the Desktop\nRancher Desktop runs Kubernetes and container management on your desktop. You can choose the version of Kubernetes you want to run. You can build, push, pull, and run container images using either containerd or Moby (dockerd). The container images you build can be run by Kubernetes immediately without the need for a registry.\n\n\n### Container Management\n\nContainer management to build, push, and pull images and run containers. It uses the same container runtime as Kubernetes. Built images are immediately available to use in your local workloads without any pushing, pulling, or copying.\n\n### Kubernetes Made Simple\n\nGetting started with Kubernetes on your desktop can be a project. Especially if you want to match the version of Kubernetes you run locally to the one you run in production. Rancher Desktop makes it as easy as setting a preference.\n\n### Built On Proven Projects\n\nRancher Desktop leverages proven projects to do the dirty work. That includes Moby, containerd, k3s, kubectl, and more. These projects have demonstrated themselves as trustworthy and provide a foundation you can trust.", "updated": "2024-03-24T00:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/rancher-desktop/1.13.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/rancher-desktop/1.13.0", "licenseUrl": "https://github.com/rancher-sandbox/rancher-desktop/blob/main/LICENSE", "packageName": "rancher-desktop", "displayName": "Rancher Desktop", "summary": "Rancher Desktop is an open-source project that brings Kubernetes and container management to the desktop", "version": "1.13.0", "icon": "https://cdn.jsdelivr.net/gh/usm-community/chocolatey-packages@master/icons/rancher-desktop.png", "author": "SUSE", "downloadCount": 26082, "tags": ["rancher-desktop", "kubernetes", "k8s", "rancher", "desktop"]}