{"description": "Razer Synapse is our unified configuration software that allows you to rebind controls or assign macros to any of your Razer peripherals and saves all your settings automatically to the cloud. No more tedious device configurations when you arrive at LAN parties or tourneys, as you can pull them from the cloud, and get owning right away.\n\nThe key features of Razer Synapse are:\n\n* **Hardware Configurator**: Razer Synapse is our unified configuration software that allows you to rebind controls or assign macros to any of your Razer peripherals and saves all your settings automatically to the cloud.\n* **Stats & Heatmaps**: Track all your in-game clicks, movements and more as you put your peripherals through the paces with Razer Synapse Stats & Heatmaps and analyze your gameplay with the help of automatically generated heatmaps. And no worries, stats tracking is entirely optional.\n* **Convenient Warranty Registration & Code Redemption**: Razer Synapse offers a hassle-free way to register your product warranties, check remaining warranty durations, and makes you eligible for exclusive Razerstore promotions, game beta code giveaways and other exciting treats.\n\nSystem Requirements:\n\n* 100 Mbyte of free hard disc space\n* Valid e-mail, software download, license acceptance, and internet connection needed to activate full features and for software updates. After activation, full features are available in optional offline mode.\n\nFor more information, see [https://www.razer.com/synapse-2](https://www.razer.com/synapse-2).", "updated": "2024-03-23T20:33:47Z", "galleryUrl": "https://community.chocolatey.org/packages/razer-synapse-2/2.21.24.41001", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/razer-synapse-2/2.21.24.41001", "licenseUrl": "https://assets.razerzone.com/downloads/software/RazerEndUserLicenseAgreement.pdf", "packageName": "razer-synapse-2", "displayName": "Razer Synapse 2", "summary": "Razer Synapse is our unified configuration software that allows you to rebind controls or assign macros to any of your Razer peripherals and saves all your settings automatically to the cloud.", "version": "2.21.24.41001", "icon": "https://cdn.jsdelivr.net/gh/Zoullx/chocolatey-packages/icons/razer-synapse-2.png", "author": "Razer Inc.", "downloadCount": 6166, "tags": ["razer", "synapse"]}