{"description": "Maximize your unfair advantage with Razer Synapse 3, the unified hardware configuration tool that takes your Razer device to the next level. Get access to advanced options and granular control as you rebind buttons, assign macros, personalize device lighting and more.\n\nThe key features of Razer Synapse 3 are:\n\n* **HYBRID ON-BOARD AND CLOUD STORAGE**: _For personalized settings anytime, anywhere._ Rebind buttons, assign macros, and automatically save all your profile configurations to the cloud. And if you're going to use a computer without internet or Razer Synapse 3 installed, save up to 4 profiles to have on hand via the devices' on-board storage.\n* **ALL-NEW USER EXPERIENCE**: _Redesigned for ease-of-use._ Redesigned from the ground up with a refreshing interface and modular installation capabilities, Razer Synapse 3 features a revamped dashboard with easy access to your device configurator, macro configurator, warranty registration and more.\n* **ADVANCED MACRO CAPABILITIES**: _For extended power combos._ Bring powerful macros to your favorite games with Razer Synapse 3. Easily create a string of complex button presses, and then precisely execute game-winning combinations with a single click.\n* **ALL-NEW RAZER HYPERSHIFT**: _For increased button control._ Simply press a single button to temporarily unlock a secondary set of functions on top of your existing button assignments, effectively doubling the number of customizable buttons on your device.\n* **NEXT GEN CHROMA STUDIO**: _For advanced Razer Chroma™ capabilities._ Make your desk a canvas with the all-new advanced lighting config tool that allows you to create various lighting effects and synchronize across multiple devices, while following the exact placement of your devices on your desktop.\n\nFor more information, see [https://www.razer.com/synapse-3](https://www.razer.com/synapse-3).", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/razer-synapse-3/1.16.0.543", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/razer-synapse-3/1.16.0.543", "licenseUrl": "https://assets.razerzone.com/downloads/software/RazerEndUserLicenseAgreement.pdf", "packageName": "razer-synapse-3", "displayName": "Razer Synapse 3", "summary": "Maximize your unfair advantage with Razer Synapse 3, the unified hardware configuration tool that takes your Razer device to the next level.", "version": "1.16.0.543", "icon": "https://cdn.jsdelivr.net/gh/Zoullx/chocolatey-packages/razer-synapse-3/razer-synapse-3.png", "author": "Razer Inc.", "downloadCount": 9441, "tags": ["razer", "synapse"]}