{"description": "___\n[choco://rdpguard](choco://rdpguard)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n___\n\n![Screenshot of RdpGuard](https://rdpguard.com/images/index-screenshot.png)\t\n\n###What is RdpGuard and How does it Work?\n\nRdpGuard is a host-based intrusion prevention system (HIPS) that protects your Windows Server from brute-force attacks on various protocols and services (RDP, FTP, SMTP, MySQL, MS-SQL, IIS Web Login, ASP.NET Web Forms, MS Exchange, RD Web Access, etc).\n\nIt monitors the logs on your server and detects failed logon attempts. If the number of failed logon attempts from a single IP address reaches a set limit, the attacker's IP address will be blocked for a specified period of time.\n\n###Why do you need it?\n\nMany Windows Server machines are under constant attack. Network scanners and RDP brute-force tools work 24/7. Eventually they may find a password to access your server! Moreover, RDP brute-force attacks abuse server resources (CPU, RAM, Disk Space and Network Bandwidth).\n\nTake a look at your server's Security EventLog. How many failed login attempts do you see? The log may note thousands of failed login attempts from a single IP address. This means that someone is trying to find a password to access your server.\n\nHow can you protect your server from brute-force password-guessing attacks on RDP? The answer is RdpGuard - powerful tool that allows you to protect your Remote Desktop from brute-force attacks.\n\nRdpGuard works as a Windows Service. Your Windows Server will be protected even if nobody is logged in.\n\nFor Windows XP, Vista, 7, 8, 8.1, 10 and Windows Server 2003 (R2), 2008 (R2), 2012 (R2), 2016\n\n**You can download RdpGuard and try it for free for 30 days. If you wish to continue to use RdpGuard, you need to purchase the License. ($79.95)**\n\n**SOCIAL MEDIA:**\n[Facebook](https://www.facebook.com/RdpGuard) | [Twitter](https://twitter.com/rdpguard) | [Google+](https://plus.google.com/+RdpGuard)\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/rdpguard/readme.md)**\n\t\n\n___\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n___", "updated": "2024-03-23T09:03:44Z", "galleryUrl": "https://community.chocolatey.org/packages/rdpguard/5.4.9", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/rdpguard/5.4.9", "licenseUrl": "http://netsdk.com/terms.html", "packageName": "rdpguard", "displayName": "RdpGuard (Trial Install)", "summary": "RdpGuard - Intrusion prevention system for your Windows Server", "version": "5.4.9", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/rdpguard/rdpguard_icon.png", "author": "NetSDK Software", "downloadCount": 3327, "tags": ["netsdk", "rdpguard", "server", "security", "rdp", "sql", "ftp", "smtp", "iis", "mysql", "mssql", "ms-sql", "rd", "intrusion", "prevention", "trial"]}