{"description": "![Screenshot of Real NetStat] (http://www.netstatagent.com/images/real-netstat/real-netstat-connections.png)\n\n##Real NetStat 3.1 - The Powerful Alternative Tool To NetStat.exe Command\n\nEach time when you open a web site in your browser or download files there are TCP/UDP connections are established between your computer and the remote host. Other software also can receive or send information to the Internet. But how can you get the list of all available connections on your computer?\n\nThe answer is to run a command line tool known as netstat.exe. But is it really comfortably to run every time the console and enter the options you want only to print a list of TCP/UDP connections?\n\n##Real NetStat solves this issue!\n\nWe offer an advanced but still quite simple in use the program for monitoring Internet connections. Real Netstat and its intuitive and easy-to-use GUI make life simpler and easier not only for network administrators, but for anyone Windows user.\n\nBy combining the functionality of command-line netstat.exe utility, Real Netstat provides more advanced features that makes connection monitoring more comfotable:\n\n* Provides information on all active TCP and UDP connections, including IPv6 and geographical information;\n* The network statistics for protocols: TCPv4, TCPv6, UDPv4, UDPv6, IPv4, IPv6, ICMPv4 and ICMPv6;\n* Each new or old connection is highlighted;\n* Any unimportant connection can be hidden from your eyes;\n* Each connection can be logged;\n* Provides you with ability to configure special rules to close unwanted connections, terminate the process, play the sound alert and run the third party software like console 'ping.exe' or 'tracert.exe';\n* Shows all available information like the remote address of connection, hostname, local and remote ports, the owning process, the process folder, DLL modules used by process and etc;\n* Built-in powerful log manager to view, delete or clear connection logs;\n* Saves the report to HTML files.", "updated": "2024-03-19T04:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/real-netstat/3.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/real-netstat/3.1", "licenseUrl": "", "packageName": "real-netstat", "displayName": "Real NetStat (Trial) (Install)", "summary": "Real NetStat 3.1 - The Powerful Alternative Tool To NetStat.exe Command", "version": "3.1", "icon": "http://netstatagent.com/images/logo.png", "author": "Flexbyte Software", "downloadCount": 1067, "tags": ["flexbyte", "real", "netstat", "network", "utility", "admin"]}