{"description": "I made this program after seeing brute force attacks on a customers server who had remote desktop enabled and open to the internet. The attacks were trying to brute force the password for the administrator account.\n\nThe Windows Event Viewer was not showing which IP address the connections were coming from. They were also coming from multiple locations and hitting at random times during the day and night. So tracking them down with the built in Windows tools was going nowhere.\n\nThis that will monitor and log any IP that hits the remote desktop and to be able to block those IP's. \n\nThe program will monitor the remote desktop port using the Windows netstat API and keep them in a log for later viewing. The program has a built in block IP tool to easily block any IP address. It does this by using the built in Windows IP Security Policy (IPSec). The drawback is, theprogram can only block IP's, but can not unblock them. To unblock them I have included a guide here: How to remove IP's from the Windows IP Security (IPSec) Added by the Tweaking.com - Block IP Tool\n\nEven though this tool was built for watching the remote desktop port you can use it to watch any single port on the system. So if you have another kind of server running and the port open to the internet you can now log any IP that hits it.\n\nPACKAGING NOTE: Uninstall is NOT silent.", "updated": "2024-03-23T14:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/remote-desktop-ip-monitor-and-blocker/1.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/remote-desktop-ip-monitor-and-blocker/1.0.0", "licenseUrl": "http://www.tweaking.com/core/termsofuse/index.html", "packageName": "remote-desktop-ip-monitor-and-blocker", "displayName": "Remote Desktop IP Monitor and Blocker (Install)", "summary": "Tweaking.com - Remote Desktop IP Monitor and Blocker is a free tool to monitor any IP that tries to connect to the remote desktop.", "version": "1.0.0", "icon": "", "author": "Tweaking.com", "downloadCount": 1054, "tags": ["tweaking.com", "Remote", "Desktop", "IP", "Monitor", "Blocker", "admin", "notsilent"]}