{"description": "Originally the application was built as a purpose to learn more about Lazarus Pascal and cross-platform development.\n\nIn the meanwhile, my tool is being used be a lot of users to help them rename TV-Series files.\nJust keep in mind that this tool is not to promote illegal downloading or illegal sharing of copyrighted materials. It’s just a handy tool to occasionally rename some of your TV show files.\n\nThe philosophy is a simple work flow; you have a few odd named TV Show episodes and you’d like to give them a proper name, based on the TV Show name, season, episode and title of the episode. This has been expanded with features like resolution, year, data first aired, etc.\n\nThis tool by no means pretends to be anything else than just that.\n\n## Features\n\n- Support the new TheTVDB.com API (v2)\n- Caching shows and banners (so reloading at the later time could go faster)\n- Dark Theme support (MacOS and Linux only, accent color observed)\n- Automatically move files into a desired directory structure\n- Define your own file and directory name format\n- Create NFO files for the TV Show and for the individual Episodes\n- Store a banner for the TV Show\n- Merge 2 Episodes into 1 (filename only of course)\n- Detection of resolution, video format, Audio and Video codec, and audio channels\n- Log file of what files have been renamed\n\n![screenshot](https://raw.githubusercontent.com/JourneyOver/chocolatey-packages/master/readme_imgs/renamemytvseries2.png)", "updated": "2024-03-23T18:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/renamemytvseries2/2.0.10", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/renamemytvseries2/2.0.10", "licenseUrl": "", "packageName": "renamemytvseries2", "displayName": "Rename My TV Series 2", "summary": "Simple application to assist you in renaming TV Series files.", "version": "2.0.10", "icon": "https://cdn.jsdelivr.net/gh/JourneyOver/chocolatey-packages@76c7b31b4ba90b90decfbc40c928a9b939973555/automatic/renamemytvseries2/icons/128x128.png", "author": "Hans Luijten", "downloadCount": 3396, "tags": ["renamemytvseries2", "file-management", "tv-show", "utility-computing", "episodes", "recording", "naming", "rename", "rename-tv-series", "tv-series-renamer", "search-episode", "admin"]}