{"description": "Visual Studio extension for .NET developers\n### Analyze code quality\n\nOn-the-fly code quality analysis is available in C#, VB.NET, XAML, ASP.NET, ASP.NET MVC, JavaScript, TypeScript, CSS, HTML, and XML. You'll know right away if your code needs to be improved.\n\n### Eliminate errors and code smells\n\nNot only does ReSharper warn you when there's a problem in your code but it provides hundreds of quick-fixes to solve problems automatically. In most cases, you can select the best quick-fix from a variety of options.\n\n### Safely change the code base\n\nAutomated solution-wide code refactorings help safely change your code base. Whether you need to revitalize legacy code or put your project structure in order, you can lean on ReSharper.\n\n### Instantly traverse the entire solution\n\nYou can instantly navigate and search in the whole solution. Jump to any file, type, or type member, or navigate from a specific symbol to its usages, base and derived symbols, or implementations.\n\n### Enjoy code editing helpers\n\nMultiple code editing helpers include extended IntelliSense, hundreds of instant code transformations, auto-importing namespaces, rearranging code and displaying documentation.\n\n### Comply with coding standards\n\nCode style and formatting functionality with fine-grained, language-specific settings will help you get rid of unused code and create a common coding standard for your team.\n\n#### Package Parameters\n\nThe following package parameters can be set:\n\n * `/PerMachine` - install machine-wide (instead of per-user)", "updated": "2024-03-23T20:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/resharper/2023.3.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/resharper/2023.3.4", "licenseUrl": "https://www.jetbrains.com/resharper/buy/index.jsp?product=ultimate", "packageName": "resharper", "displayName": "JetBrains ReSharper", "summary": "Visual Studio extension for .NET developers", "version": "2023.3.4", "icon": "https://raw.githubusercontent.com/jetbrains/chocolatey/master/ReSharper/logo.png", "author": "JetBrains", "downloadCount": 202359, "tags": ["jetbrains", "developer", "admin", "visualstudio"]}