{"description": "Visual Studio Extension for C++ Developers\n### Analyze code quality\n\nReSharper C++ highlights code issues in the editor and provides quick-fixes to improve code in one way or another. Unreachable code? Redundant statements? Suspicious object slicing or incorrect format specifier? ReSharper C++ will bring these and other kinds of problems to your attention and help you fix them.\n\n### Find usages and navigate code\n\nYou can instantly jump at any file, type, or type member in solution. You can search for usages of any code and enjoy a clear view of found usages, with grouping and preview options. Last but not least, you can go from any code symbol to its declaration or definition, its base or derived symbols.\n\n### Refactor and transform code\n\nCode refactorings for C++ help safely change your code base, which is especially important in a language as non-trivial as C++. Context actions help switch between alternative syntax constructs and serve as shortcuts to code generation actions.\n\n### Generate common code\n\nCode that ReSharper C++ can generate for you includes definitions, missing and overriding members, equality and relational operators, hash and swap functions. Add dozens of customizable templates, and you have the tools to deal with boilerplate code faster than ever.\n\n### Run and manage unit tests\n\nReSharper C++ supports running Google Test and Boost.Test based unit tests in Visual Studio. You can run and debug unit tests contextually, right from the text editor. Dedicated tool windows help you view, group, filter and run unit tests, create and manage unit test sessions.\n\n### Use a consistent code style\n\nConfigure code formatting options and naming style, share settings with your teammates, and maintaining a consistent code style should never be a problem again.\n\n#### Package Parameters\n\nThe following package parameters can be set:\n\n * `/PerMachine` - install machine-wide (instead of per-user)", "updated": "2024-03-23T11:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/ReSharperCpp/2023.3.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ReSharperCpp/2023.3.4", "licenseUrl": "https://www.jetbrains.com/resharper/buy/index.jsp?product=ultimate", "packageName": "ReSharperCpp", "displayName": "JetBrains ReSharper C++", "summary": "Visual Studio Extension for C++ Developers", "version": "2023.3.4", "icon": "https://raw.githubusercontent.com/JetBrains/Chocolatey/master/ReSharperCpp/logo.png", "author": "JetBrains", "downloadCount": 56614, "tags": ["jetbrains", "developer", "admin", "visualstudio"]}