{"description": "RetroArch is a frontend for libretro, an open API which exposes the functionality of a game, emulator or certain kinds of multimedia applications. libretro started as libsnes with the SNES emulator bSNES, but libretro has since become a far broader API. RetroArch builds around the libretro API to provide a powerful interface for libretro cores.\n\n## Package Parameters\n\nThe following package parameters can be set:\n\n* `/InstallDir:{path}` - Installation directory, defaults to `{tools-location}` (typically `C:\\tools`)\n* `/InstallationPath:{path}` - Alias for `/InstallDir`\n* `/DesktopShortcut` - Add shortcut for RetroArch to the desktop.\n\n## Notes\n\nIf a custom installation directory is used for RetroArch, shims will still be created for `retroarch.exe` and `retroarch_debug.exe` on the path so that RetroArch can be started from the command line as with prior versions of this package.\n\nAs of v1.9.1, the packaging method used by the RetroArch developers has changed. RetroArch now installs in its own `RetroArch-Win32` or `RetroArch-Win64` directory within the installation directory. This was not accounted for in the Chocolatey package until v1.9.4. If you have an older version of RetroArch installed, you may wish to uninstall it completely and then reinstall with Chocolatey instead of performing a simple upgrade.\n\nSince v1.7.7 was released, the libretro/RetroArch developers have been uploading new builds without always updating the version. If you get checksum errors while installing RetroArch, this has probably happened again. Just [let us know](https://chocolatey.org/packages/retroarch/ContactOwners) via the Contact Maintainers link and a new package should be up on Chocolatey shortly after.", "updated": "2024-03-23T23:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/retroarch/1.15.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/retroarch/1.15.0", "licenseUrl": "https://github.com/libretro/RetroArch/blob/v1.15.0/COPYING", "packageName": "retroarch", "displayName": "RetroArch", "summary": "RetroArch is the official reference frontend for the libretro API.", "version": "1.15.0", "icon": "https://cdn.rawgit.com/libretro/RetroArch/v1.15.0/media/retroarch-96x96.png", "author": "libretro developers", "downloadCount": 66363, "tags": ["retroarch", "games", "gaming", "emulation", "emulators"]}