{"description": "Riecoin is a decentralized (p2p), open source digital currency. It allows to transfer money to anywhere in the world with only minimum transaction fees, sometimes even for free (depending on many factors like the amount to transfer and the network load at the moment of the transaction). It is a fork of the Bitcoin project.\n\nSo, what is new about riecoin?\n\nThe process of money creation in Bitcoin - referred to as mining - involves executing software that utilizes your hardware running sha256 hashes until a certain criterion is met. This part of the mining process is called generating a \"Proof of work\". The whole mining process also has a critical role in processing transactions and providing security to the network. It is estimated that all the processing power devoted to Bitcoin mining represents more computing power than several of the largest supercomputers in the world combined. Wouldn't it be great to be able to use all that massive power for something else?\n\nEven special purpose hardware was designed for Bitcoin mining. Some consider this a waste of resources, while others argue that supporting a decentralized currency is hardly a waste. We believe that the mining process required for currency to work does not need to include hashing functions as a Proof of Work, and that a \"more useful\" calculation can be done instead.\n\nThat's the point of riecoin: the mining process, besides fulfilling its function to the operation of the network, generates series of prime numbers as a by-product. This prime numbers are of interest to mathematicians and the scientific community. Riecoin is proof that it is possible to effectively harness all that massive computing power to something useful other than hashing functions.\n\n### Disk Requirements - Riecoin blockchain (public transactional database) size\n* As of 20 February 2015, the total size of the RIC blockchain was __307.32 MB__ \n\n[Previous Version Compatibility](http://riecoin.org/updates.html) (blockchain hard-forks)\n[Source code](https://github.com/riecoin/riecoin)", "updated": "2024-03-14T17:03:45Z", "galleryUrl": "https://community.chocolatey.org/packages/riecoin/0.10.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/riecoin/0.10.2", "licenseUrl": "https://github.com/riecoin/riecoin/blob/master/README.md#license", "packageName": "riecoin", "displayName": "Riecoin Wallet", "summary": "Decentralized (p2p), open source, digital currency", "version": "0.10.2", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/5ddac7b24255386ee6dad21cbb37e8bffffcb1fa/icons/riecoin.png", "author": "Gatra, Riecoin Developers", "downloadCount": 999, "tags": ["riecoin", "ric", "wallet", "cryptocurrency", "p2p"]}