{"description": "Radical Image Optimization Tool (RIOT for short) is a free image optimizer that will let you to visually adjust compression parameters while keeping minimum filesize.\n\nIt uses with a side by side (dual view) or single view interface to compare the original with the optimized image in real time and instantly see the resulting file size.\n\nIt is lightweight, fast and simple to use, yet powerful for advanced users. You will be able to control compression, number of colors, metadata settings and much more, and select image format (JPG, GIF or PNG) for your output file.\n\n![Sample](https://riot-optimizer.com/wp-content/themes/responsive-child/core/images/featured-image.png)\n\n### Features\n\n* open many image types including Adobe Photoshop PSD, HDR, RAW and rare/scientific types (*up to 128 bpp, integer and floating point*)\n* save and optimize JPEG, GIF and PNG with a simple, clean user interface\n* automatic optimization selects the most suitable format and parameters\n* works in dual view: (*original + optimized image*) or single view (*optimized image*).\n* in-place compare function (*alternativelly display the original image over the optimized image to notice small pixel changes*)\n* compress files to desired filesize threshold\n* fast processing (*all is done in memory*); see instant results including resulting filesize\n* batch support (*process multiple files at once*)\n* transparency handling options\n* decide if you want to keep metadata (*comments, IPTC, Adobe XMP, EXIF profiles, ICC profiles*).  Unsupported metadata is removed\n* transfer metadata between image formats (*destination format must support them*)\n* common tools: pan and zoom, rotate, flip\n* basic image adjustments: brightness, contrast, gamma, invert\n* visually reduce number of unique colors for PNG and GIF images in order to reduce filesize (*two quantization methods are available: Xiaolin Wu and NeuQuant neural net*)\n* resize image by using well known resample filters (*ex: Lanczos3, Catmull Rom, Bicubic, and others*)\n* out-of-the-box support for external PNG optimizers (*optipng, pngout, etc*)\n* compression and results are comparable to those of commercial products, even higher.\n* Adaptive logarithmic tone mapping algorithm (*Drago*) used for HDR images\n\n### Breaking change\nThere is no longer an installer for a 32-bit version of RIOT. Accordingly, this package will only install/upgrade on 64-bit systems.", "updated": "2024-03-23T11:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/riot/1.0.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/riot/1.0.1", "licenseUrl": "https://raw.githubusercontent.com/teknowledgist/Chocolatey-packages/master/manual/riot/tools/LICENSE.txt", "packageName": "riot", "displayName": "Radical Image Optimization Tool", "summary": "Lightweight, fast, simple, yet powerful image optimization", "version": "1.0.1", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@55825846816a3b6a46df0b5ddf3eea3ff7175adf/Icons/riot_icon.png", "author": "Lucian Sabo", "downloadCount": 1241, "tags": ["riot", "image", "optimization", "jpeg", "gif", "png", "compression", "embedded"]}