{"description": "Roadgeek 2005 includes:\n    \n* The 7, FHWA font series (aka Highway Gothic) - used in the United States, Canada, Mexico, Australia, New Zealand, Malaysia and Taiwan:  B, C, D, E, EM (E modified), EEM (Enhanced E modified), F. EM is E but with looser spacing and thicker strokes to accommodate reflective buttons; because the buttons are no longer widely used EEM undoes the thicker strokes but keeps the looser spacing.\n* Clearview - used in some parts of the United States and Indonesia, designed as a replacement of the FHWA Series typefaces. Available in 13 series: 1B through 6B for negative contrast (dark on light) signs, 1W through 6W and 5WR for positive contrast (light on dark) signs. 5WR is just 5W with tighter spacing.\n* DIN 1451 - German sign typeface. Available in 2 series: Engschrift and Mittelschrift\n* Transport - UK sign typeface. Available in 2 weights: Medium for positive contrast signs and Heavy for negative contrast signs\n* Motorway - UK sign typeface, but only for route numbers on motorway signs. Available in 2 weights: Permanent for positive contrast signs and Temporary for negative contrast signs.\n* Clarendon - used by the US National Park Service (\"Old Parks\")\n* Rawlinson - a replacement for Clarendon (\"New Parks\")\n* Arrows, icons, and signbacks\n\n![RoadGeek sample](https://www.n1en.org/wp-content/uploads/2021/03/roadgeek-banner-300x210.png)\n\nRoadGeek 2005 is complete, but EOL.  [RoadGeek 2014](https://github.com/sammdot/roadgeek-fonts) is still in (stalled) development.", "updated": "2024-03-03T22:33:23Z", "galleryUrl": "https://community.chocolatey.org/packages/roadgeek.font/2005.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/roadgeek.font/2005.2", "licenseUrl": "https://github.com/teknowledgist/Chocolatey-packages/tree/master/discontinued/roadgeek.font/legal/LICENSE.txt", "packageName": "roadgeek.font", "displayName": "RoadGeek Font", "summary": "Closely aproximated typefaces used on highway signs in various countries", "version": "2005.2", "icon": "https://www.n1en.org/wp-content/uploads/2021/03/highway-heaven-logo.png", "author": "Michael D. Adams", "downloadCount": 188, "tags": ["roadgeek.font", "road", "highway", "FHWA", "DOT", "sans", "font", "otf", "FOSS", "embedded"]}