{"description": "RØDE Connect is a simple and powerful software solution for podcasting and livestreaming with the NT-USB Mini, VideoMic NTG, AI-Micro, VideoMic GO II, Wireless GO II and the NT-USB+.\n\nOffering the ability to connect up to four guests to a single computer, RØDE Connect is perfect for anyone who wants to create professional-quality podcasts the easy way. With an intuitive recording interface inspired by the RØDECaster Pro featuring broadcast-style faders, level metering, sound pads, mute button, multi-channel recording and more, RØDE Connect gives you complete control over your podcast recording.\n\nRØDE Connect is also perfect for creators looking for a simple way to route audio to their livestreaming software. With easy integration of external audio sources like chat applications, program sound, mic audio and more; RØDE Connect is capable of taking a finished mix and outputting in realtime to livestreaming software.\nKey Features:\n\n* Connect up to four podcasters to a single computer with any combination of compatible microphone - no complex routing required\n* Completely free to download with versions for both Mac and Windows\n* Access powerful digital signal processing; including a noise gate, compressor and the legendary APHEX Aural Exciter and Big Bottom (NT-USB Mini, VideoMic NTG, VideoMic GO II, AI-Micro and NT-USB+ only)\n* Fully featured recording interface, complete with broadcast-style faders, level metering, mute buttons and more\n* Virtual channels for seamlessly connecting remote guests, integrating streaming applications, adding music beds and much more\n* Automatic mix-minus on every channel for crystal clear, echo-free audio\n* Fully equipped sound pads section with 3 separate playback styles and up to 8 banks of sound\n\nRØDE Connect is completely FREE to use. Plug in your compatible RØDE microphone, and get recording!\n\n### Package updates\n\nRode use a 'static' download URL such that when they release a new version it will break older Chocolatey packages. Sometimes this package needs to be manually updated as Rode change the layout of the .zip file for each release. \n\nIf you notice the package isn't working please leave a comment, or even better submit a pull request in the [package source repository](https://github.com/flcdrg/au-packages/tree/master/rode-connect).", "updated": "2024-03-20T21:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/rode-connect/1.3.33", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/rode-connect/1.3.33", "licenseUrl": "", "packageName": "rode-connect", "displayName": "RØDE Connect", "summary": "RØDE Connect Podcasting Software", "version": "1.3.33", "icon": "https://rawcdn.githack.com/flcdrg/au-packages/4d5d1c906e866b6b6ca5940ce2b5bc62e1e72eb1/rode-connect/icons/rode-connect.png", "author": "RØDE Microphones", "downloadCount": 163, "tags": ["RØDE", "Rode", "audio", "microphones", "podcasting"]}