{"description": "Rons Data Gear is a professional CSV and tabular text editing suite for Windows, containing Rons Data Edit and Rons Data Stream.\n\nAs new modern successor to Rons CSV Editor, Rons Data Edit provides a wealth of tools and features designed to flexibly manipulate data.\n\nThe interface is modern, clean, and user-friendly and the power and speed of the application allow the handling of large files with ease.\n\nUnlike Excel, Rons Data Edit knows your data is text and does not try to 'adjust' it, and introduce workflow interruption with confusing errors. This makes Rons Data Edit a perfect alternative to Excel for handling CSV data files.\n\nIf additional power is needed, Rons Data Edit can run Rons Data Stream 'Cleaners' to run lists of operations in multiple data files.\n\nRons Data Stream is a windows application designed to clean, or update, multiple data sources within seconds, whatever the size of the files, through the use of Cleaners.\n\nCleaners are made up of a list of operations that are selected from a broad list of Column, Row and Cell processing rules. They can be built, saved and applied to as many data sources as required, and re-used with as many Jobs as needed.\n\nThe Preview window displays both the original data and a preview of the processed data. The result of each rule is therefore very clear and comprehensible.\n\nJobs contain all the detail needed for batch processing allowing 100's of data files to be processed in one go, making cleaning a whole directory an easy task.\n\nRons Data Stream handles tabular text formats (CSV, HMTL, XML files and tokenized formats), SQL and Parquet, from loading to converting. It can work individually or hand in hand with Rons Data Edit, adding power to both CSV Editor and Data Processing applications.\n\nFor more information, a complete list of features and a lite free version, go to: http://www.ronsplace.ca/Products/RonsDataGear.", "updated": "2024-02-29T13:03:27Z", "galleryUrl": "https://community.chocolatey.org/packages/ronsdatagear/2023.7.18.1531", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ronsdatagear/2023.7.18.1531", "licenseUrl": "https://www.ronsplace.ca/Article/Pages/Business/user-license-agreement", "packageName": "ronsdatagear", "displayName": "Rons Data Gear (Install)", "summary": "Professional CSV Editing for Windows", "version": "2023.7.18.1531", "icon": "https://www.ronsplace.ca/ContentProduct/DATA-GEAR/Icon.png", "author": "Aaron Stewart,  Rons Place Software", "downloadCount": 168, "tags": ["csv", "csvfile", "comma", "separated", "tab", "delimited", "tabular", "text", "tsv", "header", "parse", "convert", "editor", "view", "viewer", "excel", "free", "modern", "moderncsv", "sqlite", "data", "file", "largefile", "batch", "database", "automate", "automatic", "command", "line"]}