{"description": "RTL Utility is a tool for measuring the Round Trip Latency of your Digital Audio Workstation (DAW) and audio interface. The utility is used for low latency performance testing by system builders, reviewers, device manufacturers and at dawbench.com.\n\nWhen your DAW sends data to your audio interface for playback, it doesn’t send a continuous stream of data one bit at a time. What it does is fill up a section of RAM called a buffer and sends that in a single message when it is ready. Before sending the next message it has to fill the buffer again. This wait time introduces a latency, or delay, between something happening in your DAW and when you actually hear it.\n\nWhile you are recording, the audio interface buffers and sends data to your DAW in a similar fashion. This introduces latency into your recordings.\n\nIf you send a signal from your DAW, out through the audio interface and back in via a loopback patch, then there will be a round trip latency which is the sum of the output and input delays. This is the RTL.\n\n## Package parameters\n- `/InstallDir` - Installation directory, by default Chocolatey tools directory.\nExample: `choco install rtl-utility --params \"/InstallDir:C:\\your\\install\\path\"`\n\n**Please Note**: This is an automatically updated package. If you find it is \nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-02-29T13:03:27Z", "galleryUrl": "https://community.chocolatey.org/packages/rtl-utility/1.0.8", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/rtl-utility/1.0.8", "licenseUrl": "https://oblique-audio.com/downloads/RtlUserGuide.pdf", "packageName": "rtl-utility", "displayName": "RTL Utility", "summary": "RTL Utility is a tool for measuring the Round Trip Latency of your Digital Audio Workstation (DAW) and audio interface. The utility is used for low latency performance testing by system builders, reviewers, device manufacturers and at dawbench.com.", "version": "1.0.8", "icon": "https://rawcdn.githack.com/Sam13/chocolatey-packages/0463cace8d275275806e354cb69fa23ec1897b2e/icons/rtl-utility.png", "author": "Oblique Audio", "downloadCount": 1010, "tags": ["round", "trip", "latency", "measure", "daw", "digital", "audio", "low", "interface", "loopback"]}