{"description": "SABnzbd is a program to download binary files from Usenet servers. Many people upload all sorts of interesting material to Usenet and you need a special program to get this material with the least effort.\n\n### It runs anywhere\nSABnzbd runs on Windows, macOS, Unix and NAS devices. You can access and manage SABnzbd from any device with a webbrowser, including iOS and Android phones and tablets.\n\n### Small and large screens\nWith the responsive Glitter interface, you can access SABnzbd and manage your downloads from any device: desktop, tablet or phone. Others have made Android (nzb360) and iOS (SABmini or nzbUnity) apps to manage SABnzbd.\n\n### Integrates with other tools\nApps like Sonarr, Sickrage, Radarr, CouchPotato, Headphones and more can integrate with SABnzbd and automate your download process.\n\nSABnzbd can also read and process RSS feeds, activate custom scripts and notify you.\n\n### In 16 languages\nSABnzbd now ships with 16 localizations: English, Dansk, Deutsch, Español (castellano), Français, Nederlands, Norsk bokmål, Polski, Português Brasileiro, Româna, Suomi, Svenska, русский язык, српски, עִבְרִית, 简体中文.\n\nSABnzbd is an open-source cross-platform binary newsreader written in Python. It simplifies the process of downloading from Usenet dramatically, thanks to its web-based user interface and advanced built-in post-processing options that automatically verify, repair, extract and clean up posts downloaded from Usenet.", "updated": "2024-03-24T00:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/SABnzbd/4.2.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/SABnzbd/4.2.3", "licenseUrl": "https://github.com/sabnzbd/sabnzbd/blob/master/LICENSE.txt", "packageName": "SABnzbd", "displayName": "SABnzbd", "summary": "Free and easy binary newsreader", "version": "4.2.3", "icon": "https://cdn.jsdelivr.net/gh/Thilas/chocolatey-packages@7de16ead548f4491ce159aa5c8704cb1ed9412b2/sabnzbd/icon.png", "author": "The SABnzbd-team", "downloadCount": 45753, "tags": ["sabnzbd", "admin", "download", "binary", "usenet", "newsreader"]}