{"description": "# SACAD\nSACAD is a multi platform command line tool to download album covers without manual intervention, ideal for integration in scripts, audio players, etc.\n\n## Features\n- Can target specific image size, and find results for high resolution covers\n- Support JPEG and PNG formats\n- Customizable output: save image along with the audio files / in a different directory named by artist/album / embed cover in audio files...\n- Currently support the following cover sources:\n  - Amazon CD (.com, .ca, .cn, .fr, .de, .co.jp and .co.uk variants)\n  - Amazon digital music\n  - ~~CoverLib~~ (site is down)\n  - Deezer\n  - Google Images\n  - Last.fm\n- Smart sorting algorithm to select THE best cover for a given query, using several factors: source reliability, image format, image size, image similarity with reference cover, etc.\n- Automatically crunch images with optipng or jpegoptim (can save 30% of filesize without any loss of quality, great for portable players)\n- Cache search results locally for faster future search\n- Do everything to avoid getting blocked by the sources: hide user-agent and automatically take care of rate limiting\n- Automatically convert/resize image if needed\n- Multiplatform (Windows/Mac/Linux)\n\nSACAD is designed to be robust and be executed in batch of thousands of queries:\n\n- HTML parsing is done without regex but with the LXML library, which is faster, and more robust to page changes\n- When the size of an image reported by a source is not reliable (ie. Google Images), automatically download the first KB of the file to get its real size from the file header\n- Process several queries simultaneously (using [asyncio](https://docs.python.org/3/library/asyncio.html)), to speed up processing\n- Automatically reuse TCP connections (HTTP Keep-Alive), for better performance\n- Automatically retry failed HTTP requests\n- Music library scan supports all common audio formats (MP3, AAC, Vorbis, FLAC..)\n- Cover sources page or API changes are quickly detected, thanks to high test coverage, and SACAD is quickly updated accordingly\n\n## Command line usage\nTwo tools are provided: `sacad` to search and download one cover, and `sacad_r` to scan a music library and download all missing covers.\n\nRun `sacad -h` / `sacad_r -h` to get full command line reference.", "updated": "2024-03-18T22:33:42Z", "galleryUrl": "https://community.chocolatey.org/packages/sacad/2.7.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sacad/2.7.5", "licenseUrl": "https://github.com/desbma/sacad/blob/master/LICENSE", "packageName": "sacad", "displayName": "SACAD", "summary": "SACAD is a multi platform command line tool to download album covers without manual intervention.", "version": "2.7.5", "icon": "", "author": "desbma", "downloadCount": 506, "tags": ["album", "cover-art", "download", "downloader", "cross-platform", "commandline"]}