{"description": "A process sandbox helps to manage and limit access permissions a process has to your data.  Use it to safely test new software for usability, safely study behavior of known spyware and malware, or browse the web from a sandboxed browser to completely shield your computer and network from Internet Bad Things.\n\n## Parameters\nIf you want to use install parameters, use `sandboxie-plus.install` package.\n\n### Features\n* Secure Web Browsing: Running your Web browser under the protection of Sandboxie means that all malicious software downloaded by the browser is trapped in the sandbox and can be discarded trivially.\n* Enhanced Privacy: Browsing history, cookies, and cached temporary files collected while Web browsing stay in the sandbox and don't leak into Windows.\n* Secure E-mail: Viruses and other malicious software that might be hiding in your email can't break out of the sandbox and can't infect your real system.\n* Windows Stays Lean: Prevent wear-and-tear in Windows by installing software into an isolated sandbox.\n\n### Free with no limitations\nSince version 5.31.4 Sandboxie is now available for free with no limitations. Sophos open sourced the program on April 8th, 2020.\n\n### Documentation\n* [Documentation](https://sandboxie-plus.github.io/sandboxie-docs/)\n\n### Community\n* [GitHub Discussions](https://github.com/sandboxie-plus/Sandboxie/discussions)", "updated": "2024-03-23T22:33:38Z", "galleryUrl": "https://community.chocolatey.org/packages/sandboxie-plus/1.13.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sandboxie-plus/1.13.3", "licenseUrl": "https://raw.githubusercontent.com/sandboxie-plus/Sandboxie/master/LICENSE.Plus", "packageName": "sandboxie-plus", "displayName": "Sandboxie Plus", "summary": "Executes processes in a protected, isolated space, otherwise known as a \"sandbox\"", "version": "1.13.3", "icon": "https://cdn.jsdelivr.net/gh/jack1142/choco-auto@b65e7a2652643a0d88830bd9ed730dd30f979ee9/automatic/sandboxie-plus/icons/sandboxie-plus.png", "author": "David Xanatos,  Sophos Group plc,  Invincea Inc.,  Ronen Tzur", "downloadCount": 13854, "tags": ["sandboxie", "security", "virtualization", "forensics", "admin"]}