{"description": "Sandcastle is composed of two separate parts that work together: the Sandcastle tools and the Sandcastle Help File Builder. The Sandcastle tools are used to create help files for managed class libraries containing both conceptual and API reference topics. API reference topics are created by combining the XML comments that are embedded in your source code with the syntax and structure of the types which is acquired by reflecting against the associated .NET Framework assemblies. Conceptual topics are created by converting XML documents that you author containing Microsoft Assistance Markup Language (MAML). The Sandcastle tools are command-line based and have no GUI front-end, project management features, or an automated build process.\n\nThe Sandcastle Help File Builder was created to fill in the gaps, provide the missing NDoc-like features that are used most often, and provide standalone GUI and command line based tools to build a help file in an automated fashion. A Visual Studio integration package is also available for it so that help projects can be created and managed entirely from within Visual Studio.", "updated": "2024-03-22T18:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/sandcastle/2022.2.6.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sandcastle/2022.2.6.0", "licenseUrl": "https://github.com/EWSoftware/SHFB/blob/master/LICENSE", "packageName": "sandcastle", "displayName": "Sandcastle Help File Builder and Tools (Install)", "summary": "Sandcastle Help File Builder (SHFB). A standalone GUI, Visual Studio integration package, and MSBuild tasks providing full configuration and extensibility for building help files with the Sandcastle tools.", "version": "2022.2.6.0", "icon": "https://raw.githubusercontent.com/EWSoftware/SHFB/master/NuGet/SHFB.png", "author": "Eric Woodruff", "downloadCount": 29469, "tags": ["SHFB", "documentation", "sandcastle", "help", "XML", "comments", "file", "builder", "admin"]}