{"description": "SecPod Saner is a user-friendly and reliable software solution designed as a means of proactively protecting your computer against threats, virus attacks and malware.\nGenerally, most risks to your system originate from outdated software, including files that are obsolete, which in turn become vulnerable to outside threats. Malware and viruses benefit from exactly those loopholes in your PC to attack and obtain your personal data that can be used in nefarious purposes.\nSimilarly, they can threaten your computer's entire stability, causing system crashes and a wide array of different problems, which end up completely wrecking your machine.\nSecPod Saner is quite simple to understand and work with. Upon installation, you can launch the utility then press the 'Scan' button, and it will analyze all your system's status, determining all the outdated files and components, as well as identifying their possible fixes, if any exist.\nSubsequently, SecPod Saner enables you to repair the detected issues by clicking on the 'Remediate All' button, which will then start to bring your PC's software and all related files up to date, eliminating vulnerabilities as much as possible and lowering the risk of malware attacks.\nWhile most applications focus on eliminating the virus or cleaning the malware from your computer, they do not work on determining the cause of the infection or the manner in which your system became vulnerable in the first place.\nWith SecPod Saner, you can identify the status of your PC and remediate the possible reasons why your system is at risk of being infected, thus working proactively in preventing your machine from being exposed to future attacks.\nTo conclude, SecPod Saner is an efficient and useful program that can successfully help you keep your computer at bay from virus attacks and malware infections, by eliminating the commonly used loopholes and preventing their occurrence altogether.", "updated": "2024-03-16T15:48:36Z", "galleryUrl": "https://community.chocolatey.org/packages/sanerpersonal/1.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sanerpersonal/1.1", "licenseUrl": "http://saner.secpod.com/faq.html", "packageName": "sanerpersonal", "displayName": "SecPod Saner Personal", "summary": "Determine your system's vulnerabilities and repair them with just one push of a button.", "version": "1.1", "icon": "https://raw.github.com/tonigellida/chocolateyautomaticpackages/master/sanerpersonal/sanerpersonal.png", "author": "SecPod", "downloadCount": 1689, "tags": ["notSilent", "vulnerability", "inspector", "security"]}