{"description": "##Save images, web content and screen capture to Tonido\n\nSave to Tonido chrome extension allows users to right click any file (documents, images, audio and video) and save to Tonido personal cloud running on your PC, Mac or Linux.  One can take screenshots of entire page and save to their Tonido Personal Cloud. Users can also choose the target folder where one want to store the files.\n\n\n------ Access, Share and Sync from Anywhere ------------------------\n\nYour Own Personal Cloud\n\nTonido is an ultra simple personal cloud server software that allows you to access and share your documents, photos, music through a web browser without uploading or worrying about storage limits. Share files, music, photos and videos straight from your PC.\n\nHow It Works?\n\n1. Download and Install Tonido Server software on your computer.\n\n2. Create a Tonido account. The account becomes part of the URL for your computer\nhttp://username.tonidoID.com\n\n3. Access your computer using this URL\n\nBenefits\n\nSECURE ACCESS, FILE SHARING AND SYNC\nAccess your files from anywhere. Share large files and folders with family, friends and colleagues. Setup public direct links so anyone can access the content or create a secure private share that only authorized people are allowed to access them.\n\nENJOY YOUR PHOTOS, MUSIC AND VIDEOS FROM ANYWHERE\nUltra Fast, High Performance Media Organization. Quickly stream your entire media collection to any device.You are no longer limited by your phone's or tablet's capacity.\n\nWORKS UNIVERSALLY\nWorks on Windows, Linux, Mac and all major mobile phones and tablets including iPhone, iPad, Android, Windows Phone 8 and Blackberry. Works on Raspberry Pi.\n\nAUTOMATICALLY BACKUP PHOTOS FROM YOUR PHONE\nAutomatically backup photos/video from Android/iPhone to your Personal Cloud without user intervention.\n\nHAVE YOUR OWN LOGO, BRANDING, IDENTITY\nYou can customize the branding to what you want to make the Tonido space your own. You can even run the service using your own custom domain name.\n\nPRIVATE AND SECURE\nBy providing direct access to your files on your computer, you can rest assured that your data stays with you, providing complete privacy and control.\n\nTonido is the # Personal Cloud server used by millions of users around the world.\n\t\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-02-29T21:18:48Z", "galleryUrl": "https://community.chocolatey.org/packages/save-to-tonido-chrome/1.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/save-to-tonido-chrome/1.1.0", "licenseUrl": "http://www.tonido.com/tos/", "packageName": "save-to-tonido-chrome", "displayName": "Save to Tonido for Chrome", "summary": "Save to Tonido allows you to save documents to your Tonido server from the Chrome browser.", "version": "1.1.0", "icon": "http://www.tonido.com/images/app_screenshot_default.png", "author": "FileCloud (CodeLathe)", "downloadCount": 691, "tags": ["tonido", "sync", "cloud", "chrome", "extension"]}