{"description": "Scientific Word Version 6 brings you the ease of entering text and mathematics in natural notation in an easy-to-use word processing system. With its entirely new Mozilla-based architecture, Scientific Word 6 provides more flexibility for your workplace. You can save or export your documents in multiple formats, according to your publication and portability needs. Your documents are saved as xml files which makes them completely portable across platforms. Sharing your work with colleagues is easier than ever.\n    \nBecause Scientific Word 6 is a front end to LaTeX, you do not have to learn the LaTeX syntax. When you typeset, LaTeX automatically generates footnotes, indexes, bibliographies, tables of contents, and cross-references. \n\n# [MacKichan Software, Inc. has gone out of business](https://www.mackichan.com/)\nMacKichan Software, Inc., after providing word processing software for those who speak the language of mathematics for forty years (under several names), closed its doors on June 30, 2021. This marks the end of sales and support for the MacKichan Software products.\n\nWe expect to make Scientific Word an open source product eventually. \n\n### Trial Version\n* By default, this package will install a limited, trial version of Scientific Word without the ability to save or print.  \n* **You will need to activate the installation with an email address to make it fully functional.**  (Click on *Help* in the menu bar, then choose *Activate*.  Follow the instructions given on the screen.)  \n* The 30-day trial serial number to use will be put on the desktop in a text file named \"Scientific Word Trial Serial Number.txt\".  \n* If you reference an existing license (below), this file will NOT be created.\n\n### Package Parameters for Licenses\nIf you already have a license file or [RLM license server](http://www.reprisesoftware.com/admin/software-licensing-faq.php) for Scientific Word, the following package parameters are available to be used with the `-params` switch to direct the program to a license.:\n  \n* `/LicenseFile:`<`path`>\n    Set this parameter to have the license file copied to the local install location.\n* `/SystemVariable:`_<`port@server`|`path`>_\n    Set this parameter to have the system environment variable, \"mackichn_LICENSE\", (which is the first thing checked by the software) set to either:\n    * _<`port@server`>_  the port and server name of a configured license server\n    * _<`path (to license)`>_ the path to a license file or a folder (with multiple license files).  It cannot contain the `@` symbol.\n    \n###### Examples : \n  `choco install scientificword -params '\"/SystemVariable:31416@server.example.com\"'`\n  `choco install scientificword -params '\"/LicenseFile:\"\"\\\\Server\\Share\\SciWord\\license.lic\"\"\"'`\n_(note: the double-double quotes around the path are only needed if it contains spaces)_", "updated": "2024-03-23T04:18:51Z", "galleryUrl": "https://community.chocolatey.org/packages/scientificword/6.1.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/scientificword/6.1.2", "licenseUrl": "https://web.archive.org/web/20210411045642if_/https://www.mackichan.com/index.html?products/licensing/EULA.html", "packageName": "scientificword", "displayName": "Scientific Word (Final Release)", "summary": "Makes typesetting and publishing with LaTeX easier.", "version": "6.1.2", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@0bb730e97aa3f50e6330542dcc1bc511da6d2879/Icons/scientificword_icon.png", "author": "MacKichan Software,  Inc.", "downloadCount": 1958, "tags": ["scientificword", "scientific", "word", "tex", "latex", "typesetting", "trial", "admin"]}