{"description": "## Why ScienceFair? \nHow we access, read and reuse scientific literature is largely controlled by a few vast publishing organisations. This is holding society back. \n\nMany wonderful innovations are being explored outside those organisations, but they are rarely integrated into the platforms where people actually access science. \n\nWe have a vision of a different, better, future for science. A future that's more fair, inclusive and open. A future that makes it easy to innovate and explore and where users control and customise their experience.\n## Features\n* Search, collect, read and analyse scientific papers.\n* Clean, modern user interface.\n* Rich interactive reading experience.\n* Distributed data store.\n* Control the datasources you use.\n* Text-mining ready corpus.\n\n## Technology\n* Science-focused JATS XML reader provided by lens.\n* Distributed data sharing using Dat's hyperdrive.\n* Fast local search index built on searchindex.\n* Created using web technologies with choo and electron.\n\n## Community\nScienceFair v1 was developed by Code for Science and FathomLabs along with other contributors, with support from Mozilla Science Lab, eLife and the Dat project.\n\nIf you find a bug in ScienceFair please report it on the issue tracker. You can chat with us any time on IRC (#sciencefair on freenode.net).\n\nScienceFair is an Open Source project. Code is licensed under the MIT license and hosted on Github. We welcome contributions of any kind from anyone, provided you follow our code of conduct.", "updated": "2024-03-16T14:18:40Z", "galleryUrl": "https://community.chocolatey.org/packages/sciencefair/1.0.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sciencefair/1.0.6", "licenseUrl": "https://github.com/codeforscience/sciencefair/blob/master/LICENSE", "packageName": "sciencefair", "displayName": "ScienceFair", "summary": "The open source p2p desktop science library that puts users in control.", "version": "1.0.6", "icon": "https://cdn.rawgit.com/codeforscience/sciencefair/2c29db0f/assets/resolutions/256.png", "author": "codeforscience", "downloadCount": 1025, "tags": ["admin", "electron", "science", "p2p", "search", "paper", "reader"]}