{"description": "Scilab is free and open source software for numerical computation providing a powerful computing environment for engineering and\n      scientific applications.\n\n      Scilab includes hundreds of mathematical functions. It has a high level programming language allowing access to advanced data\n      structures, 2-D and 3-D graphical functions.\n\n      #### Features\n\n      * Maths and Simulation for usual engineering and science applications including mathematical operations and data analysis.\n      * 2-D and 3-D Visualization graphics functions to visualize, annotate and export data and many ways to create and customize various types of plots and charts.\n      * Optimization algorithms to solve constrained and unconstrained continuous and discrete optimization problems.\n      * Statistics tools to perform data analysis and modeling.\n      * Control System Design and Analyse standard algorithms and tools for control system study.\n      * Signal Processing to visualize, analyze and filter signals in time and frequency domains.\n      * Application Development to increase Scilab native functionalities and manage data exchanges with external tools.\n      * Xcos - Hybrid dynamic systems modeler and simulator for modeling mechanical systems, hydraulic circuits, control systems...\n\n      #### Scilab as a platform\n\n      Thanks to its ability to interconnect with third-party technologies and applications, Scilab can also act as a\n      unique platform to bring together codes written in different programming languages in a single, unified\n      language, thus facilitating their distribution, their back-up and use.\n\n      * [Wiki](http://wiki.scilab.org/)\n      * [Manual](http://help.scilab.org/)\n\n      #### Community\n      * [File exchange](http://fileexchange.scilab.org/)\n      * [Forum](http://scilab.developpez.com/) (Français)", "updated": "2024-03-24T01:18:29Z", "galleryUrl": "https://community.chocolatey.org/packages/SciLab/2024.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/SciLab/2024.0.0", "licenseUrl": "https://www.gnu.org/licenses/gpl-2.0.en.html", "packageName": "SciLab", "displayName": "Scilab", "summary": "Scientific software for analysis and modeling numerical computation", "version": "2024.0.0", "icon": "https://cdn.statically.io/gl/chocolatey-packages1/chocolatey-scilab/icons/scilab.png", "author": "Scilab Enterprises", "downloadCount": 19907, "tags": ["mathematics", "numerical", "computation", "admin"]}