{"description": "Installed Version of Screenshot Captor.\n    Version numbers are now dated to match release date on Donationcoder website.\n    This is a best-in-class tool for grabbing, manipulating, annotating, and sharing screenshots. It's different from other screenshot utilities in several notable ways:\n\nOptimized for taking lots of screenshots with minimal intervention; stays out of your way until you need it.\nSuper easy to add and edit callout arrows and text boxes.\nEasy automatic or on-demand uploading of screenshots to image hosting services; easy emailing of screenshots to your friends and colleagues.\nTake snapshots from webcams; record video with the ESR addon.\nNew optional quick-capture docking bar and post-capture action dialog.\nFull set of scanner acquisition tools and scanner image correction.\nPerfect capture of Windows 7 partial transparency effects.\nThe most powerful scrolling capture tool in the field.\nGreat special effects, including automatic active window enhancement, ragged edge splicing, pixelation, smart text removal, and many more.\nSmart autonaming of files, easy renaming and format conversion; automatic image file versioning.\nAbility to embed textual comments in files or add attractive captions to images and printouts.\nUnsurpassed multi-monitor support and lots of capture modes: Multimon (multiple monitors), Desktop, Active Window, Region, Windows Object, Scrolling Capture. Each mode has a customizable hotkey for quick access.\nUnsurpassed support for 3rd party user configurable tools, including file browsers and image editors; extend the program to do whatever you need by interfacing it with other programs.\nSidebar thumbnail file browser provides full shell operations, drag and drop support, and right-click actions on screenshots.\nDeluxe thumbnail maker and watermarker.", "updated": "2024-03-23T12:18:27Z", "galleryUrl": "https://community.chocolatey.org/packages/screenshotcaptor/5.0.0.2020013100", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/screenshotcaptor/5.0.0.2020013100", "licenseUrl": "https://cdn.jsdelivr.net/gh/Absoblogginlutely/Chocolatey-Screenshotcaptor/eula.txt", "packageName": "screenshotcaptor", "displayName": "Screenshot Captor", "summary": "Screenshot Captor is a best-in-class tool for grabbing, manipulating, annotating, and sharing screenshots.", "version": "5.0.0.2020013100", "icon": "https://cdn.jsdelivr.net/gh/Absoblogginlutely/Chocolatey-Screenshotcaptor/icon.png", "author": "DonationCoder", "downloadCount": 2662, "tags": ["Screenshot", "Captor", "donationcoder", "Mouser"]}