{"description": "### Legacy version\nThis is the older, unsupported version 1.x of Scrivener. It is only inteded for holders of existing licenses for version 1.x. New users should install the package *scrivener*, which installs the current, supported version.\n\n### For writing. And writing. And writing.\nScrivener is the go-to app for writers of all kinds, used every day by best-selling novelists, screenwriters, non-fiction writers, students, academics, lawyers, journalists, translators and more. Scrivener won't tell you how to write—it simply provides everything you need to start writing and keep writing.\n    \n### Grow your manuscript your way\nTailor-made for long writing projects, Scrivener banishes page fright by allowing you to compose your text in any order, in sections as large or small as you like. Got a great idea but don't know where it fits? Write when inspiration strikes and find its place later. Grow your manuscript organically, idea by idea.\n\n### See the forest or the trees\nWhether you plan or plunge, Scrivener works your way: hammer out every last detail before typing a word, or carve out a draft and restructure later. Or mix your methods and do a bit of both. In Scrivener, everything you write is integrated into an easy-to-use project outline. So working with an overview of your manuscript is only ever a click away, and turning Chapter Four into Chapter One is as simple as drag and drop.\n\n### Research within reach\nNeed to refer to research? In Scrivener, your background material is always at hand, and you can open it right next to your work. Write a description based on a photograph. Transcribe an interview. Take notes about a PDF file or web page. Or check for consistency by referencing an earlier chapter alongside the one in progress.\n\n### Getting it out there\nOnce you're ready to share your work with the world, compile everything into a single document for printing, self-publishing, or exporting to popular formats such as Word, PDF, Final Draft or plain text. You can even share using different formatting, so that you can write in your favorite font and still satisfy those submission guidelines.", "updated": "2024-03-03T12:03:19Z", "galleryUrl": "https://community.chocolatey.org/packages/scrivener1/1.9.17", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/scrivener1/1.9.17", "licenseUrl": "http://www.literatureandlatte.com/downloads/Scrivener-EULA-Windows.pdf", "packageName": "scrivener1", "displayName": "Scrivener 1.x", "summary": "Scrivener is a word-processing program and outliner designed for authors.", "version": "1.9.17", "icon": "https://cdn.jsdelivr.net/gh/cconrad/chocolatey-packages/icons/scrivener1.png", "author": "Literature & Latte Ltd.", "downloadCount": 134, "tags": ["scrivener", "legacy", "trial"]}