{"description": "## SDelete\nSecurely overwrite your sensitive files and cleanse your free space of previously deleted files using this DoD-compliant secure delete program.\n\nOne feature of Windows NT/2000's (Win2K) C2-compliance is that it implements object reuse protection. This means that \nwhen an application allocates file space or virtual memory it is unable to view data that was previously stored in the \nresources Windows NT/2K allocates for it. Windows NT zero-fills memory and zeroes the sectors on disk where a file is \nplaced before it presents either type of resource to an application. However, object reuse does not dictate that the space \nthat a file occupies before it is deleted be zeroed. This is because Windows NT/2K is designed with the assumption that \nthe operating system controls access to system resources. However, when the operating system is not active it is possible to \nuse raw disk editors and recovery tools to view and recover data that the operating system has deallocated. Even when you \nencrypt files with Win2K's Encrypting File System (EFS), a file's original unencrypted file data is left on the disk after a \nnew encrypted version of the file is created.\n\n#### Command line usage\n\n_SDelete_ is a command line utility that takes a number of options. In any given use, it allows you to delete one or more \nfiles and/or directories, or to cleanse the free space on a logical disk. _SDelete_ accepts wild card characters as part of \nthe directory or file specifier.\n\n__sdelete__ [__-p__ passes] [__-s__] [__-q__] &lt;_file_ | _directory_&gt;\n\n__sdelete__ [__-p__ passes] [__-z__|__-c__] [drive letter]\n\n__-a__  Remove Read-Only attribute.\n\n__-c__  Clean free space.\n\n__-p passes__  Specifies number of overwrite passes (default is 1).\n\n__-q__  Don't print errors (Quiet).\n\n__-s__ or __-r__  Recurse subdirectories.\n\n__-z__  Zero free space (good for virtual disk optimization).\n\n### Package-specific issue\nIf this package isn't up-to-date for some days, [Create an issue](https://github.com/tunisiano187/Chocolatey-packages/issues/new/choose)\n\nSupport the package maintainer and [![Patreon](https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@d15c4e19c709e7148588d4523ffc6dd3cd3c7e5e/icons/patreon.png)](https://www.patreon.com/tunisiano)", "updated": "2024-03-23T20:48:38Z", "galleryUrl": "https://community.chocolatey.org/packages/sdelete/2.5.0.20231106", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sdelete/2.5.0.20231106", "licenseUrl": "https://docs.microsoft.com/en-us/legal/termsofuse", "packageName": "sdelete", "displayName": "SDelete", "summary": "Securely overwrite sensitive files and cleanse free space", "version": "2.5.0.20231106", "icon": "", "author": "Mark Russinovich", "downloadCount": 34530, "tags": ["privacy", "security", "delete", "erase", "sysinternals", "cli"]}