{"description": "## Snappy Driver Installer Origin (SDIO)\nSnappy Driver Installer Origin is a fork of Snappy Driver Installer starting at version `r541`. The old project is no longer in the hands of the original developers, is no longer open source and is not safe to use.\n\nSnappy Driver Installer Origin remains a free, open source project. Free means it costs you nothing to download and use. Free means it is free of adware, malware, backdoors, unwanted third party software or other dodgy stuff.\n\n#### INSTALL MISSING DRIVERS AND UPDATE OLD DRIVERS\n\nIf you've lost your driver discs, you're unable to find drivers on the manufacturer's website or Windows Update can't configure your hardware, use this tool to quickly find and install all missing drivers.\n\nIf you're a PC technician, keep Snappy Driver Installer Origin on your USB flash drive or external hard drive and take it with you wherever you go. In environments with no Internet access, you can quickly get things working. No more searching for drivers after a clean install, just let Snappy Driver Installer Origin do its thing and your job will be done in no time.\n\n#### Free\nNo limitations. No premium features. No adware. No gotchas.\n\n#### Portable\nKeep it on your USB flash drive and use it on the go. No installation is necessary.\n\n#### Up-to-date\nYou'll be notified about available updates and you'll be able to download them with the tool itself.\n\n#### Safety\nEasy system restore point creation. \n\n#### Supports all Windows\nCompatible with all versions of Windows, including server editions. \n\n#### Customizable\nPick any theme you like or make your own.\n\n#### Accurate\nState of the art algorithms for finding the best matching drivers for any devices.\n\n#### Open source\nLicensed under GNU GPL v3.0.\n\n#### Multilingual\nTwenty-seven languages are supported. Your language is probably among them.\t\n\n#### Supports\nWindows XP, Vista, 7, 8, 8.1, 10\n\n#### _Maintainer Notes_\n_Since `r558` all application data, including downloaded drivers, is stored under `%ALLUSERSPROFILE%\\SDIO`. This folder is cleaned up on uninstall._\n\n### Package-specific issue\nIf this package isn't up-to-date for some days, [Create an issue](https://github.com/tunisiano187/Chocolatey-packages/issues/new/choose)\n\nSupport the package maintainer and [![Patreon](https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@d15c4e19c709e7148588d4523ffc6dd3cd3c7e5e/icons/patreon.png)](https://www.patreon.com/tunisiano)", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/sdio/1.12.21.762", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sdio/1.12.21.762", "licenseUrl": "https://sourceforge.net/p/snappy-driver-installer-origin/code/HEAD/tree/trunk/resources/gpl-3.0.txt?format=raw", "packageName": "sdio", "displayName": "Snappy Driver Installer Origin", "summary": "Windows driver updater program.", "version": "1.12.21.762", "icon": "https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@7e62d1d987cbebf759a96d045bbe82bc0747403e/icons/sdio.png", "author": "Glenn Delahoy", "downloadCount": 67210, "tags": ["snappy", "driver", "installer", "origin", "drivers", "updater", "utility", "portable", "SDI", "SDIO"]}