{"description": "---\n\n### [choco://serva](choco://serva)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n\n![Screenshot of Serva](http://www.vercot.com/~serva/Imgs/Serva_30.png)\n\nServa is an Automated PXE Server Solution Accelerator\nbased on an all-in-one portable multi-server engine\n\n+ HTTP server\n+ FTP server\n+ TFTP server\n+ TFTP client\n+ DHCP server\n+ proxyDHCP server 1\n+ BINL server 2\n+ DNS server\n+ SNTP server\n+ SYSLOG server\n\n\n1. PXE DHCP service that does not require altering your current DHCP server.\n2. Microsoft WAIK/ADK independent RIS and WDS alternative.\n\n\nServa is a tiny (~1 Mb), yet powerful Microsoft Windows application. It was conceived mainly as an Automated PXE Server Solution Accelerator. It bundles on a single exe all of the underlying server protocols and services required by the most complex PXE network boot/install scenarios simultaneously delivering Windows and non-Windows resources.\n\n\nIt includes proxyDHCP and a WAIK (Windows Automated Install Kit) and ADK (Assessment and Deployment Kit) independent RIS and WDS server alternative.\nServa's application field also tackles the ultra-fast set-up of simple single-protocol solutions like i.e. HTTP or FTP server for file delivery.\n\n\nThe application does not require installation, It does not require Internet connection, it does not save keys on your Windows registry, and it can be used right away. Serva includes a very simple and comprehensive interface that will quickly guide you through all its settings.\n\n\nServa is a full C/C++ multi-threaded application that runs from Windows 2000 to Windows 10.\nSee what Serva can do for you by reading its Application Notes starting [here](http://www.vercot.com/~serva/an/WindowsPXE1.html).\n\nInitially targeting the sysadmin in a hurry and the average IT enthusiast, Serva PXE/BINL was originally designed as the simple alternative to the server functionality of those fantastic pieces of software called Microsoft RIS and WDS. Today Serva PXE/BINL also includes advanced features like unattended installs, Windows PE booting, or single-menu multi-repository integration. Please read about these exiting new features here [Serva PXE/BINL - AN02: Windows Install Adv and WinPE Boot](http://www.vercot.com/~serva/an/WindowsPXE2.html).\n\nThis package installs Serva Community which is licensed for personal, non-commercial use only and has some limitations when using PXE/BINL services. For a full list of differences between Serva Community (this package) and Serva Pro, see the [comparison chart](http://www.vercot.com/~serva/download.html).\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/serva/readme.md)**\n\n    \n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-11T11:48:24Z", "galleryUrl": "https://community.chocolatey.org/packages/serva/4.6.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/serva/4.6.0", "licenseUrl": "http://www.vercot.com/~serva/eula.html", "packageName": "serva", "displayName": "Serva Community Build (Portable)", "summary": "Serva is an Automated PXE Server Solution Accelerator based on an all-in-one portable multi-server engine.", "version": "4.6.0", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/serva/serva_icon.png", "author": "Patrick Masotta", "downloadCount": 4673, "tags": ["serva", "http", "ftp", "tftp", "dhcp", "binl", "dns", "sntp", "syslog", "pxe", "server", "community", "portable"]}