{"description": "how to use\nits really simple. just run SetDefaultBrowser.exe in the user context (there is a list of possible ways in my previous blog) with the the hive and browser of your choice. Since the version 1.3 there are more parameters and it might look complicated, but it gives you actually much more flexibility. Just run SetDefaultBrowser without parameters to get a list of all available browsers:\n\n\n\nas you can see, i have a ton of Browsers on my system and using the following examples i can change the default Browser:\n\nSetDefaultBrowser.exe HKLM Firefox-308046B0AF4A39CB\nthis will set the x64 Firefox as my default\nSetDefaultBrowser HKCU “Google Chrome.HEYY3KJOYOAJOPVCHWOFAPMTPI”\nthis will set the Chrome that is only installed in my AppData as my default\nSetDefaultBrowser.exe HKLM Edge delay=1000\nthis will set Edge as my default browser, but will wait 1 second until it executes. delay must be provided in milliseconds.\nSetDefaultBrowser.exe HKLM IEXPLORE.EXE group=IE_Users\nthis will set IE as my default Browser, if i am member of the IE_Users group\ni hope these examples explain the possibilities and parameters clearly. if a browser identifier contains a space, you must use quotes – for example “Google Chrome”. the same applies to group names (but you also can use Domain\\Group or group@yourdomain.tld).\n\nto maintain limited compatibility with the older versions of SetDefaultBrowser, i have added shortcuts to the most used Browsers\n\nSetDefaultBrowser.exe chrome\nthis will set Chrome as my default Browser, when its available in HKLM\nSetDefaultBrowser.exe ie delay=2000\nthis will set Internet Explorer as my default Browser but delays two seconds before\nSetDefaultBrowser edge group=EdgeUsers\nthis will make Edge the default if the user is member of the EdgeUsers group\navailable shortcuts are: chrome, ie, iexplore and edge. i had to skip Firefox, since you can have multiple Firefox installations (for example x64 and x86, like on the screenshot above) and using the hive and browser parameter, you can better specify which one you want to set as default.\n\nSetDefaultBrowser will also find the browser when it is not installed at the default path.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/setdefaultbrowser/1.5.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/setdefaultbrowser/1.5.0", "licenseUrl": "https://raw.githubusercontent.com/sippi90/chocolateyautomaticpackages/master/setdefaultbrowser/legal/LICENSE.txt", "packageName": "setdefaultbrowser", "displayName": "SetDefaultBrowser", "summary": "the story behind is pretty much the same, but to set a Browser, additional Registry Keys are needed (they are protected with the Hash like the Filetypes). the only difference is, that Microsoft also checks the path of the Browser (and hashes it too). for that reason i decided to create a separate tool to make it as simple as possible.", "version": "1.5.0", "icon": "", "author": "Christoph Kolbicz", "downloadCount": 135520, "tags": ["tool", "set", "default", "browser", "windows", "10"]}