{"description": "![Screenshot of ShadowExplorer] (http://www.shadowexplorer.com/uploads/images/manual/manual_4.png)\n\n###About\n\nShadowExplorer allows you to browse the Shadow Copies created by the Windows Vista / 7 / 8 Volume Shadow Copy Service. It's especially thought for users of the home editions, who don't have access to the shadow copies by default, but it's also useful for users of the other editions.\n\n###Shadow Copy\nFrom time to time, Windows Vista / 7 / 8 creates point-in-time copies of your files. This allows you to retrieve older versions from files you accidentally deleted or altered. This service is turned on by default on all versions of Windows Vista/7, but Microsoft grants access to these copies only in Ultimate, Business, and Enterprise editions. This is where ShadowExplorer comes into play. For more information on Shadow Copy, visit Microsofts website.\n\n###ShadowExplorer\nSince the Volume Shadow Copy Service is included, and turned on by default, in all editions of Windows Vista / 7 / 8, why not take advantage of it? All it takes is an additional tool like ShadowExplorer, that can access the shadow storage and make the point-in-time copies accessible to the user.\n\n###Features\n* Show available point-in-time copies\n* Browse through Shadow Copies\n* Retrieve versions of files and folders\n\n###Limitations\nShadow Copies and ShadowExplorer are in no way a replacement for regular backups! This is very important and can't be stressed enough. A Shadow Copy is kept on the same disc as the original data. In case of a disc failure all data is lost, including the Shadow Copies. ShadowExplorer is a good addition to regular backups, but not a replacement.", "updated": "2024-03-22T14:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/shadowexplorer/0.9.462", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/shadowexplorer/0.9.462", "licenseUrl": "", "packageName": "shadowexplorer", "displayName": "ShadowExplorer (Install)", "summary": "ShadowExplorer allows you to browse the Shadow Copies created by the Windows Vista / 7 / 8 Volume Shadow Copy Service.", "version": "0.9.462", "icon": "http://www.shadowexplorer.com/uploads/images/manual/manual_1.png", "author": "ShadowExplorer.com", "downloadCount": 3261, "tags": ["shadowexplorer", "admin"]}