{"description": "# SideQuest\n\n![Image](https://i.imgur.com/AlYMbTj.png)    \n    \n    \nSideQuest is designed to simplify sideloading apps onto your standalone android based headset. It should include everything you need to get started. When you first open the app it is best to open the setup screen and follow the instructions on screen to get set up.\n    \nThe quest doesnt show 2D apps normally anywhere in the UI. Thankfully though SideQuest has a launcher ( install on the setup screen - scroll down to the bottom ) which appears in the unknown sources list and lets you open 2d apps. You can pick \"SideQuest - Home\" or \"SideQuest - TV\" to use the 2D app in the Oculus Home or Oculus TV environments. \n    \nVR apps dont work when launched from the app launcher currently, only 2d apps. The workaround is to launch the VR apps from the unknown sources list instead - they are usually listed there!\n    \n    \n## SideQuest Features\n    \n-   Automatic download of ADB platform-tools for your platform - win/mac/linux.\n-   Automatic download of QuestSaberPatch for your platform - win/mac/linux.\n-   Automatic download of songe-converter for your platform - win/mac/linux.\n-   Setup instructions for enabling developer mode on your device.\n-   AppStarter based app launcher in both Oculus Home and Oculus TV for launching and using 2D apps\n-   Drag and drop support for installing arbitrary apk/obb files.\n-   File manager with drag and drop support ( thanks Mitch ) \n-   Dark mode\n-   New installed apps manager with a backup system.\n-   Beat Saber song manager for patching songs onto the Oculus Quest - sorting, multi select, remove duplicates and drag and drop\n-   Auto downloading via the in-app browser - now works with beatsaver.com, bsaber.com and also any APK downloads too!", "updated": "2024-03-23T01:03:30Z", "galleryUrl": "https://community.chocolatey.org/packages/sidequest/0.10.39", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sidequest/0.10.39", "licenseUrl": "https://github.com/SideQuestVR/SideQuest/blob/master/LICENSE", "packageName": "sidequest", "displayName": "SideQuest", "summary": "A open app store for mobile android based VR devices such as the Oculus Go, Oculus Quest or other android based devices.", "version": "0.10.39", "icon": "https://rawcdn.githack.com/SideQuestVR/SideQuest/e84513bd054ad26f7701455185cbe5b78d09fd38/desktop-app/src/assets/images/logo.png", "author": "SideQuest VR", "downloadCount": 11200, "tags": ["sidequest", "vr", "game", "store", "occulus", "android"]}