{"description": "# Feautures\n\n## It's fast. really fast.\nSome grep alternatives try to be fast by not searching everywhere. sift was developed with performance in mind and just is fast.\nTake a look at the benchmarks for details.\n\n## No installation\nsift comes as a single executable with no dependencies and is available for all major platforms (Linux, Windows, OS X, BSD)\nNeed to use sift on a remote server? Just copy it over and it will work - no problems due to missing packages.\n\n## Flexiblity. all the features you expect from a modern grep alternative.\n\n- RegEx - perl compatible regular expression syntax (no more escape hell)\n- usable defaults - basic options known from grep but with usable defaults\n- multiline support - find matches spanning over multiple lines\n- replace - replace output to reformat it to your needs without relying on awk/sed\n- gzip files - search through normal and gzip'ed files in one program call\n- multiple patterns - search for multiple patterns in one run\n- target selection - select or exclude search targets based on file name, directory name, path and type\n- handling big data - sift handles big files without problems: files >50GB, >5,000,000,000 lines and >5,000,000,000 matches successfully tested\n- customizable - optional global and local configuration file to specify your own preferences\n\n## Use Conditions\nDoing code audits? Need to extract data from complex formats?\nsift will make this much easier.\nYou may specify various conditions and only get matches.\n- preceded by A\n- followed by B within X lines\n- if the file also contains a line with C\n- if the file contains D in the first Y lines\n- any combination of the available conditions", "updated": "2024-03-23T06:03:27Z", "galleryUrl": "https://community.chocolatey.org/packages/Sift/0.9.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Sift/0.9.0", "licenseUrl": "https://github.com/svent/sift/blob/master/LICENSE", "packageName": "Sift", "displayName": "Sift - grep on steroids", "summary": "Sift - grep on steroids", "version": "0.9.0", "icon": "", "author": "Sven Taute", "downloadCount": 26147, "tags": ["search", "text", "regex", "grep", "ag"]}