{"description": "Did you ever want a simple program to record your podcasts, Internet radio, Pandora*, Spotify*, or satellite radio* (Sirius or XM)? Don't go any further. Simple Radio Recorder will do it for you. And most of all, if you register within the first 30 days, it is also FREE!\n\n## Special features\n- Can record AM/FM or satellite radio broadcasts*, as well as sound from your stereo system, Boom-box, TV, YouTube, Internet radio* (such as Pandora*, Spotify*, or others) and computer software and games.\nEasy-to-understand, step-by-step explanation of how to buy and install necessary hardware**.\n- Ability to record in MP3 and uncompressed PCM sound formats.\n- Can set a repeating schedule for unattended recording of any length.\n- Supports setting up of multiple recording schedules.\n- Can save recording schedules into files for easier access later.\n- Possibility to wake system up from sleep or hibernation at a scheduled time for recording.\n- Can set other scheduled events, such as running programs, opening files or Internet pages and playing music, as well as sending the system into suspended power state.\n- Can play back the live sound broadcast over a device connected via a Line-in or a Mic jack.\n- Can be run from a command line to maximize potential application.\n- Does not contain any commercials, pop-ups, crap-ware or any \"hidden ware\".\nAnd best of all - it is FREE if you register your copy within the first 30 days!\n\n_* Satellite radio receiver and antenna are required for satellite radio recording. Subscription to a service may be required to receive broadcasts._\n\n_** Minimum hardware installation may be required to begin recording of the sound input off some devices._\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/simpleradiorecorder/screenshot.png)", "updated": "2024-03-23T05:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/simpleradiorecorder/1.2.7.100", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/simpleradiorecorder/1.2.7.100", "licenseUrl": "https://www.dennisbabkin.com/srr", "packageName": "simpleradiorecorder", "displayName": "Simple Radio Recorder", "summary": "Saves energy by waking computers from sleep.", "version": "1.2.7.100", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/simpleradiorecorder/simpleradiorecorder.png", "author": "Dennis Babkin", "downloadCount": 772, "tags": ["simpleradiorecorder", "radio", "podcast", "pandora", "spotify", "satellite", "sirius", "xm", "recorder"]}