{"description": "SIRIL is an astronomical image processing tool.\n\n      It is specially tailored for noise reduction and improving the signal/noise ratio of an image from multiple captures, as required in astronomy.\n      \n      SIRIL can align automatically or manually, stack and enhance pictures from various file formats, even image sequence files (films and SER files).\n      \n      **WHO SHOULD USE SIRIL?**  \n      SIRIL is targeted to amateur astronomers having acquired images and wanting to process them in a semi-automatic way.\n      \n      **FEATURES**  \n      SIRIL uses modern and powerful processing algorithms running in parallel in order to speed up the time of processing.\n      \n      **WHAT ARE THE ADVANTAGES IN USING SIRIL?**  \n      Nearly the whole processing chain is available in SIRIL. With only one software you can produce high quality images for print or web diffusion.\n      \n      **DEEP SKY**  \n      SIRIL is fully capable to pre-process and process astronomic images by offering to the users a large set of dedicated algorithms. So far, due to the high level of its star detection algorithm it is quite performant to process deep-sky images in an easy way.\n      \n      **LUCKY IMAGING**  \n      Thanks to the ability to directly process SER videos, SIRIL is adapted to the deep-sky lucky imaging technic. All algorithms work to use all cores of the computer, making it possible to process more than 60,000 frames with minimal effort.\n      \n      **SOME HIGHLIGHTS OF SIRIL**  \n      New features are being introduced quite regularly. Here is a list of main features:\n      * Native image format support\n      * Image conversion (to the native FITS format only)\n      * Images pre-processing with bias, darks and flats masters\n      * Image registration\n      * Registered sequence export\n      * Image stacking, with optional additive or multiplicative normalization\n      * Enhancement and processing of final images\n      * Image compositing tool, combining and aligning multiple channels\n      * Plotting various pieces of information about an image sequence", "updated": "2024-03-14T15:48:39Z", "galleryUrl": "https://community.chocolatey.org/packages/siril/1.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/siril/1.0.0", "licenseUrl": "https://gitlab.com/free-astro/siril/-/blob/master/LICENSE.md", "packageName": "siril", "displayName": "SIRIL", "summary": "Free astronomical image processing software", "version": "1.0.0", "icon": "https://rawcdn.githack.com/Cossey/storage/c5f737df624d86ec454ccc1c0066cdf19fc497dc/images/logos/siril.svg", "author": "Vincent Hourdin,  Cyril Richard,  François Meyer,  Contributors", "downloadCount": 961, "tags": ["siril", "astronomical", "image", "processing"]}