{"description": "### \"Sleep On Lan\" allows to suspend (put to sleep), hibernate, power off, reboot, lock or logoff Windows machine remotely.  \nCommands are issued via WWW browser - so you can do it from any other PC or mobile phone (like iPhone).\n\nUse case scenario:  \n\nI own Xbox360 and PS3\\. I often want to stream media from my Windows PC (located upstairs) to my consoles (downstairs).  \nI use \"Wake On Lan\" (WOL) feature to wake up my PC (you can do it in many, many ways - I personally use free [\"Awake\"](http://itunes.apple.com/us/app/awake/id295747953?mt=8) app for iPhone).  \nWOL is great - allows my PC to be started remotely but there is no easy way to put my PC back to hibernation when I'm done!  \n\"Sleep On Lan\" allows to do just that - hibernate my PC by simply opening one web page in browser!  \n\nGetting started:\n\n*   Download and extract all files from \"Sleep On Lan\" zip package to your local hard drive.\n*   Application has no installer - so simply run it.\n*   You can change a TCP/IP port that utility uses to listen for incoming connections. But most users will leave it as it is (7760)\n*   Click \"Start\" button to enable listening for commands\n*   Windows firewall is likely to ask if application should have an access to internet (click \"Allow\" or \"Unblock\").\n*   Now from remote PC you can type a command using this format:  \n    http://ip_address_of_your_pc:port_you_selected/command  \n    Where command can be one of this keywords: suspend, hibernate, logoff, poweroff, forcepoweroff, lock, reboot, test\n*   You can add this URL to bookmark on your iPhone (or maybe even as a shortcut on home screen) - you can use this url also at any PC on your network.", "updated": "2024-03-19T11:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/sleeponlan/1.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sleeponlan/1.1", "licenseUrl": "", "packageName": "sleeponlan", "displayName": "SleepOnLan (Portable)", "summary": "\"Sleep On Lan\" allows to suspend (put to sleep), hibernate, power off, reboot, lock or logoff Windows machine remotely.", "version": "1.1", "icon": "", "author": "IrekSoftware/Ireneusz Zielinski", "downloadCount": 928, "tags": ["sleeponlan", "power", "wol", "wakeonlan"]}