{"description": "Free media player with support for Youtube\n\nSMPlayer is a free media player for Windows and Linux with built-in codecs that can also play YouTube videos.\n\nOne of the most interesting features of SMPlayer: it remembers the settings of all files you play. So you start to watch a movie but you have to leave... don't worry, when you open that movie again it will be resumed at the same point you left it, and with the same settings: audio track, subtitles, volume...\n\nSMPlayer is a graphical user interface (GUI) for the award-winning MPlayer, which is capable of playing almost all known video and audio formats. But apart from providing access for the most common and useful options of MPlayer, SMPlayer adds other interesting features like the possibility to play YouTube videos subtitles. \n\nNote: for those people complaining about malware in the windows installer: be sure you download SMPlayer from the official website. Our installer is completely safe and free of malware.\n\n## Best image quality\nThe performance of the flash or html5 player in a web browser is bad... You'll get much better results by using a real media player: smoother playback, no flickering, no frame drops and HD video in fullscreen, even in old computers. With SMTube you can choose the media player to play your favorite YouTube videos.)) instead of a flash player, this allows better performance, particularly with HD content.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/smtube/screenshot.png)", "updated": "2024-03-22T18:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/smtube/21.10.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/smtube/21.10.0", "licenseUrl": "http://www.smtube.org/", "packageName": "smtube", "displayName": "SMTube - YouTube browser for SMPlayer", "summary": "Free media player with support for Youtube.", "version": "21.10.0", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/smtube/smtube.png", "author": "Ricardo Villalba", "downloadCount": 3880, "tags": ["smtube", "smplayer", "video", "media", "player", "multimedia", "youtube"]}