{"description": "Snagit is a image capture program from TechSmith.\n\n## Beyond ordinary screen capture\n\nSnagit's award-winning screen capture software is the only program with built-in advanced image editing and screen recording.\n\n## Capture anything on your screen\n\nSnagit makes it easier and more intuitive to capture your screen or record video. Capture your entire desktop, region, window, or scrolling screen.\n\n## Edit with a few clicks\n\nGet a full suite of editing tools. And create images on your own. Edit screenshots or build custom graphics. Without needing to work with a designer.\n\n## Deliver results\n\nThe human brain processes visuals 60,000 times faster than text. Snagit makes it easy to add videos and images to your email, training materials, documentation, blogs, or social media. Or get a short URL to share your screenshots and recordings with anyone.\n\n## Snagit integrates with the tools you use\n\n* Microsoft PowerPoint\n* Microsoft Word\n* Microsoft Excel\n* Microsoft OneDrive for Business\n* Google Drive\n* ... and more\n\nNOTE: This is a trial install of Snagit. To use your license key see Parameters below.\n\n## Parameters\n\n* /licensekey=ABCD-EFGH-IJKL\n  Registered license key. If this is missing a 30 day trial is installed.\n\nExample: **--params='\"/licensekey=ABCD-EFGH-IJKL\"'**\n\n* /NoDesktopShortcut\n  Does not install an application shortcut on the desktop. Note Snagit no longer creates a desktop icon by default so this option no longer does anything,\n\n* /DisableAutoStart\n  This disables Snagit from automatically starting with Windows.\n\n  Example: **--params='\"/DisableAutoStart\"'**\n\n* /DisableStartNow\n  This disables Snagit from starting right after installation / upgrade.\n\n  Example: **--params='\"/DisableStartNow\"'**\n\n* /HideRegistrationKey\n  Prevents Snagit from displaying the registration key in the Help menu > About Snagit > Support Information dialog.\n\n  Example: **--params='\"/HideRegistrationKey\"'**\n\n* /Language='ENU' | 'DEU' | 'ESP' | 'FRA' | 'JPN' | 'PTB'\n Choose the language Snagit will use with one of these values (English, German, Spanish, French, Japanese or Portugese).\n\n  Example: **--params='\"/Language=JPN\"'**\n\n## Notes\n\n* TechSmith seem to be okay with releasing a new version of the same version. This throws out the checksum of the package. Until the next version is released, please use the `--ignore-checksums` switch with Chocolatey CLI.\n* This package installs the Microsoft WebView2 Runtime. However, it will not be removed on uninstall so please remove it manually.\n* This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T00:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/snagit/2024.1.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/snagit/2024.1.1", "licenseUrl": "http://www.techsmith.com/snagit-eula.html", "packageName": "snagit", "displayName": "Snagit (Install)", "summary": "Snagit is a image capture program from TechSmith.", "version": "2024.1.1", "icon": "https://cdn.jsdelivr.net/gh/pauby/chocopackages/icons/snagit.png", "author": "TechSmith", "downloadCount": 354772, "tags": ["screenshot", "screen", "capture", "techsmith", "admin"]}