{"description": "Snipping Tool++ gives you a very quick and easy way to share screenshots with friends or collegues all in three quck steps. **Press the Hotkey**, **Select the Region**, **Press Enter**. Snipping Tool++ will immediately start uploading your snippet to Imgur.com and will copy the shareable link to your clipboard.\n\n#Features\n> ___\n####**Upload to Imgur**\n> By using a reliable and fast image hosting provider such as Imgur you can rest easy knowing your uploads will be there. Because we use Imgur, you can easily delete any of your uploads from their servers.\n####**Upload via FTP**\n> Save images anywhere that allows FTP access. Images can be saved with a timestamp or by manually specifying a title. You can even automatically backup your Imgur uploads via FTP. Hotkeys are available for FTP only uploads.\n####**Multi-Image Uploader**\n> Quickly upload an entire album of images to Imgur and have a list of links ready in a matter of seconds\n####**Anonymous Cloud History**\n> With Snipping Tool++ you can download your anonymous upload history to any computer with\na Snipping Tool++ client. All you need to do is register a unique key pair with the client which can be any 2 words or phrases. Or Snipping Tool++ can auto-generate one for you! [More Info Here](http://snippingtoolpluspl.us/features/)\n####**Upload Quality Control**\n> Uploading large images? Have a slow upload speed? Tired of waiting? Lowering the quality of your images before uploading can drastically reduce file size and decrease upload wait times. Quality control is located in the preferences.\n####**Capture Viewer**\n> The capture viewer allows you to quickly browse any snippet or screenshot that you either saved or upload and provides you with options to open, send to the image editor, re-upload, or delete from Imgur.\n####**Customizeable Preferences**\n> Change the data directories to a new location, choose whether you want the Image Editor enabled, personalize the hotkeys, and more.\n\n> ___\n\n##[Snipping Tool++ Website](http://snippingtoolpluspl.us)\n\n##[Donate!](http://snippingtoolpluspl.us/donate/)", "updated": "2024-03-23T17:18:31Z", "galleryUrl": "https://community.chocolatey.org/packages/SnippingToolPlusPlus/6.4.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/SnippingToolPlusPlus/6.4.5", "licenseUrl": "https://raw.githubusercontent.com/SnippingToolPlusPlus/SnippingToolPlusPlus/master/license.txt", "packageName": "SnippingToolPlusPlus", "displayName": "Snipping Tool++", "summary": "", "version": "6.4.5", "icon": "http://snippingtoolpluspl.us/downloads/misc/logo.png", "author": "Shane M Israel", "downloadCount": 37620, "tags": ["screenshot", "snippet", "graphic", "capture", "upload", "share", "imgur", "kotkeys"]}