{"description": "![Screenshot of softsqueeze](http://ftparmy.com/images/softsqueeze-02.jpg)\n\t\nSoftsqueeze is a music player for your PC that works with the Squeezebox Server (Logitech Media Server v7.4+) software. It complements the Boom, Duet, Transporter, Squeezebox and Slimp3 hardware music players developed by Slim Devices.\n\n\nSupports synchronization with hardware players and remote streaming over the Internet using ssh tunneling.\n\n\nDeveloped in Java, allowing this useful application to work with Windows PCs, OS X and Unix systems.\n\n\nEmulates most of the digital music players and uses the TCP based slim protocol, allowing use across the Internet and through firewalls/NAT routers.\n\n\n#####Features:\n+ Audio Playback\n\tNative playback of Flac, MP3, WAV and AIFF audio.\n\tSupport for Ogg Vorbis, WMA and AAC by transcoding in SqueezeCenter.\n\tGapless playback for most audio formats.\n\tSynchronization with Squeezebox2, Squeezebox and Slimp3 (requires Java 1.5)\n\tPause, volume control and mute buttons.\n\tSupports Windows Direct Sound on a Windows PC.\n\n\n+ Squeezebox2 Graphics Support\n\tEmulation of the new 320x32 graphic display.\n\tFull support for all Squeezebox fonts.\n\tSpectrum Analyzer, VU meters.\n\n+ Skins\n\tSlim Devices skin with horizontal or vertical remotes.\n\tExcession and Excession Large skins.\n\tLCD skin, designed for use on laptop computers.\n\tQuick link to slim server web interface\n\tWindow snapping\n\tAlso supports headless operation\n+ Music search and playlist editor\n\n\n+ Emulation of Slim IR Remote control\n\tButton auto repeat (for example press and hold pause stop's the player)\n\tKeyboard shortcuts for common remote control functions (uses the same keys as winamp and xmms).\n+ Slim Protocol\n\tSupports Slim Server version 6.0 upwards.\n\tSupport for password encrypted servers.\n\tAuto reconnection to Slim Server when connection is lost.\n\tBuilt-in ssh tunneling support for remote connections.\n\tSlim server discovery.\n\nThere are versions of softsqueeze for OS X, Android, and iPhone. Together with Logitech Media Server you can control music playback to all your devices.\n\n\"choco install logitech-media-server\" to install the server software.\n\n####PACKAGING NOTES: This will download the program and make an icon on your desktop. It does not actually \"install.\"  Version 3.9b2 02-24-2011 (latest - no final release)", "updated": "2024-03-15T08:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/softsqueeze/3.9.20161009", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/softsqueeze/3.9.20161009", "licenseUrl": "https://sourceforge.net/directory/os:windows/license:gpl/", "packageName": "softsqueeze", "displayName": "softsqueeze", "summary": "A software implementation of the Squeezebox.", "version": "3.9.20161009", "icon": "http://softsqueeze.sourceforge.net/softsqueeze.png", "author": "Richard Titmuss", "downloadCount": 1500, "tags": ["softsqueeze", "logitech", "music", "server", "slim", "slimserver", "squeezebox", "player", "admin"]}