{"description": "---\n\n### [choco://solarwinds-backup-manager](choco://solarwinds-backup-manager)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of SolarWinds Recovery Console](https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/solarwinds-recovery-console/solarwinds-recovery-console_screenshot.png)\t\n\n### Protect Your Users’ Data with Sophisticated Backup and Rapid Disaster Recovery\n\nData loss can cause serious financial hardships for a company, and system downtime can cripple productivity, preventing a business from providing good service to customers. That’s why it’s critical to be prepared with the right technology.\n\nSolarWinds® Remote Monitoring & Management provides a hybrid cloud backup and disaster recovery feature, allowing you to help quickly restore business continuity after a disaster. Our True Delta™ technology helps to reduce backup times by storing changes instead of full files. This allows you to back up files quickly and frequently, helping you to prevent losing data due to a disaster. The backup and recovery feature also uses strong encryption both in transit and at rest, so you can breathe more easily knowing that data is kept safe.\n\n### Experience the Hybrid Cloud\n\n* **Best of both worlds:** Leverage a hybrid cloud architecture that gives you the control and speed of on-premises backup combined with the convenience and added redundancy of a cloud-based approach.\n* **Back up a number of devices at almost any level:** Back up everything, including workstations, servers, and even virtual machines and servers. Additionally, backups can be set for anything from individual files to applications all the way to full systems.\n\n### Back Up Fast, Recover Fast\n\n* **Fast backup:** Take advantage of our True Delta technology, which backs up changes rather than full files. This helps to reduce the time it takes to run the backup process, allowing you to back up more frequently.\n* **Fast recovery:** Get rapid recovery after a disaster using our hybrid cloud architecture that restores from either cloud-based or local copies—whichever is faster.\n* **Bare metal recovery:** Restore to a bare metal state using nothing more than a bootable USB drive or CD-ROM.\n* **Automatic updates:** Remote Monitoring & Management can automatically update a standby virtual server after the completion of each live server backup.\n* **Minimum resource usage:** All backups and restores are lightweight, keeping resource drain to a minimum.\n* **Bandwidth throttling:** Restrict upload and download bandwidth during a user-defined backup window.\n* **Standby image backup:** Automatically create a local .VHD/X file of your backup selections during each scheduled backup.\n\n### Leverage Enterprise-Grade Features\n\n* **Virtual machine support:** Back up your virtual environments with host-level VMware® and Hyper-V® backups. You can restore to an existing or alternate virtual environment.\n* **Ultra secure:** Leverage AES 256 or 448-bit Blowfish encryption to help with keeping data safe on-premises, during transfers, and in the cloud.\n* **Private keys:** Data can be accessed only by someone holding a private key.\n* **Secure data centers:** Store your data in one of our global data centers, each of which are SSAE-compliant or ISO-certified.\n* **Data archiving:** Choose how long you want to retain backup copies, allowing you to keep specific datasets and backups indefinitely. \n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/solarwinds-backup-manager/readme.md)**\n    \n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-20T23:33:50Z", "galleryUrl": "https://community.chocolatey.org/packages/solarwinds-backup-manager/20.7.0.20181", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/solarwinds-backup-manager/20.7.0.20181", "licenseUrl": "https://solarwindsmsp.com/legal/solarwinds-msp-software-services-agreement", "packageName": "solarwinds-backup-manager", "displayName": "SolarWinds Backup Manager (Install)", "summary": "Protect Your Users’ Data with Sophisticated Backup and Rapid Disaster Recovery", "version": "20.7.0.20181", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/solarwinds-backup-manager/solarwinds-backup-manager_icon.png", "author": "SolarWinds MSP", "downloadCount": 52979, "tags": ["solarwinds", "solarwindsmsp", "msp", "backup", "manager"]}