{"description": "---\n\n### [choco://solarwinds-take-control-viewer](choco://solarwinds-take-control-viewer)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of SolarWinds Take Control Viewer](https://gfimaxstatus.files.wordpress.com/2019/01/whole_viewer.png?w=640)\t\n\n### Take Control and Resolve Issues Efficiently with Lightning-Fast Remote Support\n\nWhen users have technical issues that require your expert attention, your remote access tools should enable you to get the job done quickly and easily. The remote control features in SolarWinds® Remote Monitoring & Management give you one-click access to any endpoint under management in as few as five seconds. And with the ability for technicians to chat on the back end or pass sessions between team members, Remote Monitoring & Management makes it easy for IT teams to collaborate to solve even the thorniest technical challenges.\n\n### Provide Outstanding Unattended Support\n* Rapid connections: Quickly connect to any machine in your managed networks with one click.\n* Session transfers: Transfer sessions to other technicians if you need to take a break, or if you need to pass the issue to someone with a different expertise\n* Chat: Open a live chat window with end users if questions arise while you fix their workstation.\n\n### Fix Issues Fast with Powerful Diagnostic Tools\n\n* File transfers: Remotely upload files, including scripts, to users’ systems without disturbing them as they work.\n* Remote command line: Use the bash shell to solve issues from afar and even issue PowerShell® commands.\n* System preferences: Open the system controls in the background to diagnose computer or network issues, review or kill processes, and more.\n\n### Monitor Quality and Keep Your Environment Secure\n\n* User management: Assign technicians to specific worksites or departments, and set up permissions to help ensure proper security. \n* Session recordings: Record any support session you want, so you can review later for quality control or troubleshooting. \n* Chat transcripts: Review historical chat transcripts broken down by end user or technician.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/solarwinds-take-control-viewer/readme.md)**\n\n**NOTE: This package will be deprecated and replaced with nable-take-control-viewer**\n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-21T11:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/solarwinds-take-control-viewer/7.50.2.20230914", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/solarwinds-take-control-viewer/7.50.2.20230914", "licenseUrl": "https://www.n-able.com/legal/software-services-agreement", "packageName": "solarwinds-take-control-viewer", "displayName": "N-able Take Control Viewer (Install)", "summary": "Take Control is a remote management tool.", "version": "7.50.2.20230914", "icon": "https://cdn.jsdelivr.net/gh/bcurran3/ChocolateyPackages/solarwinds-take-control-viewer/solarwinds-take-control-viewer_icon.png", "author": "N-able", "downloadCount": 1849, "tags": ["solarwinds", "solarwindsmsp", "nable", "remote", "take", "control", "support", "tool"]}