{"description": "***\n[choco://solarwinds-automation-manager](choco://solarwinds-automation-manager)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n***\n\n![Screenshot of Automation Manager](https://www.solarwindsmsp.com/sites/solarwindsmsp/files/2017-09/ncentral-automation-manager.jpg)\t\n\n### Get More Done with Automation without Learning a New Scripting Language\n\nAs an IT service provider, you know the dramatic difference that automation can make for your business. Yet, many IT service management software platforms offer the bare minimum when it comes to automation and often require you to learn complex scripting languages.\n\nAutomation Manager from SolarWinds MSP gives you the power to go beyond simple automation, allowing you to create processes for nearly everything. With our drag-and-drop editor, you can set up sophisticated automated tasks without having to learn complicated scripting languages or proprietary code. With over 100 common tasks ready to go out of the box and more than 600 elements to choose from when building your tasks, it helps make it easier to take on more clients, service larger and more complex environments, and scale your business fast. Whether you want to speed up the onboarding process for new clients or create automatic remediation steps in case a check fails, SolarWinds N-central® Automation Manager has you covered.\n\n### Boost Effectiveness\n\n* Helps efficiency: Complete lower-level repetitive tasks on autopilot, freeing technicians to take on more work or focus on higher-value activities.\n* Self-healing: Set up automatic fixes for problem scenarios such as an application failing. This allows you to fix problems quickly, often before customers know about them.\n* Detailed reporting: View detailed reports on automated steps taken by the system. For example, if the system fixes a server outage, the reports help you uncover the failure's root cause.\n* Automated onboarding: Create tasks to automatically set up and configure new endpoints, servers, or other devices on customers’ networks.\n\n### Customize Nearly Anything\n\n* Drag and drop: Automate tasks using our drag-and-drop editor. This feature allows team members, even those with little or no coding experience, to create sophisticated automation scripts without writing any code.\n* Prewritten policies: Select from over 100 prewritten automated tasks to run out of the box. Additionally, you can use these prewritten policies as a basis for creating new, tailored automated policies.\n* Integration with other scripting languages: Import your own PowerShell, Visual Basic, and Bash scripts if you prefer to write your own code.\n* Complete control: Create and apply complex automation rules to a group of devices with just a few clicks, helping to save you time and allowing you to deliver complex services with less effort.\n\n### Sample Automation Tasks\n\n* Discovering and importing new devices\n* Configuring monitoring and notifications\n* Installing tools\n* Approving patches configuration and approval\n* Deploying, configuring, and updating antivirus\n* Configuring backup configuration\n* Responding to alerts\n* Running recurring maintenance tasks\n* Reporting\n* Creating tickets\n* Adjusting billing\n\nAnd this is just a short sample.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/solarwinds-automation-manager/readme.md)**\n\nNOTE: This will be deprecated and replaced with nable-automation-manager\n\n***\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n***", "updated": "2024-03-09T21:18:22Z", "galleryUrl": "https://community.chocolatey.org/packages/solarwinds-automation-manager/2.20.0.17", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/solarwinds-automation-manager/2.20.0.17", "licenseUrl": "https://www.n-able.com/legal/software-services-agreement", "packageName": "solarwinds-automation-manager", "displayName": "SolarWinds Automation Manager (Install)", "summary": "Get More Done with Automation without Learning a New Scripting Language", "version": "2.20.0.17", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/solarwinds-automation-manager/solarwinds-automation-manager_icon.png", "author": "N-able", "downloadCount": 883, "tags": ["solarwinds", "solarwindsmsp", "nable", "msp", "automation", "manager"]}