{"description": "With Soluto you can discover more about your device, what takes up space, what drains your battery, which apps are recommended for you and much more. You can locate your device if it's lost, secure your phone for safe browsing with anti-virus, back up your device so your data will always be safe and more.\n\nSoluto is a program that requires an internet connection to report various system properties, events, and metrics to a web service at [Soluto.com](https://www.soluto.com/). Soluto.com analyzes this data per device and anonymously integrates the data with other users to help provide useful reporting information.\n\nSoluto can provide additional remote management and reporting features by creating an online account at Soluto.com. By running Soluto on multiple devices and linking them to an account on Soluto.com multiple devices may be consolidated for easier management.\n\n### Features\n\n#### Asset Management\n* PC inventory, hardware details, OSs\n* PC age, strength\n* PC performance, power consumption\n\n#### Alerts\n* Actionable emails that let you know when PCs need your attention and why. Automatically detects whenever users are frustrated by slowness or app crashes.\n* App updates, shorten boot, windows updates.\n* One-click actions directly from notification emails - No need for a remote access session.\n* Real-time alerts about hardware issues\n\n#### Remote access\n* Access PCs from any web browser from your account at Soluto.com\n\n#### Freeware\n* Soluto may be used for free on devices with or without an associated online registered account.\n* [Online accounts](https://www.soluto.com/signup) are free for usage with up to 3 devices and limited remote sessions.\n* Additional devices can be managed with a [paid subscription](https://www.soluto.com/business/pricing).\n\n[FAQ](https://www.soluto.com/contact-us/faqs)\n[User Support](https://support.soluto.com)", "updated": "2024-03-19T12:33:32Z", "galleryUrl": "https://community.chocolatey.org/packages/soluto/1.3.1497.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/soluto/1.3.1497.1", "licenseUrl": "https://www.soluto.com/legal/terms-of-use", "packageName": "soluto", "displayName": "Soluto", "summary": "All-in-one support and digital protection service", "version": "1.3.1497.1", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/55ce3c2643c3292374f558f3f37e23c17ed29d82/icons/soluto.png", "author": "Soluto", "downloadCount": 1053, "tags": ["debug", "asset-management", "alert", "remote", "startup", "freeware"]}