{"description": "SpaceMonger is a tool for keeping track of the free space on your computer. Each file or folder on a given drive is displayed in a box in the main window whose size is a relative comparison to all the other files in your system. So, for example, if the \"Windows\" box takes up 90% of the screen, the \"C:\\Windows\" folder and all its sub-folders and files are taking up 90% of your \"C:\" drive.\n\n        SpaceMonger is not a terribly complicated program to use, so the current version doesn't come with a user's manual. At the bottom of this page you can find a few helpful instructions for using it if you need them.\n        \n        First-Time Instructions\n        When you first use SpaceMonger, follow these instructions if you don't know what to do:\n\n        When you first open it, you will initially be presented with a blank window. Click \"Open\".\n        Click on a drive, like drive \"C\", and hit \"OK\".\n        Wait patiently while the program collects statistics on your drive. My, don't you have a lot of files!\n        SpaceMonger will then show you the contents of your drive as little rectangles. The larger the rectangle, the more space something is taking up. In the screen-shot on this page, above, which you can click to enlarge, \"Windows\" is taking up a full 20% of this drive.\n\n        Rectangles that have other rectangles in them are folders. Rectangles with no other rectangles in them are files. Colors are used to show how deeply the files and folders are nested.\n\n        You can get more information on a given folder by clicking on its title and then clicking \"Zoom In\" (or by double-clicking on its title). The window will change to show a larger, more detailed view of the folder and its files. You can zoom in as many times as you want. \"Zoom Out\" will take you back out (up) by one folder. \"Zoom Full\" will take you all the way back to show the whole drive.\n\n        If you see files or folders you want to delete, click them and hit \"Delete\". They will be moved to the Recycle Bin. If you want to see what they are first, click on them and hit \"Run or Open\", which will try to run them if they are programs or open them if they are files.\n\n        If you click the \"Setup\" button, you can change some aesthetic things about the program. You can't damage anything with the Setup dialog box, so feel free to try various options until you like how SpaceMonger looks and feels.", "updated": "2024-03-23T01:33:27Z", "galleryUrl": "https://community.chocolatey.org/packages/spacemonger.portable/1.4.0.20220808", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/spacemonger.portable/1.4.0.20220808", "licenseUrl": "https://web.archive.org/web/20210514203238/http://www.aplusfreeware.com/categories/LFWV/SpaceMonger.html", "packageName": "spacemonger.portable", "displayName": "SpaceMonger (Portable)", "summary": "SpaceMonger is a tool for keeping track of the free space on your computer.", "version": "1.4.0.20220808", "icon": "https://i.imgur.com/jzap5p0.png", "author": "Sean Werkema", "downloadCount": 1633, "tags": ["spacemonger"]}