{"description": "# SpatialOS: Build worlds where everything matters.\n\nSpatialOS is a computation platform that allows you to exceed the power of a single game engine or server.\n\n## Code Beyond Server Boundaries\nSpatialOS can create a swarm of hundreds of conventional game engines that overlap together to create a huge, seamless world. Develop unconstrained by the computational and concurrent player limits of a single engine.\n\n## Grow a Persistent World\nA SpatialOS world can contain millions of persistent entities and manage their state and history. Design gameplay that allows players to affect the world in meaningful, long-lasting ways.\n\n## Deploy Fast, Iterate Fast\nUse just a few CLI commands to run your world on the SpatialOS Platform, then instantly share with players. SpatialOS handles all infrastructure management and data synchronization for you, greatly increasing the speed at which you can build and grow your online world.\n\n## `spatial` toolbelt\n\nThe `spatial` toolbelt is a command line toolchain that allows you to build and manage your SpatialOS simulations locally and in the cloud.\n\nNote: `spatial` toolbelt has its own internal update mechanism. This package just bootstraps the toolbelt onto your computer.\n\n## SpatialOS SDK\n\nThe SDK has a number of dependencies on things like a JDK and Unity being installed. Once you have installed spatial you can set those up via spatial setup install-dependencies --version {SDK version}.\n\n## Package parameters\n\nSupply like `--params=\"/option:'value' ...\"` ([see docs for --params](https://github.com/chocolatey/choco/wiki/CommandsInstall#options-and-switches))\n\n* `cliStructureVersion` (optional, defaults to `v2`) - The `cliStructureVersion` that you're intending to use. This affects the layout of commands within the toolbelt. There should be no reason to set this other than to try out new versions ahead of their being generally released.\n  You can change this later via `spatial config set cli-structure {version}`.\n  You can get the current value via `spatial config get cli-structure`.\n* `region` (optional, defaults to `west`) - The `region` you want to download spatialOS CLI from. The available options are `west` and `china`.", "updated": "2024-03-22T09:48:41Z", "galleryUrl": "https://community.chocolatey.org/packages/spatial/1.1.10", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/spatial/1.1.10", "licenseUrl": "https://spatialos.improbable.io/get-spatialos/eula", "packageName": "spatial", "displayName": "spatial (Install)", "summary": "Toolbelt for SpatialOS", "version": "1.1.10", "icon": "https://storage.googleapis.com/improbable-static/chocolatey-icons/Spatial 100px.png", "author": "Improbable Worlds Ltd", "downloadCount": 11928, "tags": ["spatialos", "simulation", "world", "spatial"]}