{"description": "Sphinx is a tool that makes it easy to create intelligent and beautiful documentation, written by Georg Brandl and licensed under the BSD license.\n\nIt was originally created for the Python documentation, and it has excellent facilities for the documentation of software projects in a range of languages. Of course, this site is also created from reStructuredText sources using Sphinx!\n\n## Features\n\n* **Output formats:**  HTML (including Windows HTML Help), LaTeX (for printable PDF versions), ePub, Texinfo, manual pages, plain text.\n* **Extensive cross-references:** semantic markup and automatic links for functions, classes, citations, glossary terms and similar pieces of information.\n* **Hierarchical structure:** easy definition of a document tree, with automatic links to siblings, parents and children\n* **Automatic indices:** general index as well as a language-specific module indices.\n* **Code handling:** automatic highlighting using the [Pygments](http://pygments.org/) highlighter.\n* **Extensions:** automatic testing of code snippets, inclusion of docstrings from Python modules (API docs), and [more](https://www.sphinx-doc.org/en/master/ext/builtins.html#builtin-sphinx-extensions).\n* **Contributed extensions:** more than 50 extensions [contributed by users](https://www.sphinx-doc.org/en/master/develop.html#extensions) in a second repository; most of them installable from PyPI", "updated": "2024-03-23T21:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/sphinx/7.2.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sphinx/7.2.5", "licenseUrl": "https://github.com/sphinx-doc/sphinx/blob/master/LICENSE", "packageName": "sphinx", "displayName": "Sphinx", "summary": "Sphinx is a tool that makes it easy to create intelligent and beautiful documentation for Python projects (or other documents consisting of multiple reStructuredText sources)", "version": "7.2.5", "icon": "https://cdn.jsdelivr.net/gh/naveen521kk/au-packages/icons/sphinx.png", "author": "Georg Brandl", "downloadCount": 17248, "tags": ["sphinx", "reStructuredText", "markdown", "documentation", "foss", "cross-platform", "cli"]}