{"description": "# Spin\nSpin is a widely used open-source software verification tool. The tool can be used for the formal verification of multi-threaded software applications. The tool was developed at [Bell Labs](https://www.bell-labs.com) in the Unix group of the Computing Sciences Research Center, starting in 1980, and has been available freely since 1991. Spin continues to evolve to keep pace with new developments in the field. In April 2002 the tool was awarded the ACM [System Software Award](https://awards.acm.org/software_system).\t\n\n## Main usage\nSpin can be used in four main modes:\n* as a simulator, allowing for rapid prototyping with a random, guided, or interactive simulations\n* as an exhaustive verifier, capable of rigorously proving the validity of user specified correctness requirements (using partial order reduction theory to optimize the search)\n* as proof approximation system that can validate even very large system models with maximal coverage of the state space.\n* as a driver for swarm verification (a new form of swarm computing that can exploit cloud networks of arbitrary size), which can make optimal use of large numbers of available compute cores to leverage parallelism and search diversification techniques, which increases the chance of locating defects in very large verification models.\n\n\nAll Spin software is written in ISO-standard C, and is portable across all versions of Unix, Linux, cygwin, Plan9, Inferno, Solaris, Mac, and Windows.\n\n## Dependencies and related software\nTo run Spin, you need a working C-compiler and a C-preprocessor, because Spin generates its model checking software as C-source files that require compilation before a verification can be performed. This guarantees fast model checking, because each model checker can be optimized to the specific model being checked. For more information see [Related software](http://spinroot.com/spin/Man/README.html#S3).\n\n## Installation Parameters\n* `/AddiSpinToStartMenu:` - adds iSpin shortcut to Start menu (for all users or for the current user only)\n    - Supported values: `allusers`, `curruser`\n    - No shortcut added to Start menu by default\n* `/CreateiSpinDesktopIcon` - creates a desktop shortcut for iSpin\n    - Not created by default\n\n### Examples\n* Install and add iSpin shortcut to Start menu for all users\n    ```\n    choco install spin --params \"/AddiSpinToStartMenu:allusers\"\n    ```\n* Install, create iSpin desktop shortcut and add iSpin shortcut to Start menu for the current user\n    ```\n    choco install spin --params \"'/AddiSpinToStartMenu:curruser /CreateiSpinDesktopIcon'\"\n    ```", "updated": "2024-03-15T10:33:25Z", "galleryUrl": "https://community.chocolatey.org/packages/spin/6.5.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/spin/6.5.1", "licenseUrl": "https://github.com/nimble-code/Spin/blob/master/LICENSE", "packageName": "spin", "displayName": "Spin", "summary": "SPIN is a state-of-the-art open-source software verification tool.", "version": "6.5.1", "icon": "https://cdn.jsdelivr.net/gh/jakublevy/chocopkgs/icons/spin.png", "author": "Gerard Holzmann", "downloadCount": 2106, "tags": ["formal", "verification", "verify", "model-checker", "commandline", "cross-platform"]}