{"description": "Spyware, adware, browser hijackers, and dialers are some of the most annoying and pervasive threats on the Internet today. By simply browsing a web page, you could find your computer to be the brand-new host of one of these unwanted fiends!\n\nThe most important step you can take is to secure your system. And SpywareBlaster is the most powerful protection program available.\n\n## Multi-Angle Protection\n\n- Prevent the installation of ActiveX-based spyware and other potentially unwanted programs.\n- Block spying / tracking via cookies.\n- Restrict the actions of potentially unwanted or dangerous web sites.\n\n## No-Nonsense Security\n\nSpywareBlaster can help keep your system secure, without interfering with the \"good side\" of the web. And unlike other programs, SpywareBlaster does not have to remain running in the background. It works alongside the programs you have to help secure your system.\n\n## Package Parameters\n\n- `/UseInf:` - Use the specified configuration file to when installing (will be created if it does not exist)\n\n**EXAMPLE**\n`choco install spywareblaster --params \"'/UseInf:C:\\spywareblaster.install.inf'\"`\n\n## Notes\n\n- This package uses the free edition of SpywareBlaster and can only be used for personal & educational purposes.\n- There is a problem if the installation directory already exist with a prompt being shown asking wether to really install to the directory or not. Any help for getting around this would be appreciated.", "updated": "2024-03-21T04:48:29Z", "galleryUrl": "https://community.chocolatey.org/packages/SpywareBlaster/5.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/SpywareBlaster/5.6", "licenseUrl": "https://www.brightfort.com/sbnv/licenseagreement.html", "packageName": "SpywareBlaster", "displayName": "SpywareBlaster", "summary": "Keep your system secure, without interfering with the \"good side\" of the web.", "version": "5.6", "icon": "https://cdn.jsdelivr.net/gh/AdmiringWorm/chocolatey-packages@ce5b94c36d002e69d93d44283712e5645f87d860/automatic/spywareblaster/icons/spywareblaster.png", "author": "BrightFort LLC", "downloadCount": 3544, "tags": ["sypwareblaster", "security", "protection", "prevention"]}