{"description": "Whether your data is structured or unstructured, query and analyze it using the data platform with industry-leading performance and security.\n\n### What you'll love about SQL Server 2019\n\n#### Analyze every type of data\n\nGain insights from all your data by querying across relational, non-relational, structured, and unstructured data, for a complete picture of your business using SQL Server 2019 with Apache Spark built in.\n\n#### Choose your language and platform\n\nGet the flexibility to use the language and platform of your choice with open source support. Run SQL Server on Linux containers with Kubernetes support or on Windows.\n\n#### Rely on industry-leading performance\n\nTake advantage of breakthrough scalability and performance to improve the stability and response time of your database—without making app changes. Get high availability for mission-critical applications, data warehouses, and data lakes.\n\n#### Trust nine years of proven security leadership\n\nAchieve your security and compliance goals using the database rated as least vulnerable over the last nine years. Stay a step ahead using built-in features for data classification, data protection, and monitoring and alerts [1].\n\n#### Make faster, better decisions\n\nTurn data into answers using the enterprise reporting capabilities of SQL Server Reporting Services along with the included Power BI Report Server, which gives your users access to rich, interactive Power BI reports on any device.\n\n### Operating System requirements for SQL Server Developer\n\n- Windows 10 TH1 1507 or greater\n- Windows Server 2016 or greater\n\n### Package Specific\n\n#### Package notes\n\nThis package will install SQL Server 2019 Developer Edition using an existing .iso file. If a path to an existing .iso is not supplied, it downloads the same .iso that can be obtained from the [SQL Server Basic Installer](https://go.microsoft.com/fwlink/?linkid=853016)'s *Download Media* menu.\n\nThe initial release of this package is focused on installing and uninstalling a default instance of SQL Server 2019 Developer Edition.\n\nFuture plans include better support for non-default instances (including uninstalling).\n\nNote that the install script makes use of `Mount-DiskImage` as the minimum OS requirements for SQL Server include this cmdlet.\n\n#### Package Parameters\n\nThe following package parameters can be set:\n\n- `/IsoPath:` - path to a local copy of the .iso file - if not supplied then .iso is downloaded\n- `/IgnorePendingReboot` - don't check for pending reboot (Warning, SQL Server installation may fail if reboots are pending)\n\nAll other package parameters are passed through to SQL Server Setup, allowing you to customise the installation as necessary.\n\nThe following are set by default:\n\n- `/ConfigurationFile:` - The path to a configurationfile.ini - defaults to the supplied tools\\configurationfile.ini\n- `/SQLSYSADMINACCOUNTS:` - A username or group to add to the SQL SysAdmin role - defaults to current user. This option is only set if configurationfile.ini does not contain 'SQLSYSADMINACCOUNTS=' at the start of a line. \n\nSee https://docs.microsoft.com/en-us/sql/database-engine/install-windows/install-sql-server-from-the-command-prompt#Install for the full list of parameters supported by SQL Server.\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install sql-server-2019 [other options] --params=\"'/ITEM:value /ITEM2:value2'\"`).\n\nExample using /IsoPath to use previously downloaded SQL Server .iso\n\n```powershell\nchoco install sql-server-2019 --params=\"'/IsoPath:c:\\downloads\\SQLServer2019-x64-ENU-Dev.iso'\"\n```\n\n#### Chocolatey Pro / Business users\n\nIf you allow the package to download the ISO file, it is suggested you run Chocolatey with the `--skip-virus-check` parameter, as the online virus scanner doesn't handle files over 500MB. You should use alternate methods of scanning in this case.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/sql-server-2019/15.0.2000.20210324", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sql-server-2019/15.0.2000.20210324", "licenseUrl": "https://www.microsoft.com/en-us/sql-server/sql-server-2019-pricing", "packageName": "sql-server-2019", "displayName": "Microsoft SQL Server 2019 Developer Edition", "summary": "Apply intelligence across all your data with SQL Server 2019", "version": "15.0.2000.20210324", "icon": "https://rawcdn.githack.com/ferventcoder/chocolatey-packages/59ad5e2e32c52fd2a45a9735f95a81368f9e5e85/icons/microsoft-sql-server.svg", "author": "Microsoft Corporation", "downloadCount": 323270, "tags": ["SQL", "tSQL", "Relational", "Data", "Database"]}