{"description": "SQL Server Management Studio (SSMS) is an integrated environment for managing any SQL infrastructure, from SQL Server to Azure SQL Database. SSMS provides tools to configure, monitor, and administer instances of SQL Server and databases. Use SSMS to deploy, monitor, and upgrade the data-tier components used by your applications and build queries and scripts.\n\nThe SSMS 19.x installation doesn't upgrade or replace SSMS versions 18.x or earlier. SSMS 19.x installs alongside previous versions, so both versions are available for use.\n\nBeginning with SQL Server Management Studio (SSMS) 18.7, Azure Data Studio is automatically installed alongside SSMS. As a consequence of this, uninstalling this package will impact azure-data-studio if you had that package installed previously.\n\n#### Version Number\n\nThis package is versioned using the published build number. The corresponding 'release number' is included in the package title.\n\n#### Supported SQL offerings\n\n- This version of SSMS works with SQL Server 2014 and higher and provides the most significant level of support for working with the latest cloud features in Azure SQL Database and Azure Synapse Analytics.\n- Additionally, SSMS 19.x can be installed alongside with SSMS 18.x, SSMS 17.x, SSMS 16.x.\n- SQL Server Integration Services (SSIS) - SSMS version 17.x or later doesn't support connecting to the legacy SQL Server Integration Services service. To connect to an earlier version of the legacy Integration Services, use the version of SSMS aligned with the version of SQL Server. For example, use SSMS 16.x to connect to the legacy SQL Server 2016 Integration Services service. SSMS 17.x and SSMS 16.x can be installed side by side on the same computer. Since the release of SQL Server 2012, the SSIS Catalog database, SSISDB, is the recommended way to store, manage, run, and monitor Integration Services packages. For details, see [SSIS Catalog](https://docs.microsoft.com/en-us/sql/integration-services/catalog/ssis-catalog?view=sql-server-ver15).\n#### SSMS System Requirements\n\nThe current release of SSMS supports the following 64-bit platforms when used with the latest available service pack:\n\nSupported Operating Systems:\n\n- Windows 11 (64-bit)\n- Windows 10 (64-bit) version 1607 (10.0.14393) or later\n- Windows Server 2022 (64-bit)\n- Windows Server 2019 (64-bit)\n- Windows Server 2016 (64-bit)\n\n### Package Specific\n\n\n#### Upgrading from 18.x to 19.x\n\nAs mentioned above, SSMS 19.x doesn't upgrade 18.x but will install side by side. If you don't wish to keep 18.x then you should run `choco uninstall sql-server-management-studio` prior to installing the latest version of this package.\n\n#### Package Parameters\n\n- `SSMSExePath:PathToFile` - Use this installer exe instead of downloading\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install packageID [other options] --params=\"'/ITEM:value /ITEM2:value2 /FLAG_BOOLEAN'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\nExample:\n`choco install sql-server-management-studio --params \"'/SSMSExePath:c:\\Downloads\\SSMS-Setup-ENU.exe'\"`\n\n#### Package Updates\n\nThis package is automatically updated based on the same data source that SSMS itself uses to determine when updates are available. This may mean that there may sometimes be a delay between Microsoft releasing a new version and when they 'advertise' it as being generally available for SSMS to update.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/sql-server-management-studio/20.0.70", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sql-server-management-studio/20.0.70", "licenseUrl": "https://docs.microsoft.com/en-us/sql/ssms/sql-server-management-studio-license-terms", "packageName": "sql-server-management-studio", "displayName": "SQL Server Management Studio 20.0", "summary": "SQL Server Management Studio (SSMS) is an integrated environment for accessing, configuring, managing, administering, and developing all components of SQL Server", "version": "20.0.70", "icon": "https://rawcdn.githack.com/flcdrg/au-packages/ed266b63ad6adb86d35c355a86ba1ca74fe674d2/sql-server-management-studio/icons/ssms-icon.png", "author": "Microsoft", "downloadCount": 2914065, "tags": ["sql", "server", "management", "studio", "ssms", "admin"]}