{"description": "SQL Server 2022 Express is a free edition of SQL Server, ideal for development and production for desktop, web, and small server applications.\n\nSQL Server 2022 (16.x) Express edition is the entry-level, free database and is ideal for learning and building desktop and small server data-driven applications. It is the best choice for independent software vendors, developers, and hobbyists building client applications. If you need more advanced database features, SQL Server Express can be seamlessly upgraded to other higher end versions of SQL Server. SQL Server Express LocalDB is a lightweight version of Express that has all of its programmability features, runs in user mode and has a fast, zero-configuration installation and a short list of prerequisites.\n\nExperience the full feature set of SQL Server Express. This package contains the Database Engine, Reporting Services, and Full Text Search features.\n\n### Package Specific\n\nBe aware that the way SQL Express is installed by this package does not allow for upgrades between major versions of SQL Server.\n\nA workaround would be to uninstall the existing version and then install the latest version, then manually reattach any databases.", "updated": "2024-03-23T14:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/sql-server-express-adv/16.0.1000.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sql-server-express-adv/16.0.1000.6", "licenseUrl": "https://www.microsoft.com/en-us/sql-server/sql-server-2022-pricing", "packageName": "sql-server-express-adv", "displayName": "Microsoft SQL Server 2022 Express with Advanced Services", "summary": "Installs SQL Server 2022 Express Advanced database engine.", "version": "16.0.1000.6", "icon": "https://rawcdn.githack.com/ferventcoder/chocolatey-packages/59ad5e2e32c52fd2a45a9735f95a81368f9e5e85/icons/microsoft-sql-server.svg", "author": "Microsoft", "downloadCount": 527, "tags": ["sql", "server", "express", "admin", "2022"]}