{"description": "SQLite Analyzer is a command-line utility program that measures and displays how much and how efficiently space is used\nby individual tables and indexes with an SQLite database file.\n\nThe `sqlite3_analyzer.exe` binary is a command-line utility program that measures and displays how much and how\nefficiently space is used by individual tables and indexes with an SQLite database file. Example usage:\n\n```posh\nsqlite3_analyzer database.sqlite\n```\n\nThe output is a human-readable ASCII text report that provides information on the space utilization of the database\nfile. The report is intended to be self-explanatory, though there is some additional explanation of the various\nparameters reported toward the end of the report.\n\nThe output is also valid SQL. Most of the report text is contained within a header comment, with various SQL statements\nthat create and initialize a database at the end of the report.\n\nThe constructed database contains the raw data from which the report was extracted. Hence the original report can be\nread into an instance of the command-line shell and then the raw data can be queried to dig deeper into the space\nutilization of a particular database file.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@cfec165034cc237b21940613a9d68a4ee601edc2/automatic/sqlite.analyzer/screenshot.png)\n\n## Notes\n\n* The `sqlite3_analyzer.exe` program is a [TCL](http://www.tcl.tk/) program that uses the [dbstat virtual table](https://www.sqlite.org/dbstat.html)\n  to gather information about the database file and then format that information neatly.\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-21T21:04:04Z", "galleryUrl": "https://community.chocolatey.org/packages/sqlite.analyzer/3.43.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sqlite.analyzer/3.43.2", "licenseUrl": "http://www.sqlite.org/copyright.html", "packageName": "sqlite.analyzer", "displayName": "SQLite Analyzer", "summary": "A simple command-line utility for analyzing SQLite database space usage", "version": "3.43.2", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@35b12b29a0d812446e72152623467d25daf0d7c6/icons/sqlite.png", "author": "D. Richard Hipp,  SQLite contributors", "downloadCount": 22326, "tags": ["sqlite", "db", "database", "analyzer", "embedded", "hwaci"]}