{"description": "SQLite is a software library that implements a self-contained, serverless, zero-configuration, transactional SQL database engine.\n\nThis package also installs sqlite tools by default - sqldiff, sqlite3, sqlite3_analyzer.\n\n## Features\n\n- Transactions are atomic, consistent, isolated, and durable (ACID) even after system crashes and power failures.\n- Zero-configuration - no setup or administration needed.\n- Full-featured SQL implementation with advanced capabilities like partial indexes, indexes on expressions, JSON, and common table expressions. (Omitted features)\n- A complete database is stored in a single cross-platform disk file. Great for use as an application file format.\n- Supports terabyte-sized databases and gigabyte-sized strings and blobs. (See limits.html.)\n- Small code footprint: less than 500KiB fully configured or much less with optional features omitted.\n- Simple, easy to use API.\n- Written in ANSI-C. TCL bindings included. Bindings for dozens of other languages available separately.\n- Well-commented source code with 100% branch test coverage.\n- Available as a single ANSI-C source-code file that is easy to compile and hence is easy to add into a larger project.\n- Self-contained: no external dependencies.\n- Cross-platform: Android, *BSD, iOS, Linux, Mac, Solaris, VxWorks, and Windows (Win32, WinCE, WinRT) are supported out of the box. Easy to port to other systems.\n- Sources are in the public domain. Use for any purpose.\n- Comes with a standalone command-line interface (CLI) client that can be used to administer SQLite databases.\n\n## Package parameters\n\n- `/NoTools` - Do not install sqlite tools\n\nExample: `choco install sqlite --params \"/NoTools\"`", "updated": "2024-03-24T00:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/SQLite/3.43.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/SQLite/3.43.2", "licenseUrl": "http://www.sqlite.org/copyright.html", "packageName": "SQLite", "displayName": "SQLite", "summary": "A DLL for the SQLite SQL database engine installed in your user path.", "version": "3.43.2", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@edba4a5849ff756e767cba86641bea97ff5721fe/icons/sqlite.svg", "author": "D. Richard Hipp,  SQLite contributors", "downloadCount": 474738, "tags": ["sql", "sqlite", "db", "database", "embedded", "foss", "cross-platform"]}