{"description": "## Features\n- Validates the SSL certificate and validates all certificates in the chain for possible errors;\n- Implements certificate expiration checking. Certificate expiration is checked for all certificates in the chain;\n- The tool also checks certificates for all possible redirection URLs;\n- Writes trace/debug log for each processed entry;\n- Provides an ability to save server list to a file and read the list from a file.\n\n## Main Window\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/sslverifier/screenshot1.png)\n\nMain window contains a list of remote SSL/TLS servers and control buttons. There are three possible validation outcomes:\n\n- **Ok**\nClient was able to successfully connect to remote server over SSL/TLS and its certificate passed all validation checks based on current settings.\n\n- **Error**\nClient was either, not able to connect to remote server over SSL/TLS or its certificate failed certificate validation checks.\n\n- **Warning**\nClient was able to successfully connect to remote server over SSL/TLS and its certificate passed all validation checks, but its certificate is about to expire:\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/sslverifier/screenshot2.png)\n\nWhen selecting particular entry, a trace log with certificate details is shown. Right-click on remote server entry and selecting entry properties it is possible to configure proxy settings if necessary:\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/sslverifier/screenshot3.png)\n\n## Certificate View\nAdditionally, there is certificate view which is located under **Certificates** tab:\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/sslverifier/screenshot4.png)\n\nCertificate view dialog shows certificate chain and errors. Native errors shows potential issues with selected certificate itself. Propagated errors show potential issues propagated from upper level certificates (intermediate CA certificates). The following image shows errors associated with a certificate that failed validation checks:\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/sslverifier/screenshot5.png)\n\nBy pressing View Certificate button, a certificate UI dialog (provided by operating system) is shown.\n\n## Application Settings\nApplication contains several settings, which are invoked via **Options -> Settings**:\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/sslverifier/screenshot6.png)\n\nIn this dialog, you can configure some validation options:\n\n- **Strict EKU validation**\nWhen enabled, this option will require that entire certificate chain is valid for Server Authentication enhanced key usage. Otherwise, Server Authentication EKU is checked on leaf certificate only.\n\n- **Allow user trust**\nBy default, certificate chains are built against trusted root CA store in machine context (local computer). Manually added trusted root CAs in current user store are not trusted by default.\n\n- **Require minimum RSA public key length**\nEnforces RSA public key length which must be equals or greater than specified value. This settings has effect only on RSA public keys. ECC (ellyptic curve cryptography) key length is not enforced.\n\n- **Protocol list**\nSpecifies allowed SSL/TLS protocols. SSL Verifier Tool attempts to connect to remote server using the best protocol. If connection fails and there are other allowed protocols, they are attempted until connection succeeds or there are more allowed SSL/TLS protocols, otherwise, connection will fail.\n\n- **Invalidate weak signature algorithm**\nWhen enabled, specifies a set of disallowed signature algorithm for leaf and intermediate CA certificates. Signature algorithm list is not applied to root (presented in a self-signed form) are not checked.", "updated": "2024-03-22T14:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/sslverifier/1.5.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sslverifier/1.5.7", "licenseUrl": "https://raw.githubusercontent.com/Crypt32/SSLVerifier.WPF/master/LICENSE.md", "packageName": "sslverifier", "displayName": "SSL Certificate Verifier", "summary": "This is a WPF tool that allows to connect to remote web servers and examine SSL certificates.", "version": "1.5.7", "icon": "", "author": "Vadims Podāns", "downloadCount": 1882, "tags": ["sslverifier", "ssl", "certificate", "verifier", "WPF", "tool"]}