{"description": "Startup Organizer is a Windows 95/98/ME/NT/2000/XP/2003/Vista/7 program that was developed to provide quick access to all of the programs that are automatically started when you turn on or logon to your computer.\n\nUsing Startup Organizer, you can inspect, edit, print and/or temporarily disable such programs and make backup configurations.\n\nYou may significantly reduce the time required for your system startup by disabling programs that you don`t need all the time.\n\nWith RunOnceEx, Services and AutoRunDLL technology support, StartUp Organizer provides you with the most complete control on all methods to start programs automatically.\n\nThe **Controlled Startup** feature allows you to skip certain programs during startup if you hold the **[Shift]** key while Windows is logging on.\n\nThe new version allows you to choose the key for the Controlled Startup feature. It is also possible now to prompt for a confirmation of whether to start all or each program in the Controlled Startup.\n\n**StartUp Guard** detects non-standard ways to run applications when Windows starts and issues recommendations when it encounters suspicious programs.\n\nUsers of Windows NT 4.0/2000/XP/2003/Vista/2008 can benefit from the new ability to work with **other users startup configurations**. StartUp Organizer displays other users among your standard Registry, Controlled Startup and Start menu items. You can view programs of other users, edit them, add new ones and drag programs to them.\n\nYou can even **add programs to multiple users** with just a few clicks!\n\nYou can also define the **order** in which to run your programs and even set a **delay** when running them consecutively.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/startup-organizer/screenshot.png)", "updated": "2024-03-21T07:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/startup-organizer/2.9.324", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/startup-organizer/2.9.324", "licenseUrl": "https://metaproducts.com/products/startup-organizer", "packageName": "startup-organizer", "displayName": "Startup Organizer", "summary": "Startup Organizer was developed to provide quick access to all of the programs that are automatically started when you turn on or logon to your computer.", "version": "2.9.324", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/startup-organizer/startup-organizer.png", "author": "MetaProducts Systems.", "downloadCount": 513, "tags": ["startup-organizer", "startup", "organizer", "trial"]}