{"description": "The StatistiCALTM VNA Calibration Software Package is our newest VNA calibration software package.\n      It accommodates almost all coaxial and on-wafer standards, and enables a \"mix and match\" philosophy\n      to VNA calibration. The software is based on an algorithm developed at the U.S. National Institute of\n      Standards and Technology (NIST) and the Physikalisch-Technische Bundesanstalt (PTB) of Germany, which\n      is able to estimate the uncertainty of its own results due to random errors. The algorithm features a\n      high degree of robustness, allowing it to find solutions even with poor initial estimates.\n\n      The software combines a decade of experience in statistics and orthogonal distance regression with an\n      easy-to-use user interface. Research at NIST has extended the analysis of uncertainties caused by\n      random errors to include systematic errors in the solution. The uncertainties in the solution are represented\n      by a covariance matrix that relates errors in both the VNA calibration and measurements of the device\n      under test. In addition, the algorithm determines coverage factors based on the different numbers of\n      degrees of freedom associated with various parts of the solution.\n\n      Read a [paper](https://www.nist.gov/publications/optimal-vector-network-analyzer-calibration-algorithm)\n      describing the algorithms employed by this new software package. Read a\n      [paper](https://www.nist.gov/publications/optimal-multiline-trl-calibration-algorithm) comparing\n      this algorithm to MultiCal.  A password is no longer required to install this software.", "updated": "2024-03-13T15:33:50Z", "galleryUrl": "https://community.chocolatey.org/packages/statistiCAL/2.1.74", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/statistiCAL/2.1.74", "licenseUrl": "https://www.nist.gov/system/files/documents/2016/08/26/nistmeassoftware.pdf", "packageName": "statistiCAL", "displayName": "Statistical VNA Calibration Software Package", "summary": "VNA Calibration Software Package", "version": "2.1.74", "icon": "https://cdn.statically.io/gl/chocolatey-packages1/chocolatey-statistical/28cb7c/icons/StatistiCAL-logo.png", "author": "Dylan Williams", "downloadCount": 123, "tags": ["Statistical", "VNA", "Calibration"]}