{"description": "Academic Users:\n    If you work for academic, government, or non-profit institutions you may download and use this software for free. We only ask that you acknowledge the use of these programs in your published papers, talks, and reports. \n    We also ask that you reference the key scientific publications where the algorithms behind the programs are described. \n    Though we definitely want to hear about any bugs that you find, it is always really nice to hear from someone whose life was made a little easier by our software!\n\n    Commercial Users:\n    Restrictions on use vary by program and also based on the details of your usage scenario. Please contact Rick Allmendinger (or Néstor Cardozo for any programs on his site) for details.\n    Finally, if you find our programs to be useful in your commercial activity, don't you think you should be supporting our research efforts?\n\n    Stereonet 11 is a huge release with a completely new and robust internal data structure and an openGL 3D view of the lower hemisphere for teaching purposes. \n    It includes almost all of the goodness of Stereonet 10 and lots of subtle new tweaks as well (check out the detailed version history, below). \n    This version of Stereonet is compatible with all modern operating systems and has a modern user interface which has been modeled after OSXStereonet for Mac by Nestor Cardozo and me. \n    It can read and write older Stereonet text files, can read the Stereonet 11 binary files, but saves its data in a new binary format.", "updated": "2024-03-19T07:48:34Z", "galleryUrl": "https://community.chocolatey.org/packages/stereonet11/11.42.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/stereonet11/11.42.0", "licenseUrl": "", "packageName": "stereonet11", "displayName": "StereoNet 11", "summary": "Stereonet 11 is a huge release with a completely new and robust internal data structure and an openGL 3D view of the lower hemisphere for teaching purposes.", "version": "11.42.0", "icon": "https://rawcdn.githack.com/mrawesome139/chocolatey-packages/7efb1ae576a51700263de2136232274c7789d4d9/icons/stereonet.png", "author": "Richard W. Allmendinger", "downloadCount": 241, "tags": ["stereonet", "geology", "opengl", "3d", "plot"]}