{"description": "Studio is a desktop application that allows users to build LEGO models using virtual parts. Users will have the freedom to build whatever they want with any part they want. By being integrated with the BrickLink catalog, Studio can do things like showing you what part colors are unavailable and letting you keep track of part costs. Studio also makes it easy to turn a finished creation into a wanted list that you can use to order through BrickLink.\n\n![Batmobile](https://static.bricklink.com/renovate/img/studio-landing/1989-batmobile.gif)\n\n* **Intuitive and easy building** -- Watch as your bricks clutch, hinge, and clip to each other through our snap-to functionality. Compatible connections are detected, allowing you to assemble parts quickly.\n* **Convenient stability check** -- Make sure your designs are stable prior to having them in person. Studio 2.0 offers physical stability check to help you build more stable designs. \n* **Photorealistic rederer** -- When your designs need that icing on the cake, the photorealistic renderer will export breathtaking, exceptional quality images for your creations. With just a few clicks, your designs never looked more vivid.\n* **Integrated instructions maker** -- Creating building instructions just got easier! Studio 2.0 offers an in-app instructions maker that helps you create custom instructions for your designs. From editing steps to designing pages, you can do it all.\n* **Integrated with BrickLink** -- Studio 2.0 supports direct integration with BrickLink’s catalog, marketplace, and gallery. You can check parts information, order your designs, and browse others’ designs to get inspired.", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/studio/2.24.2.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/studio/2.24.2.1", "licenseUrl": "https://raw.githubusercontent.com/teknowledgist/Chocolatey-packages/master/automatic/studio/LICENSE.txt", "packageName": "studio", "displayName": "Studio 2.0", "summary": "Build, render and create instructions for snap-together bricks.", "version": "2.24.2.1", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@8788db964b96f8b059ddd7f8d47bd5eccef591e2/Icons/studio_icon.png", "author": "BrickLink Corporation", "downloadCount": 16755, "tags": ["studio", "studio2", "bricklink", "lego", "blocks", "build", "plan", "model", "render"]}