{"description": "___Meet a new Git Client, from the makers of Sublime Text.___\n\nA snappy UI, three-way merge tool,\nside-by-side diffs, syntax highlighting, and more. Evaluate for free – no account, tracking, or time limits.\nInterested? Read the [release announcement](https://www.sublimetext.com/blog/articles/sublime-merge).\n\n## Feature Highlights\n### INTEGRATED MERGE TOOL\nThe Integrated Merge Tool allows you to resolve any merge conflicts directly in Sublime Merge, rather than having to open up your editor of choice.\n\nConflicts are presented with a 3-pane view. On the left are your changes and on the right are theirs. In the center pane is the resolved text, with buttons to choose between your changes or theirs. The same text editing functionality as Sublime Text is also available for more complicated merges.\n\nClicking on the header in the middle pane will switch between the editable merge results and the base file.\n\nUse Ctrl+S or the Save button to save your merged file.\n\n### POWERFUL SEARCH\nUse find-as-you-type search to dig up the exact commit you're looking for.\n\nSearch for commit messages, commit authors, file names, and wildcard patterns. Complex search queries can be constructed using and, or and () symbols.\n\nFor example min-parents:2 author:jskinner path:tests/* (bug fix or test) will search for a merge commit from jskinner inside the tests directory that contain the words bug and fix or the word test.\n\nYou can open search with Ctrl+F or through the menu: Navigate ▶ Search.\n\n### UNMATCHED PERFORMANCE\nSublime Merge is built on the same custom platform as Sublime Text, providing unmatched responsiveness. With a powerful, cross-platform UI toolkit, an unmatched syntax highlighting engine, and a custom high-performance Git reading library, Sublime Merge sets the bar for performance.\n\n### BLAME\nOpen the Blame of a file through the Command Palette or when viewing a commit to see exactly which lines of the file were added by which commits.\n\nEasily view the age, author, and commit hash of every line of code and see which lines come from the same commit with our commit color coding. Click a line in the gutter to highlight all other lines from the same commit.\n\nThe blame tool will also detect when a piece of code was moved from another place in your repository, so you can truly follow the history of your code.\n\n### ADVANCED DIFFS\nWhere it makes sense we will show you exactly which individual characters have been changed for a commit.\n\nThis includes when you rename or move a file, when you're resolving conflicts or just viewing commit history.\n\nSelect any two commits in Sublime Merge with Ctrl+Left Mouse to show the diff between them.\n\n### FILE AND HUNK HISTORY\nFrom any file or hunk in the history use … ▶ File History or the Hunk History button to view the full history of that source code. This will also follow any file moves or renames throughout the repository.\n\n### COMMAND PALETTE AND KEY BINDINGS\nKeyboard usage is important to us. Use Tab to navigate through parts of the application, Space to toggle expansion, and Enter to stage/unstage hunks. When writing a commit message, use Ctrl+Enter to commit.\n\nThe Command Palette is triggered by Ctrl+P and allows quick access to a large set of Git commands as well as other Sublime Merge functionality.\n\n### LIGHT AND DARK THEMES\nChoose between a light and a dark theme to suit your tastes. You can preview these themes above.\n\nOpen the Preferences ▶ Preferences… menu to change theme.\n\nThe dark theme is only available with a valid license key.\n\n### EXTENSIBILITY\nJust like Sublime Text, just about everything in Sublime Merge is extensible. Key bindings, menus, theming, and the command palette are all customizable with simple JSON files.\n\nAnd more... See all features on https://www.sublimemerge.com.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/sublimemerge/screenshot.png)", "updated": "2024-03-23T11:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/sublimemerge/0.0.2083", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/sublimemerge/0.0.2083", "licenseUrl": "https://www.sublimehq.com/eula", "packageName": "sublimemerge", "displayName": "Sublime Merge", "summary": "Git Client, done Sublime.", "version": "0.0.2083", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/sublimemerge/sublimemerge.png", "author": "Sublime HQ Pty Ltd", "downloadCount": 18892, "tags": ["sublimemerge", "git", "client", "merge", "tool", "development", "syntax", "highlighting"]}