{"description": "Subtitle Workshop is a free application for creating, editing, and converting text-based subtitle files. It supports all the subtitle formats you need and has all the features you would want.\n\nSubtitle Workshop is written in Delphi.\n\n#### Features\n* Supports converting between, creating, opening, editing, and saving over 60 (currently) subtitle formats via the Subtitle API library, as well as saving subtitles in a custom user-defined file format.\n* User-friendly, multi-language, customizable interface (including customizable shortcuts and translation mode).\n* Vast array of customizable tools and functions for automatic timing and text manipulations, including automatic durations, smart line adjusting, spell checking, FPS conversion, search and replace, and many more.\n* Comprehensive customizable system for automatically or manually detecting, marking, and fixing various timing and text subtitle errors.\n* Supports style tags (bold, italic, underline) and color tags in the subtitle text -- including full tags support for multiple tags in a single subtitle.\n* Supports displaying and manipulating the timing pauses (the time gap between two subtitles) and offers a CpS (Characters per Second) system.\n* Multi-level Undo-Redo system.\n* Integrated video player with customizable subtitles preview and full screen mode that would play any video or audio format the system has codecs installed for.\n* Offers various statistics about the subtitle file, including custom statistics based on user-defined rules about the timing or the text.\n* Supports the usage of external Pascal scripts, as well as find-and-replace text scripts (called OCR Scripts).\n\n#### Community\n* [Forum](https://sourceforge.net/p/subworkshop/discussion/)\n* [Facebook](http://facebook.com/subtitleworkshop)", "updated": "2024-03-22T00:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/subtitleworkshop/6.0.131121", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/subtitleworkshop/6.0.131121", "licenseUrl": "http://www.gnu.org/licenses/gpl.html", "packageName": "subtitleworkshop", "displayName": "Subtitle Workshop", "summary": "Free application for creating, editing, and converting text-based subtitle files", "version": "6.0.131121", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/31a0ce8e7c91e0fb296083333bf3725f0d96d58a/icons/subtitleworkshop.png", "author": "Andrey Spiridonov", "downloadCount": 4024, "tags": ["subtitle", "editor", "convert"]}