{"description": "![screen shot of Super Pacman](http://pjsfreeware.synthasite.com/resources/super.png.opt570x306o0%2C0s570x306.png)\n\nSuprepacman Isometric style\n\nCreated with Top-Down to Isometric Example by Fligamaflogamus 2011\n\nThis game is freeware,  if you have been sold it then you have been ripped off.\nmore games at http://pjsfreeware.synthasite.com/\n\nThis game is Freeware\nSUPER Pacman\nwritten by PJ Crossley 2014\n\n### Gameplay summary\nThe player controls Pac-Man around the new item-filled maze with the Arrow keys \nYou must eat every item behind the locked gates, and must eat the keys in order to unlock the gates. \nYou must avoid contact with the ghosts while they are their normal color and Pac-Man is normal-sized. If they catch you, Pac-Man will lose a life. \nIf you eat an energizer, the ghosts will turn blue, and you will have the chance to eat them for bonus points until they return to their normal color. \n\nIf you eat a super energizer, Pac-Man will become very large, capable of using super speed and capable of crashing through gates without key. \nThe ghosts travel at half speed through the side escape tunnels, and beneath the ghost regenerator. They can also exhibit a \"stutter\" behavior. \nA star will sometimes appear below the ghost regenerator. Try to eat it when the pictures on both sides of it match for up to 5000 bonus points. \nIn bonus rounds, Pac-Man remains super and must eat every item as quickly as possible before time runs out. There are no ghosts in these rounds.\n\nEvery 3 levels there is a  bonus rounds. In these stages, Pac-Man is given a time limit in which to complete the entire stage without any interference from the ghosts. In a bonus stage, Pac-Man will start at his Super size and will remain this way until the end of the stage, and therefore have access to holding the Super Speed button the entire time. If the stage is completed before the timer runs out, the remainder of the time is awarded to the player in 100-point increments.\n\nMore free games at http://www.synthasite.com/home\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/superpacman/readme.md)**", "updated": "2024-03-20T16:33:26Z", "galleryUrl": "https://community.chocolatey.org/packages/superpacman/2014.10.12", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/superpacman/2014.10.12", "licenseUrl": "", "packageName": "superpacman", "displayName": "Super Pacman (Portable)", "summary": "PJ Crossley's remake of the classic Super Pacman game.", "version": "2014.10.12", "icon": "http://pjsfreeware.synthasite.com/resources/Rendered5.jpg", "author": "PJ Crossley", "downloadCount": 1019, "tags": ["pjcrossley", "super", "pacman", "retro", "game", "portable"]}