{"description": "Syncplay allows people to enjoy a shared viewing experience even if they are thousands of miles apart, so friends can watch anime, movies, TV shows and other media together. The Syncplay Client launches a media player on your computer, connects to a Syncplay server and joins a virtual room on that server. Pauses, unpauses and seeks made within that media player instance are relayed to fellow viewers via the server to allow for these actions to be replicated by the media players of everyone else in the same virtual room. The server keeps track of where everyone is in the video so if someone joins they can be brought to the right place, and so if someone is too far ahead they can be brought back in sync.\n\nSyncplay can also share information about what files people are playing to make it easier for viewers to confirm they are playing the same file (or be warned if they are playing different files). Users can choose what file information is sent to the server in plain text, sent hashed, or not sent at all. Official public Syncplay servers operate in ‘room isolation’ mode, meaning any information sent by clients is only passed on to others in the same virtual room, and people cannot see what rooms currently exist. People can run their own private password protected Syncplay server.\n    \n#### Package Parameters\n\nThe 'Lang' package parameter can be set to change the installation Language (Defaults to English):\n* 1031 - German\n* 1033 - English\n* 1034 - Spanish\n* 1036 - French (not yet implemented)\n* 1040 - Italian\n* 1045 - Polish (not yet implemented)\n* 1046 - Brazilian Portuguese\n* 1049 - Russian\n* 1055 - Turkish\n* 2070 - European Portuguese\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install syncplay [other options] --params=\"'/Lang:1031'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.", "updated": "2024-03-23T06:33:32Z", "galleryUrl": "https://community.chocolatey.org/packages/syncplay/1.7.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/syncplay/1.7.1", "licenseUrl": "https://github.com/Syncplay/syncplay/blob/master/LICENSE", "packageName": "syncplay", "displayName": "Syncplay", "summary": "Solution to synchronize video playback across multiple instances of mpv, VLC, MPC-HC, MPC-BE and mplayer2 over the Internet.", "version": "1.7.1", "icon": "https://rawcdn.githack.com/Syncplay/syncplay/03cde67c72d401c5c656a6cd2bb55c2da5af8026/syncplay/resources/syncplay.png", "author": "syncplay", "downloadCount": 1098, "tags": ["syncplay", "vlc", "mpv", "mpc-hc", "mplayer2", "server", "synchronize", "playback", "notSilent"]}