{"description": "What makes Syncless so unique is the way synchronization is performed. The current paradigm in the way file synchronization is done is to create a job by setting folder pairs and then start synchronizing. Syncless does away with this completely by introducing the concept of folder tagging. No VSS (Volume Shadow Support): cannot sync open files.\n\nThe concept of tagging has been applied by notable applications in various interesting ways. Facebook allows users to tag people into photos and almost all blog engines allows users to tag posts as a form of categorization. The main reason behind the increased use of tagging is because tagging is a very natural thought process that everyone does when trying to associate words or concepts with the unfamiliar.\n\nBy applying this simple and natural idea to file synchronization, users will be able to synchronize folders by simply tagging different folders with the same tag, resulting in a near seamless experience in synchronization. A group of folders with the same tag will always be kept in sync automatically in real-time by Syncless, without any need for user intervention.\n\n### Documentation\n\n[Wiki](https://code.google.com/p/big5sync/w/list)\n[User](https://code.google.com/p/big5sync/wiki/UserGuide)\n[Developer](https://code.google.com/p/big5sync/wiki/DeveloperGuide)\n[Source code](https://code.google.com/p/big5sync/source/)", "updated": "2024-03-19T04:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/syncless/2.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/syncless/2.1", "licenseUrl": "http://www.gnu.org/licenses/gpl-3.0.html", "packageName": "syncless", "displayName": "Syncless", "summary": "Open-source and free synchronization tool so seamless you'll forget about it", "version": "2.1", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/ad32e2142c40713cb74e265c9201f8cb8d7aa6ae/icons/syncless.png", "author": "big5sync", "downloadCount": 1024, "tags": ["tagging", "synchronization", "backup"]}