{"description": "Synfig Studio is a free, open-source and production-ready 2D animation software, designed as powerful industrial-strength solution for creating film-quality animation using a vector and bitmap artwork. It eliminates the need to create animation frame-by frame, allowing you to produce 2D animation of a higher quality with fewer people and resources.\n    \n    It is designed to produce film-quality animation with fewer people and resources and is built to eliminate the need to draw each frame individually using Morphing animation and/or Cutout animation.\n\n#### Features\n* **Vector Tweening** - Transform any vector shape into another! Synfig gives you powerful tools for full control on your vector artwork. Just set the key positions and inbetween frames will be calculated automatically.\n* **Layers and Filters** - Synfig provides 50+ layers to create artwork and animation of any complexity. Choose from various layer types: geometric, gradients, filters, distortions, transformations, fractals and others.\n* **Bones** - Full-featured bone system allows to create cutout animation using bitmap images or control your vector artwork. Use additional Skeleton Distortion layer to apply complex deformations to bitmap artwork.\n* **Advanced controls** - You can link parameters of various layers – directly or through mathematical expressions. This allows you to create advanced character puppets and other dynamic structures.", "updated": "2024-03-22T09:04:24Z", "galleryUrl": "https://community.chocolatey.org/packages/synfig/1.5.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/synfig/1.5.1", "licenseUrl": "https://www.gnu.org/licenses/gpl-2.0.en.html", "packageName": "synfig", "displayName": "Synfig Studio (Install)", "summary": "Open-source 2D animation software", "version": "1.5.1", "icon": "http://www.synfig.org/img/logo.png", "author": "Synfig Studio Development Team", "downloadCount": 13587, "tags": ["synfig", "synfg", "2d", "animation", "vector", "graphics"]}