{"description": "TagScanner is a powerful tool for organizing and managing your music collection. It can edit tags of most modern audio formats, supports ID3v1/v2, Vorbis comments, APEv2, WMA and MP4 (iTunes) tags. You can rename files according to information from the tags, import tag information from filenames or other sources, perform any text replacement and transformations in tags and filenames. Also you may get album info and download covers via online databases like freedb, Discogs or MusicBrainz. You can create playlists in one click and export your collection to HTML, Excel or any user-defined format. Program has easy-to-use multilingual interface and built-in audio player.\n\n## Features\n\n- Rename files based on the tag and file information\n- Powerful multiple files tag editor\n- Import tag information and album art from online databases like freedb or Amazon\n- Generate tag information from file/foldernames\n- Tag fields formatting and rearrangement\n- Words replacement and case conversion from tags and filenames\n- Supports MP3, OGG, FLAC, WMA, MPEG-4, Opus, Musepack, Monkey's Audio, AAC, OptimFROG, SPEEX, WavPack, TrueAudio, Direct Stream Digital files\n- Supports ID3 1.0/1.1/2.2/2.3/2.4 tags, APE v1 and v2 tags, Vorbis Comments, WMA tags and MP4(iTunes) metadata\n- Supports for embedded lyrics and cover art\n- Resize cover art for portable devices on the fly\n- TAGs versions conversions\n- Quick playlists creation\n- Export information to HTML, XML CSV or any user-defined format\n- Full support for Unicode\n- Multilanguage interface\n- Built-in audio player\n- Works on Windows XP / 2003 / Vista / 2008 / 7 / 8 / 8.1 / 10\n\n\n![screenshot](https://cdn.rawgit.com/majkinetor/chocolatey/master/tagscanner/screenshot.png)\n\n[More screenshots ...](https://www.xdlab.ru/en/screen.htm)", "updated": "2024-03-22T19:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/tagscanner/6.1.16", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tagscanner/6.1.16", "licenseUrl": "", "packageName": "tagscanner", "displayName": "TagScanner (Install)", "summary": "TagScanner is a powerful tool for organizing and managing your music collection", "version": "6.1.16", "icon": "https://cdn.jsdelivr.net/gh/majkinetor/chocolatey/tagscanner/icon.png", "author": "Sergey Serkov", "downloadCount": 26278, "tags": ["tag", "mp3", "scanner", "id3", "audio", "metadata", "admin", "freeware"]}