{"description": "TagScanner is a multifunction program for organizing and managing your music collection. It can edit tags of most modern audio formats, rename files according to information from the tags, generate tag information from filenames, and perform any transformations of the text from tags and filenames. Also you may get album info and cd-covers via online databases like freedb, Amazon or Discogs. Supports ID3v1/v2, Vorbis comments, APEv2, WindowsMedia and MP4(iTunes) tags. Powerful TAG editor with batch functions and special features. Playlists generator with ability to export playlists to HTML or Excel. Easy-to-use multilanguage interface. Built-in music player.\n\nFeatures:\n\nRename files based on the tag and file information\nPowerful multiple files tag editor\nImport tag information and album art from online databases like freedb or Amazon\nGenerate tag information from file/foldernames\nTag fields formatting and rearrangement\nWords replacement and case conversion from tags and filenames\nSupports MP3, OGG, FLAC, WMA, MPEG-4, Opus, Musepack, Monkey's Audio, AAC, OptimFROG, SPEEX, WavPack, TrueAudio, Direct Stream Digital files\nSupports ID3 1.0/1.1/2.2/2.3/2.4 tags, APE v1 and v2 tags, Vorbis Comments, WMA tags and MP4(iTunes) metadata\nSupports for embedded lyrics and cover art\nResize cover art for portable devices on the fly\nTAGs versions conversions\nQuick playlists creation\nExport information to HTML, XML CSV or any user-defined format\nFull support for Unicode\nMultilanguage interface\nBuilt-in multiformat player", "updated": "2024-03-21T16:03:40Z", "galleryUrl": "https://community.chocolatey.org/packages/tagscanner.portable/6.1.16", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tagscanner.portable/6.1.16", "licenseUrl": "", "packageName": "tagscanner.portable", "displayName": "TagScanner (Portable)", "summary": "TagScanner is a multifunction program for organizing and managing your music collection.", "version": "6.1.16", "icon": "https://cdn.statically.io/gh/niks255/ChocolateyPackages/master/tagscanner.portable/icon.png", "author": "Sergey Serkov", "downloadCount": 6499, "tags": ["tagscanner", "tag", "mp3", "scanner", "id3"]}