{"description": "![rsz_hero2](https://user-images.githubusercontent.com/50437199/90984468-6c5a1a00-e575-11ea-9af0-a874115e07e7.png)\n  \nTaskbarX gives you control over the position of your taskbar icons.\nTaskbarX will give you an original Windows dock like feel. The icons will move to the center or user given position when an icon gets added or removed from the taskbar. You will be given the option to choose between a variety of different animations and change their speeds. The animations can be disabled if you don't like animations and want them to move in an instant. The center position can also be changed to bring your icons more to the left or right based on the center position. Currently all taskbar settings are supported including the vertical taskbar and unlimited taskbars.\nTaskbarX has been in development since 6 may 2018. Also known as FalconX and Falcon10.\n&nbsp;  \n  \n![aa4](https://user-images.githubusercontent.com/50437199/79305152-1c968280-7ef3-11ea-9eda-c97f61b758bd.png)\n&nbsp;\n\n## Features\n\n- 42 different Animations including \"none\"\n- Great performance (Very optimized and lightweight looping)\n- Change animation speed\n- Change custom offset position based on center\n- Center between startbutton, search, taskview etc... and left tray icons, clock etc...\n- All taskbar settings supported\n- Vertical taskbar supported\n- Unlimited monitors supported\n- Change taskbar style to Transparent, Blur and Acrylic\n- Change taskbar color and transparency\n- Hide Start button and more...\n  \n&nbsp;\n\n## Commandline Arguments\n\n_**-stop** will stop TaskbarX, puts all icons back to the left and resets the taskbar style.  \n**-tbs=1** will make the taskbar transparent. 2 blur, 3 acrylic, 4 transparent (with gradient), 5 opaque and 0 is disabled.  \n**-ptbo=0** will set the offset of the primary taskbar based on the center.  \n**-stbo=0** will set the offset of the secondary taskbar based on the center.  \n**-cpo=1** will only center the primary taskbar. 0 is disabled.  \n**-cso=1** will only center the secondary taskbar(s). 0 is disabled.  \n**-as=backeaseout** will set the animation style to BackEaseOut. \"none\" is instant.  \n**-asp=500** will set the speed of the animation.  \n**-lr=400** will set the refresh rate of the looper/taskbar checker.  \n**-cib=1** will set the primary taskbar position in between start, search etc.. and the tray.  \n**-ftotc=1** will update any toolbar when a tray icon gets added or removed.  \n**-sr=1920** will put the icons to the left when screen width becomes 1920px.  \n**-sr2=1920** will put the icons to the left when screen width becomes 1920px.  \n**-sr3=1920** will put the icons to the left when screen width becomes 1920px.  \n**-cfsa=1** will pause TaskbarX if a fullscreen app is running.  \n**-obas=backeaseout** will set the animation style to BackEaseOut when on battery mode.  \n**-oblr=400** will set the refresh rate of the looper/taskbar checker when on battery mode.  \n**-dct=1** will stop TaskbarX from centering the taskbar icons.  \n**-hps=1** will hide the start button on the primary monitor.  \n**-hss=1** will hide the start button on the secondary monitor.  \n**-hpt=1** will hide the tray area on the primary monitor.  \n**-hst=1** will hide the tray area on the secondary monitor.  \n**-sti=1** will show a tray icon to quickly restart and stop TaskbarX.  \n**-dtbsowm=1** will revert to the default taskbar on maximized window.  \n**-tpop=100** will set the total opacity of the primary taskbar.  \n**-tsop=100** will set the total opacity of the secondary taskbar.  \n**-rzbt=1** will revert the taskbar back to the left when the icons start overlapping with the Tray area.  \n**-color=0;0;0;1** will set the color of the taskbar when using taskbar styling. RGBA._\n  \n> **Example:** _C:\\Program Files (x86)\\TaskbarX\\TaskbarX.exe -tbs=1 -as=backeaseout_", "updated": "2024-03-23T20:48:38Z", "galleryUrl": "https://community.chocolatey.org/packages/taskbarx/1.7.8.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/taskbarx/1.7.8.0", "licenseUrl": "https://github.com/ChrisAnd1998/TaskbarX/blob/master/LICENSE", "packageName": "taskbarx", "displayName": "TaskbarX", "summary": "Center Windows taskbar icons with a variety of animations and options.", "version": "1.7.8.0", "icon": "https://rawcdn.githack.com/sitiom/chocolatey-packages/main/icons/taskbarx.png", "author": "Chris Andriessen", "downloadCount": 7489, "tags": ["taskbarx", "windows", "automation", "windows-10", "animations", "taskbar", "vbnet", "windows-taskbar", "taskbar-application", "center-taskbar-icons", "center-taskbar-windows"]}