{"description": "Total Commander file system plugin that provides temporary panel.\n\nSee [TCP Scripts](https://chocolatey.org/packages/tcps) for package parameters and other notes.\n\nVirtualPanel is a sort of virtual folder that allows keeping links to frequently used files and accessing them as if they were real files and not just links. It doesn't store any files, it only keeps links to them in special list files. You can use VP as a temporary place for files that should be copied to some other place. Also you can use it for organizing media libraries and for other needs. You can even set up some folder for collecting files from multiple folders on your PC.\n\n## Features\n\n- Keeping links to files and folders, and virtual folders\n- Saving VP state on exit TC or Windows, by timer or after each modification\n- Import/export of whole contents or separate directories\n- Import/export of usual filelists (like m3u)\n- Correct copy/move operations processing\n- Deleting real files when Shift key is down\n- Logging file operations\n- Internal commands for extra functions (execute ? command for help)\n- Ability to execute command batches and create script files\n- Autoexecuted scripts on load state or enter directory\n- Support for executing scripts remotely\n- Virtual explorer with drag-and-drop support\n- Multi-threading support (background operations in TC 7.55 and later)\n- Support for internal associations in TC 7.51 and later\n- Support for standard cd command in TC\n- Full Unicode support", "updated": "2024-03-22T16:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/tcp-virtualpanel/2.0.7.1372", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tcp-virtualpanel/2.0.7.1372", "licenseUrl": "https://www.ghisler.com/plugins.htm", "packageName": "tcp-virtualpanel", "displayName": "TC Plugin: VirtualPanel", "summary": "Total Commander file system plugin that provides temporary panel", "version": "2.0.7.1372", "icon": "", "author": "MVV", "downloadCount": 1822, "tags": ["totalcmd", "doublecmd", "plugin", "tcplugin", "tcpfilesystem", "files", "freeware"]}