{"description": "Startups is a file-system plugin that can list, disable, analyze, edit and delete system startups that are located in the Registry or Start Menu.\n\nSee [TCP Scripts](https://chocolatey.org/packages/tcps) for package parameters and other notes.\n\n## Features\n\n- List system startups that are located in the Registry (HKCU, HKLM in Run and RunOnce, respectively) and Start Menu folders (All Users and current user)\n- Disable startups so they don't start automatically, but can easily be re-enabled\n- Run startups manually on request\n- Delete startups\n- Manage startups in 32 and 64 bit Registry branches on 64 bit Windows\n- Show correct executable information in the file list of Total Commander (32 bit) on Windows 64 bit, i.e. file date/time and sizes\n- Show information about the executable like file size, company name, file version, description and so on\n- Edit startups, e.g. command line parameters, name etc.\n- Ability to show startups with the same name in different locations as each startup will have a unique name.\n- Copy or move startups to a different location, even across Registry and Start Menu (with some limitations)\n- Unicode capable\n- Translation to other languages possible (Danish, English, German and Russian included in the package)\n- Support for custom columns (default view available)\n- View and edit properties specific to Start Menu shortcuts like comments and window state\n- Check if a startup is currently running, with matching process names and matching command lines\n- Jump to the startup's executable with Enter and/or Shift+Enter\n\n![screenshot](https://cdn.rawgit.com/majkinetor/chocolatey/master/tcp/tcp-startups/screenshot.png)", "updated": "2024-03-22T16:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/tcp-startups/0.4.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tcp-startups/0.4.0", "licenseUrl": "https://creativecommons.org/licenses/by/3.0/", "packageName": "tcp-startups", "displayName": "TC Plugin: Startups", "summary": "Total Commander file system plugin that can manage system startups that are located in the Registry or Start Menu", "version": "0.4.0", "icon": "", "author": "Dalai", "downloadCount": 1786, "tags": ["doublecmd", "totalcmd", "plugin", "tcplugin", "tcpfilesystem", "freeware"]}