{"description": "TeamViewer connects people, places and things around the world on the widest array of platforms and technologies.\nFree for private use. Commercial users are welcome to use for trial purposes.\n\n## Why TeamViewer for remote desktop access and support?\n\n* Save time and money\n  With TeamViewer, all the tools you need to stay connected are at your fingertips. Whether accessing your office PC from the road, video conferencing across town, or sharing your screen for remote support from the other side of the world, our tools can help reduce travel costs and downtime by keeping all your people and devices connected.\n\n* Focus on your work, not getting it to work\n  How many hours do you lose in your business just trying to get things to work or access to the tools you need? TeamViewer's remote solutions are designed to get you working, or help on any device—in seconds.\n\n* Feel safe and secure\n  TeamViewer's dedication to security means you won't have to worry whether confidential files or sensitive information is at risk when connecting to devices. Private data, private conversations, and private meetings stay that way.\n\n## Notes\n\n- The vendor does not update the version number but will update the software from time to time rendering the checksum invalid. If this happens then you can use the `--ignore-checksums` switch or wait until the new version is released.\n- This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/teamviewer/15.51.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/teamviewer/15.51.6", "licenseUrl": "https://www.teamviewer.com/en/eula/", "packageName": "teamviewer", "displayName": "Teamviewer (Install)", "summary": "Empowering secure remote desktop access and support.", "version": "15.51.6", "icon": "https://cdn.jsdelivr.net/gh/pauby/ChocoPackages@46f969b5/icons/teamviewer.png", "author": "TeamViewer GmbH", "downloadCount": 17727794, "tags": ["admin", "remote", "control"]}