{"description": "Pure instant messaging — simple, fast, secure, and synced across all your devices. Over 200 million active users in four years.\n\nFAST: Telegram is the fastest messaging app on the market, connecting people via a unique, distributed network of data centers around the globe.\n\nSYNCED: You can access your messages from all your devices at once. Start typing on your phone and finish the message from your tablet or laptop. Never lose your data again.\n\nUNLIMITED: You can send media and files, without any limits on their type and size. Your entire chat history will require no disk space on your device, and will be securely stored in the Telegram cloud for as long as you need it.\n\nSECURE: We made it our mission to provide the best security combined with ease of use. Everything on Telegram, including chats, groups, media, etc. is encrypted using a combination of 256-bit symmetric AES encryption, 2048-bit RSA encryption, and Diffie–Hellman secure key exchange.\n\nPOWERFUL: You can create group chats for up to 200,000 members, share large videos, documents of any type (.DOC, .MP3, .ZIP, etc.), and even set up bots for specific tasks. It's the perfect tool for hosting online communities and coordinating teamwork.\n\nRELIABLE: Built to deliver your messages in the minimum bytes possible, Telegram is the most reliable messaging system ever made. It works even on the weakest mobile connections.\n\nFUN: Telegram has powerful photo and video editing tools and an open sticker/GIF platform to cater to all your expressive needs.\n\nSIMPLE: While providing an unprecedented array of features, we are taking great care to keep the interface clean. With its minimalist design, Telegram is lean and easy to use.\n\n100% FREE and NO ADS: Telegram is free and will always be free. We are not going to sell ads or introduce subscription fees.\n\nPRIVATE: We take your privacy seriously and will never give third parties access to your data.\n\nFor those interested in maximum privacy, Telegram offers Secret Chats. Secret Chat messages can be programmed to self-destruct automatically from both participating devices. This way you can send all types of disappearing content — messages, photos, videos, and even files. Secret Chats use end-to-end encryption to ensure that a message can only be read by its intended recipient.\n\nWe keep expanding the boundaries of what you can do with a messaging app. Don’t wait years for older messengers to catch up with Telegram — join the revolution today.\n\n\n#### Documentation\n* [FAQ](https://telegram.org/faq)\n* [FAQ-Technical](https://core.telegram.org/techfaq)\n* [API](https://core.telegram.org/api)\n* [Protocol](https://core.telegram.org/mtproto)\n* [Schema](https://core.telegram.org/schema)\n\n#### Community\n* [Facebook](https://telegram.org/faq#facebook-or-other-platforms)\n* [Twitter](https://twitter.com/telegram)", "updated": "2024-03-23T16:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/telegram.portable/4.15.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/telegram.portable/4.15.2", "licenseUrl": "https://github.com/telegramdesktop/tdesktop/blob/master/LICENSE", "packageName": "telegram.portable", "displayName": "Telegram (Portable)", "summary": "Cloud-based synchronized messaging app with a focus on speed and security", "version": "4.15.2", "icon": "https://rawcdn.githack.com/SebastianK90/chocolateyautomaticpackages/31d0b9851a02b653471474a4aef34e0b9a90e4c1/icons/telegram.png", "author": "Pavel Durov, Nikolai Durov", "downloadCount": 63206, "tags": ["im", "messenger", "chat", "synchronized", "cloud"]}