{"description": "Tenacity is an easy-to-use multi-track audio editor and recorder for Windows, macOS, Linux and other operating systems. It is built on top of the widely popular [Audacity](https://audacityteam.org/) and is being developed by a wide, diverse group of volunteers.\n\n**Are you coming from [Audacium](https://github.com/Audacium/audacium) or [Saucedacity](https://codeberg.org/tenacityteam/saucedacity-legacy)? You're in the right place!** We'd like to welcome all Audacium and Saucedacity users to Tenacity and our community. We've implemented new features from Audacity 3.1 to make editing easier. Additionally, we've preserved the themes of these two forks with only very slight modifications so they look better with our new editing features and slight track changes.\n\n## Features\n\n- **Recording** from audio devices (real or virtual)\n- **Export / Import** a wide range of audio formats (extensible with FFmpeg)\n- **High quality** including up to 32-bit float audio support\n- **Plug-ins** providing support for VST, LV2, and AU plugins\n- **Scripting** in the built-in scripting language Nyquist, or in Python, Perl and other languages with named pipes\n- **Editing** arbitrary sampling and multi-track timeline\n- **Accessibility** including editing via keyboard, screen reader support and narration support\n- **Tools** useful in the analysis of signals, including audio\n\n**Please Note**: This is an automatically updated package. If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/tenacity/1.3.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tenacity/1.3.3", "licenseUrl": "https://codeberg.org/tenacityteam/tenacity/raw/branch/main/LICENSE.txt", "packageName": "tenacity", "displayName": "Tenacity Audio Editor", "summary": "Tenacity is an easy-to-use, privacy-friendly, FLOSS, cross-platform multi-track audio editor for Windows, macOS, Linux, and other operating systems https://tenacityaudio.org", "version": "1.3.3", "icon": "https://codeberg.org/avatars/6b86568c2838095963b246507645cd1a", "author": "Tenacity Team (and contributors)", "downloadCount": 2079, "tags": ["tenacity", "editor", "audio", "recorder", "foss", "cross-platform"]}