{"description": "Terraform is a tool for building, changing, and versioning infrastructure safely and efficiently. Terraform can manage existing and popular service providers as well as custom in-house solutions.\n\nThe key features of Terraform are:\n\n* **Infrastructure as Code**: Infrastructure is described using a high-level configuration syntax. This allows a blueprint of your datacenter to be versioned and treated as you would any other code. Additionally, infrastructure can be shared and re-used.\n* **Execution Plans**: Terraform has a \"planning\" step where it generates an *execution plan*. The execution plan shows what Terraform will do when you call apply. This lets you avoid any surprises when Terraform manipulates infrastructure.\n* **Resource Graph**: Terraform builds a graph of all your resources, and parallelizes the creation and modification of any non-dependent resources. Because of this, Terraform builds infrastructure as efficiently as possible, and operators get insight into dependencies in their infrastructure.\n* **Change Automation**: Complex changesets can be applied to your infrastructure with minimal human interaction. With the previously mentioned execution plan and resource graph, you know exactly what Terraform will change and in what order, avoiding many possible human errors.\n\nFor more information, see the [introduction section](http://www.terraform.io/intro) of the Terraform website.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/terraform/1.7.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/terraform/1.7.5", "licenseUrl": "https://github.com/hashicorp/terraform/blob/master/LICENSE", "packageName": "terraform", "displayName": "Terraform", "summary": "Terraform is a tool for building, changing, and versioning infrastructure safely and efficiently. Terraform can manage existing and popular service providers as well as custom in-house solutions.", "version": "1.7.5", "icon": "https://raw.githubusercontent.com/jamestoyer/chocolatey-packages/58ab86c08224c2ba79af2080346c53c1cc440afc/terraform/icons/terraform.png", "author": "Mitchell Hashimoto,  HashiCorp", "downloadCount": 1481516, "tags": ["terraform", "hashicorp"]}