{"description": "The TestCentric Runner for NUnit (**TestCentric**) is a GUI runner aimed at eventually supporting a range of .NET testing frameworks. In the 1.x release series, we are concentrating on support of NUnit tests. The user interface is based on the layout and feature set of the of the original NUnit GUI, with the internals modified so as to run NUnit 3 tests.\n\nThis package includes the both the standard TestCentric GUI runner (`testcentric.exe`) and an experiental runner (`tc-next.exe`) which is available for... wait for it... experimentation! The package incorporates the TestCentric test engine, a modified version of the NUnit engine.\n\n### Features\n\nMost features of the NUnit V2 Gui runner are supported. See CHANGES.txt for more detailed information.\n\nNUnit engine extensions are supported but no extensions are bundled with the GUI itself. They must be installed separately **using chocolatey**. In particular, to run NUnit V2 tests, you should install the **NUnit V2 Framework Driver Extension**.\n\n**Warning:** When using the GUI chocolatey package, **only** chocolatey-packaged extensions will be availble. This is by design.\n\n### Prerequisites\n\n**TestCentric** requires .NET 4.5 or later in order to function, although your tests may run in a separate process under other framework versions.\n\nProjects with tests to be run under **TestCentric** must already have some version of the NUnit framework installed separtely.", "updated": "2024-03-20T20:33:28Z", "galleryUrl": "https://community.chocolatey.org/packages/testcentric-gui/1.6.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/testcentric-gui/1.6.4", "licenseUrl": "https://raw.githubusercontent.com/TestCentric/testcentric-gui/main/LICENSE.txt", "packageName": "testcentric-gui", "displayName": "TestCentric Runner for NUnit", "summary": "TestCentric GUI runner for the NUnit 3 unit-testing framework.", "version": "1.6.4", "icon": "https://raw.githubusercontent.com/TestCentric/testcentric-gui/main/testcentric.png", "author": "Charlie Poole", "downloadCount": 7936, "tags": ["testcentric", "nunit", "gui", "runner", "test", "centric", "testing", "tdd"]}