{"description": "**Rich Editor _for_ Plain Text.**\nSeparate Content from Formatting. Store in Markdown.\n\nTEXTS is rich editor for plain text. Write structured documents. Store in plain text. Publish to many formats.\n\n## FEATURES\n\n### Markdown visual editor\nWrite using Markdown - without having to remember the markup. With Texts you can apply styles to words or paragraphs and immediately see the results. Your images and tables are displayed directly within Texts.\n\n### Well-structured content\nUse Texts to create structured documents. You set your titles and headings, and they will stay in place if you export your document to another format.\n\n### Blogging on GitHub Pages\nContent written in Texts can be easily published as a blog on GitHub Pages, with math, tables, footnotes etc.\n\n### Perfect for academics\nDeveloped to cover all your needs: formulas and footnotes, bibliography and citations, tables and links.\n\n### Single source publishing\nWriting your documents in Texts gives you a lot of flexibility. You can easily convert your words into clean HTML5, professional PDFs, ePub or Word format, or even a presentation.\n\n### Professional typesetting\nTexts produces immaculate PDFs. Everything you create — from paragraphs of text to mathematical formulae — is perfectly typeset. See some sample documents.\n\n### Cross-platform application\nMac OS X or Windows? Doesn't matter, use Texts on both. The app has native look and feel on each platform, and the document format is common across platforms.\n\n### Custom themes\nChange the appearance of your text editor with themes.\n\n### Export templates\nAdjust style of any published documents with export templates.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/texts/screenshot.png)", "updated": "2024-03-23T13:03:29Z", "galleryUrl": "https://community.chocolatey.org/packages/Texts/1.5.20190524", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Texts/1.5.20190524", "licenseUrl": "http://www.texts.io/tos", "packageName": "Texts", "displayName": "Texts", "summary": "Markdown and rich editor for plain text.", "version": "1.5.20190524", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/texts/texts.png", "author": "Text Software Limited", "downloadCount": 2274, "tags": ["texts", "mardown", "editor"]}