{"description": "Quickly convert text, word, pdf, and other documents to speech and save results to MP3 files using Windows Text-to-Speech Engine and voice synthesizer.\n\n- Supports multiple languages*\n- Synthesizes speech using configurable voice*\n- Voice control options include speaker's gender, tempo, speed, emphasis, and volume\n- Records and outputs either wav or mp3 files\n- One or two audio channels: mono / stereo output\n- Control recorded sound quality using effective bit rate: bits per sample and samples per second settings\n- Can open and read most text documents in most encodings\n- Can read documents in doc, rtf, and pdf formats**\n- Automatically improves and fixes text to make it compatible with speech synthesis (for example it can remove hyphenation)\n- Can use any of the installed Text-to-Speech voices\n- Uses Microsoft Speech Synthesizer available with Windows\n- Text-to-Speech (TTS) engine supports Speech Synthesis Markup Language (SSML)\n\n* Voices and language support varies depending on your version of Windows and installed speech languages.\n** Word, pdf, rtf, and other documents may need to be opened in their respective programs depending on the exact format version and features used.\n\n    Note: This is a fully functional trial version. The length of the produced audio file is limited.", "updated": "2024-03-20T17:03:25Z", "galleryUrl": "https://community.chocolatey.org/packages/text-to-mp3-converter/2.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/text-to-mp3-converter/2.0.0", "licenseUrl": "https://www.binarymark.com/eula.aspx", "packageName": "text-to-mp3-converter", "displayName": "Text to MP3 Converter", "summary": "Text to speech converter recording MP3 files", "version": "2.0.0", "icon": "https://www.binarymark.com/img/box/box44_std.png", "author": "BinaryMark", "downloadCount": 1058, "tags": ["text-to-mp3-converter", "speech", "text", "mp3", "wav", "audio", "voice", "synthesizer", "converter", "ssml", "file", "trial", "admin"]}