{"description": "Prerequisites\n\nBest Practices Analyzer: install on the TFS Server (Application Tier)\n\nProcess Template Editor: VS Pro and up\n\nOther: Team Explorer or VS Pro and up\n\nNote: VS Express users download Team Explorer for free to use the power tools (except for the Process Template Editor)\n\n \n\nBest Practices Analyzer\n\nA diagnostic tool that you can use to perform the following actions:\n•Verify that the deployment for Team Foundation Server is configured according to recommended best practices \n•Identify the source of problems in an unhealthy deployment \n•Take a snapshot of the configuration of a deployment \n•Obtain usage data about the volume of data stored or accessed in the past 14 days. Includes specific information about database tables that have a tendency to grow and that may need to be reduced in size. \n\nCheck-in policies\n\nA Visual Studio add-in, located under the Team | Team Project Settings | Source Control menu. It adds the following checkin policies:\n\n\nPolicy\n\nDescription\n\nCustom Path Policy This policy scopes other policies to specific folders or file types \nForbidden Patterns Policy This policy prevents users from checking in files with fobidden filename patterns \nWork Item Query Policy This policy allows you to specify a work item query whose results will be the only legal work items for a check-in to be associated with \n\nProcess Template Editor\n\nA Visual Studio add-in, located under the Tools menu. The Process Template Editor provides a graphical user interface for customizing work items (field, workflow and the form) and process templates.\n\nStoryboard Shapes\n\nThis tool enables you to create shapes for the PowerPoint storyboarding add-in with custom resize logic.\n\nTeam Explorer Enhancements\n\nThis tool provides additional Visual Studio menu options and functions to support finding files under version control by status or wildcard, opening a folder using File Explorer from the Source Control Explorer context menu, and", "updated": "2024-03-15T10:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/TFSPowerTools2012/11.0.60507.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/TFSPowerTools2012/11.0.60507.1", "licenseUrl": "http://msdn.microsoft.com/cc300389.aspx", "packageName": "TFSPowerTools2012", "displayName": "Microsoft Visual Studio Team Foundation Server 2012 Update 2 Power Tools", "summary": "Power Tools are a set of enhancements, tools, and command-line utilities that increase productivity of Team Foundation Server scenarios.", "version": "11.0.60507.1", "icon": "", "author": "Microsoft", "downloadCount": 1879, "tags": [""]}