{"description": "## Features\n\nEasy to get started. Thonny comes with Python 3.7 built in, so just one simple installer is needed and you're ready to learn programming. (You can also use a separate Python installation, if necessary.) The initial user interface is stripped of all features that may distract beginners.\n\n### Initial layout\n\nNo-hassle variables. Once you're done with hello-worlds, select View → Variables and see how your programs and shell commands affect Python variables.\n\n### Variables table\n\nSimple debugger. Just press Ctrl+F5 instead of F5 and you can run your programs step-by-step, no breakpoints needed. Press F6 for a big step and F7 for a small step. Steps follow program structure, not just code lines.\n\n### Stepping through statements\n\nStep through expression evaluation. If you use small steps, then you can even see how Python evaluates your expressions. You can think of this light-blue box as a piece of paper where Python replaces subexpressions with their values, piece-by-piece.\n\n### Visualization of expression evaluation\n\nFaithful representation of function calls. Stepping into a function call opens a new window with separate local variables table and code pointer. Good understanding of how function calls work is especially important for understanding recursion.\n\n### Visualization of call frames\n\nHighlights syntax errors. Unclosed quotes and parentheses are the most common beginners' syntax errors. Thonny's editor makes these easy to spot.\n\n### Visualization of syntax errors\n\nExplains scopes. Highlighting variable occurrences reminds you that the same name doesn't always mean the same variable and helps spotting typos. Local variables are visually distinguished from globals.\n\n### Local and global names are visually distinguished\n\nMode for explaining references. Variables are initially presented according to simplified model (name → value) but you can switch to more realistic model (name → address/id → value).\n\n### Variables table vs values table\n\nCode completion. Students can explore APIs with the help of code completion.\n\n### Code completion\n\nBeginner friendly system shell. Select Tools → Open system shell to install extra packages or learn handling Python on command line. PATH and conflicts with other Python interpreters are taken care of by Thonny.\n\n### System shell prepared for Python commands\n\nSimple and clean pip GUI. Select Tools → Manage packages for even easier installation of 3rd party packages.\n\n**Please Note**: This is an automatically updated package. If you find it is\nout of date by more than a day or two, please contact the maintainer(s) and\nlet them know the package is no longer updating correctly.", "updated": "2024-03-23T20:48:38Z", "galleryUrl": "https://community.chocolatey.org/packages/thonny/4.1.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/thonny/4.1.4", "licenseUrl": "https://github.com/thonny/thonny/blob/master/LICENSE.txt", "packageName": "thonny", "displayName": "Thonny", "summary": "Thonny - Python IDE for beginners", "version": "4.1.4", "icon": "https://cdn.jsdelivr.net/gh/mkevenaar/chocolatey-packages@81ff2d5f95d772fafbef2696261b9b9d5bc099ac/icons/thonny.png", "author": "Aivar Annamaa", "downloadCount": 42143, "tags": ["thonny", "admin"]}