{"description": "Default Install Location: `C:\\ProgramData\\chocolatey\\lib\\throttlestop\\tools\\throttlestop` (this can change depending on where your choco directory is set to).\n        \nSince a lot of energy is required to keep modern hardware running at full potential, managing resources can save up a lot of power. Designed especially for laptop users, ThrottleStop is an easy to use program that can adjust the performance of your Intel CPU according to the programs you use.\n\nNormally, manufacturers integrate throttling schemes into their products, but if you want to overclock your CPU, this might be the tool for you. However, exceeding the power capabilities of your adapter can result in damaging your PC, so you have to make sure you know what you are doing.\n\nThrottleStop automatically detects your CPU type and speed. The software monitors four CPU performance profiles: optimized performance, gaming, Internet navigation and battery support. The profiles are customizable and you can switch between them by clicking on the corresponding number.\n\nFor each throttling type, you can adjust several options. 'Clock Modulation' and its variant, 'Chipset Clock Modulation' allow you to slow down your CPU or make it run at 100% of its designed capability.\n\nAlso, you can set the multiplier value for your processor. For example, reducing this value results in a CPU lower speed; this can reduce power usage when the laptop is running on battery. Furthermore, if your processor is Core 2 based, you are able to adjust its VID or voltage values.\n\nWith ThrottleStop, you can disable the turbo boost feature of your CPU, as well as protect your computer from overheating using the 'BD PROCHOT' option.\n\nYou can change various other parameters, such as the turbo ratio limits for each core and the package power limits. The current state of each CPU thread is displayed in the monitoring panel, so you are able to view the CPU performance parameters anytime you want. Furthermore, the program can create a throttling log file and save it for later reference.\n\nAll in all, battery monitoring and customizable performance profiles are features that make ThrottleStop a handy application for laptop CPU throttling and overclocking. Only use it if you have a strong documentation, because sloppy handling can literally fry your CPU.\n\n**NOTE**: This package is not automatically updated. If it is out of date and there is no newer package submitted, please use the `Contact Maintainers` functionality to alert me.", "updated": "2024-03-23T22:33:38Z", "galleryUrl": "https://community.chocolatey.org/packages/throttlestop/9.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/throttlestop/9.5", "licenseUrl": "", "packageName": "throttlestop", "displayName": "ThrottleStop (Portable)", "summary": "ThrottleStop is an easy to use program that can adjust the performance of your Intel CPU according to the programs you use.", "version": "9.5", "icon": "https://cdn.jsdelivr.net/gh/mikeee/ChocoPackages/icons/throttlestop.png", "author": "Kevin Glynn", "downloadCount": 6151, "tags": ["throttlestop", "throttle", "stop", "overclock", "underclock", "undervolt"]}