{"description": "![Example picture of TinEye Chrome extension in use](https://tineye.com/images/extension-chrome-example.jpg)\n\n##This is the official TinEye Chrome extension. Find out where an image came from, how it's used, or find higher resolution versions.\t\n\n###ABOUT TINEYE\n\nTinEye is the first image search engine on the web to use image identification technology, instead of using keywords, metadata or watermarks. When you submit an image to be searched, TinEye creates a unique and compact digital signature or 'fingerprint' for it, then compares this fingerprint to every other image in our index to retrieve matches. TinEye does not typically find similar images; it finds exact matches including those that have been cropped, edited or resized.\n\nTinEye adds tens of millions of new images to its database every week.\nFollow our image updates here: https://tineye.com/releases\n\nFor the latest updates you can also:\n\n- [Read the TinEye blog:](http://blog.tineye.com/)\n- [Become a fan on Facebook:](https://www.facebook.com/tineye)\n- [Follow us on Twitter:](https://twitter.com/tineye)\n\n---\n\nHOW TO USE THIS EXTENSION\n\nTo use the extension, simply right-click on any web image and select \"Search Image on TinEye\" from the context menu. Results are displayed for you at tineye.com.\n\nTo set extension preferences go to Tools > Extensions in the Chrome menu bar. Locate 'TinEye Reverse Image search' in the extensions list and click the 'Options' link. From here you can:\n\n Set sort order preference\n- Open searches in background, foreground or current tab\n\n\t\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-20T13:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/tineye-chrome/1.1.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tineye-chrome/1.1.5", "licenseUrl": "https://tineye.com/terms", "packageName": "tineye-chrome", "displayName": "TinEye for Chrome", "summary": "TinEye for Chrome lets you search for other instances of pictures on the Internet.", "version": "1.1.5", "icon": "https://tineye.com/images/press/TinEyeLogo_WordMark.jpg", "author": "TinEye", "downloadCount": 781, "tags": ["tineye", "photo", "search", "chrome", "extension"]}