{"description": "This Plex plugin uses the TiVo To Go API to watch a stream off a TiVo or to download a recorded program from the TiVo. It requires a Series 2 or newer TiVo with an ethernet connection. The Plex Server needs to have a high speed connection between itself and the TiVo.\n\nQ: What would I use this channel for?\n\nA: You browse to a show on your TiVo and watch it without downloading it to the Plex Server.\n\nQ: Can I download something from the TiVo it to the Plex Server using this channel?\n\nA: Yes! If you enable the TiVoToGo service, and fill in a folder name, the channel will have extra entries to allow you to download the content.\n\nNOTE: You should create a library on your Plex server which points to the same directory which you are downloading the file into. If you name the Plex library \"TiVo To Go\" it will automatically get refreshed when downloads are initiated and when they complete. If you decide to name the Plex library something different simply add that name in the TiVoToGo preferences.\n\nRequires:\n\nLinux, OSX or Windows Plex Server (No ARM Processor NAS support)\nOn Linux, OSX or X86 NAS requires curl be installed\nTo Do:\n\nUse the urllib instead of curl\nStop using /tmp/cookies.txt\nUse dynamic sockets and a fixed URL for the live stream video\nIf the community support for the MPEG-TS improves, add MPEG-TS support, for now it only works with MPEG-PS\nInstallation Instructions\n\nInstall curl if you don't already have it\nCopy TiVoToGo.bundle to your plugin directory\nMac: ~/Library/Application Support/Plex Media Server/Plug-ins\nWindows: C:\\Users\\[user]\\AppData\\Local\\Plex Media Server\\Plug-ins\nLinux: /var/lib/plexmediaserver/Library/Application Support/Plex Media Server/Plug-ins\nMake sure to update the plugins settings\nEnter your Media Access Key from the TiVo\nEnter a IP address for the TiVo if the Plex Server is on a different subnet and then exit the channel and enter it again.\nIf you want enable the To Go offline download check the box and fill in a directory that is writable by the plex user.\nContribute to the project if you like! :-)", "updated": "2024-03-15T10:03:34Z", "galleryUrl": "https://community.chocolatey.org/packages/tivotogo-plex/2016.12.30", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tivotogo-plex/2016.12.30", "licenseUrl": "", "packageName": "tivotogo-plex", "displayName": "TiVoToGo for Plex", "summary": "TiVo plug-in for Plex", "version": "2016.12.30", "icon": "", "author": "tivoguy", "downloadCount": 839, "tags": ["tivo", "tivotogo", "plex", "admin"]}