{"description": "TIBCO Jaspersoft® Studio is editing software for TIBCO JasperReports®. It will help you design and run report templates; build report queries; write complex expressions; layout visual components like 50+ types of charts, maps, tables, crosstabs, and custom visualizations; and much more. It integrates TIBCO JasperReports® Server to create powerful report publishing workflows.\n\n \nWith Jaspersoft Studio you can build documents of any complexity from your data—from print-ready in PDFs to interactive masterpieces in dynamic HTML, with navigation to interactive components, like maps and charts that may be inside or outside the report. You can generate high quality OpenOffice, PowerPoint , RTF, Word, and spreadsheet documents or you can generate raw CSV, JSON, or XML  documents. It's not difficult to build your own custom exporter to suit any data need.\n\n \nUsing Jaspersoft Studio, you can access different types of data sources, including big data, CSV, Hibernate, Jaspersoft Domain, JavaBeans, JDBC, JSON, NoSQL, TIBCO Spotfire® Information Links, XML, or your own custom data source.\n\n \nAvailable as an Eclipse plug-in or a standalone application, Jaspersoft Studio comes in two editions: Community and Professional. The Professional edition includes additional features, like access to Spotfire, maps, and advanced HTML5 charts, as well as professional support.\n\nThe Community version of TIBCO Jaspersoft® Studio uses the [Java Profiler JProfiler tool](https://www.ej-technologies.com/products/jprofiler/overview.html) for performance analisys and tuning.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/tjs.install/screenshot.png)", "updated": "2024-03-23T03:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/tjs.install/6.20.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tjs.install/6.20.0", "licenseUrl": "https://www.eclipse.org/org/documents/epl-v10.php", "packageName": "tjs.install", "displayName": "TIBCO Jaspersoft Studio (Install)", "summary": "The Eclipse-based report development tool for JasperReports and JasperReports Server.", "version": "6.20.0", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/tjs.install/tjs.install.png", "author": "Software Inc.", "downloadCount": 6818, "tags": ["tjs.install", "report", "development", "tool", "eclipse", "JasperReports"]}