{"description": "![Screenshot of TMPGEnc KARMA..](http://tmpgenc.pegasys-inc.com/en/images/tmka/karma_01.png)\t\n\n##What is TMPGEnc KARMA..?\n\nLooking for a better way to find and organize all of the videos on your computer? TMPGEnc KARMA.. lets you easily scan folders and add videos, creating a library listing of them on your computer. Organize your videos easily by using the sorting options, and even create your own custom description tags. View your videos in any of the multiple preview screens, and use the included TileShot CREATOR tool to create images from your videos! Add some good karma to your life and download TMPGEnc KARMA.. today!\n\n##View Up To 4 Videos At Once\n\nView your video with the main TMPGEnc KARMA.. preview screen, or watch up to three more videos with the sub-preview screens! It's a great way to compare your clips!\n\n##Sync Play Feature\n\nYou can load up to three videos in the sub-preview screens and use the Sync button to play or pause them all at the same time.\n\n##Resume Play Feature\n\nStart your video where you left off with the Resume Play feature. TMPGEnc KARMA.. automatically remembers where you stopped during video playback so the next time you select that video, it will play from that point.\n\n##Set Your Own Preview Thumbnail\n\nWhen you view your video library in thumbnail list mode, the preview thumbnails are automatically obtained from the first frame of your video. However, you can set your own preview thumbnail from any frame in the video by playing it in one of the sub-menus and right-clicking on the frame you'd like to use as the preview thumbnail.\n\n##Color Labels\n\nTMPGEnc KARMA.. lets you quickly color-code your videos with the Color Label buttons. Simply select your video(s) and click one of the color buttons to asign a color! You can then sort your videos by color to help you find the video you're looking for even faster!\n\n##Window Transparency\n\nEasily customize the opacity of the TMPGEnc KARMA.. window by using the slider in the upper right corner. Make your window fully opaque, fully transparent, or anything inbetween!\n\n##TMPGEnc TileShot CREATOR\n\nCreate a tiled image composed of frames from your video with the included TMPGEnc TileShot CREATOR tool! It's a fast and easy way to create digital contact sheets from your video footage. You can even create an animated .gif image! Great for archiving purposes or used as a preview image on your website or blog!\n\n##More on [product page](http://tmpgenc.pegasys-inc.com/en/product/tmka.html).\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/tmpgenc-karma/readme.md)**\n\n***\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n***", "updated": "2024-03-23T00:03:34Z", "galleryUrl": "https://community.chocolatey.org/packages/tmpgenc-karma/0.0.7.72", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tmpgenc-karma/0.0.7.72", "licenseUrl": "http://tmpgenc.pegasys-inc.com/en/download/tmka_license.html", "packageName": "tmpgenc-karma", "displayName": "TMPGEnc KARMA.. (Install)", "summary": "TMPGEnc KARMA... - A New Form of Video Management", "version": "0.0.7.72", "icon": "https://raw.githubusercontent.com/bcurran3/ChocolateyPackages/master/tmpgenc-karma/tmpgenc-karma_icon.png", "author": "Pegasys Inc.", "downloadCount": 665, "tags": ["pegasys", "tmpgenc", "Convert", "Video", "Encode", "Authoring", "DVD/Blu-ray/AVCHD", "Creation", "Lossless", "Editing", "Commercial", "Detection", "Plug-in", "Smart", "Rendering", "Management", "PGMX", "Slideshow", "Player", "Premiere", "EDIUS", "HEVC", "Encoding", "With", "Menus", "Controller"]}