{"description": "![Screenshot of Toby for Chrome](https://lh3.googleusercontent.com/9qlrLXCj3xSTNAqZhovTq68fqF_fsEOyKvaI0AEEFEMG6DVEeZpugdGYEueRKOZaUGNGyHMAzDE=w640-h400-e365)\t\n\t\n##Better than bookmarks. Organize your browser tabs and access them quickly anywhere. “I don’t want to have 3,000 tabs open anymore” – from a new Toby user\n \nBookmarks are for books, not browsers. Organize your browser tabs into Toby so you can access key resources in one-click instead of seven.\n \nToby is better than bookmarks, it levels up your Chrome browser. Toby is a visual workspace that lives on every new tab. Add new tabs by dragging and dropping your browser tabs into collections or save a whole session in just one-click. Access all of your collections on any desktop with automatic sync. Use tags to organize your collections or create notes for your to-dos.\n \nToby is changing the way you save and access tabs by making it easy and fun to use.  \n \n* #1 Chrome extension of 2016 from Product Hunt\n* Google Chrome’s Best of 2016 list\n* Featured in MIT Tech Review, Business Insider, Brit + Co and 30 other publications\n* Teams who work at Bazaarvoice, Twitter, New Relic, IBM, and more are using it daily\n* Over 9,250 love letters written by #TobyFriends in over 144 countries around the world\n\n###WHY TAB MANAGEMENT?\n\nWe built Toby to provide distraction-free focus, saving you time spent switching between tabs from web apps and websites. A survey of Toby customers showed that Toby saves up to 8 hours per week, per person—the equivalent of ~48 work days per year.\n \n★ Pause and resume work\n \nFeel like your workflow is bottle-necked by context switching? With one-click Toby is able to save your browser session, or open it when you’re ready to resume your task.\n \n★ Clear the clutter\n \nUsing different browser windows to separate tabs into to-dos, dashboards, and spreadsheets is not ideal. With Toby, you can remove the clutter by using one window with the tabs you need, right when you need it.\n \n★ Be an expert everywhere you work\n\nGet instant access to the tabs you need to get the job done. Toby is able to search for any website inside of any collection, letting you find exactly what you’re looking for in seconds.\n \n★ Flexible with your work habits\n \nToby lives on every new tab and lets you speed dial into the websites or apps you use on a daily basis. Quick and consistent access is the key to Toby’s value.\n \n★ Stop emailing yourself links\n \nAccess Toby on any page just by right-clicking. Now you can spend more time doing work while queuing up all of your favorite articles to read later.\n \t\n\t\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/toby-chrome/readme.md)**", "updated": "2024-03-19T06:33:33Z", "galleryUrl": "https://community.chocolatey.org/packages/toby-chrome/0.5.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/toby-chrome/0.5.2", "licenseUrl": "http://www.gettoby.com/terms", "packageName": "toby-chrome", "displayName": "Toby for Chrome", "summary": "Toby is a Chrome extension that organizes bookmarks into a card system.", "version": "0.5.2", "icon": "https://raw.githubusercontent.com/bcurran3/ChocolateyPackages/master/toby-chrome/Tobo_symbol_pink.jpg", "author": "gettoby.com", "downloadCount": 705, "tags": ["toby", "bookmarks", "chrome", "extension"]}