{"description": "ToDoList is software in the category of Task Management, Project Management, Productivity, “Getting Things Done” (GTD), Scheduling, and Collaboration.\n\n![ToDoList Example](https://www.abstractspoon.com/images/tasktree-view.png)\n\nWe have a lot of choices to help us keep track of daily obligations. A simple list on paper of things “To Do” is enough for some people. Others prefer to use programs. People have preferences about where they keep track of tasks - with PC utilities (“thick app”), websites (“thin app”), on phone (“mobile”) apps. Some software is very general, with nothing more than a simple list of task names and due dates. Some get more sophisticated with nested tasks, where you need to complete the nested tasks in order to consider the main task complete. Some commercial software is Very sophisticated, and costs a lot - look at Microsoft Project and similar offerings. Some software is focused on specific industries, for construction, manufacturing, business consulting, website management, wedding planning, or even cooking recipes.\n\nToDoList is general-purpose, Windows-based software, which can be used for simple “honey do” home lists or to manage complex multi-user projects for business. In addition to tracking the status of tasks, ToDoList includes a powerful system for logging and reporting time spent on tasks. Combined with powerful reporting mechanisms, this makes ToDoList an effective tool for client billing.\n\nWhat differentiates ToDoList from most other task management packages is the option to create hierarchies of tasks to break complex tasks down in to progressively more simple subtasks until no further simplification is required. Each subtask can be scheduled with a start and end date, a priority and various other attributes. As each sub-task is completed the parent tasks are updated in various ways to keep you informed of overall progress. Tasklists can also be printed or saved in various other formats for display and reporting purposes.", "updated": "2024-03-23T09:03:44Z", "galleryUrl": "https://community.chocolatey.org/packages/todolist/8.2.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/todolist/8.2.7", "licenseUrl": "http://abstractspoon.com/wiki/doku.php?id=free-open-source-software", "packageName": "todolist", "displayName": "ToDoList", "summary": "Hierarchical task manager with native XML support for custom reporting", "version": "8.2.7", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@944400d1829eabb80f2b866788d194c9b37060c2/Icons/todolist_icon.png", "author": "AbstractSpoon Software", "downloadCount": 5897, "tags": ["todolist", "todo", "task", "manager", "productivity", "GTD", "FOSS", "embedded"]}