{"description": "This utility will be handy for people who would like to leave their computers unattended for some time before automatically turning them off (logging off users, rebooting, hibernating or putting them into sleep mode). TOff can perform these tasks at a certain day and time (one time or every day), as well as after a certain period of mouse & keyboard, CPU or network inactivity with the seconds precision. TOff is unequivocally your ticket to save energy.\n\nNeed even more?  [We can customize it specifically for you, to meet your organization's needs](https://dennisbabkin.com/php/fb.php).\n\nBut don't wait! Our carbon footprint grows out of control with each day. \n\nStart small. Let's Save Energy! \n\n## Special features\n- Can shut down, reboot or log off a user in almost every Windows-based operating system at a desired moment in time, or after a certain condition of inactivity.\n- Any system that supports hibernation can be hibernated on timer.\n(Hibernation is the power mode when your computer turns off having preserved all running programs that can be restored later.)\n- Any system that supports a sleep mode can be sent into it on timer.\n- Keeps track of the last operation, so that you can check if power operation occurred on time.\n- TOff can be set to run every day, or every time a Windows user logs in.\n- TOff can perform all of the above operations after a certain period of PC, CPU, or network inactivity.\n- TOff can run in various safe modes to prevent unsafe execution of power operations.\n- TOff can run from a command line to perform additional operations that gives extended control for developers & advanced users.\n- You can save the state of the program in a Windows batch file to run TOff with the same settings later.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/toff/screenshot.png)", "updated": "2024-03-23T08:33:55Z", "galleryUrl": "https://community.chocolatey.org/packages/toff/2.5.8.20191106", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/toff/2.5.8.20191106", "licenseUrl": "https://www.dennisbabkin.com/toff", "packageName": "toff", "displayName": "TOff", "summary": "Advanced power operations to save energy.", "version": "2.5.8.20191106", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/toff/toff.png", "author": "Dennis Babkin", "downloadCount": 779, "tags": ["toff", "energy", "saver"]}