{"description": "What is Tonelib GFX?\n---\nToneLib GFX is a collection of guitar amps, speaker cabinets and effects implemented in software for use with your computer, Windows PC, Mac or Linux. The software comes as a standalone application and as plug-ins for use with the most popular DAW (digital audio workstation) recording software.\n\nThe plug-in and standalone versions offer the same function and sound, but the standalone version also offers a rhythm and backing track player, plus a built-in recorder so you can capture your ideas at the moment of inspiration. Both the standalone and plug-in versions are included when you install ToneLib GFX. Simply connect your guitar to your computer using an audio interface, and your computer is transformed into a powerful amp, effects and recording studio!\n\nToneLifb GFX features\n---\n* Effects include 18 thunderously accurate amps, multiple overdrive, distortion, fuzz, compression and phaser pedals, plus clean boost, delay, reverb, acoustic simulation, wah, EQ, octaver, tremolo, vibrato, chorus, and flanger.\n* All ToneLib GFX gear is precision-modeled based on actual circuit diagrams of highly-sought-after, real-world products.\n* The oversampling is auto-adjusted to your session’s sample rate to save valuable CPU power while providing the most transparent sound possible.\n* Drag-and-drop to add or rearrange effects, or use keyboard shortcuts, with Undo/Redo support.\n* The entire ToneLib GFX chain can be easily saved, organized and recalled through the advanced built-in preset browser.\n* Remotely control ToneLib GFX via MIDI controller.\n* Tune using a high-precision tuner.\n* Keep time with a flexible metronome and rhythm player.\n* Jam along with backing tracks and practice at your pace by adjusting the tempo without affecting pitch.\n* When used in standalone mode, ToneLib GFX features a built-in recorder that makes recording ideas and songs a breeze.", "updated": "2024-03-16T07:48:38Z", "galleryUrl": "https://community.chocolatey.org/packages/tonelib-gfx/4.6.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tonelib-gfx/4.6.5", "licenseUrl": "", "packageName": "tonelib-gfx", "displayName": "ToneLib GFX", "summary": "Audio effects and amp modeling software", "version": "4.6.5", "icon": "https://rawcdn.githack.com/mica/ChocolateyPackages/5210252e362530219a01c1050c925c0eb2951411/ToneLib-GFX/icon.png", "author": "ToneLib", "downloadCount": 2951, "tags": ["guitar", "audio", "effects", "plugin", "vst", "trial"]}