{"description": "(AKA Tonido Lite and Tonido Desktop)\n\n##Your Own Free Personal Cloud\n\nTonido Server allows you to access all your files on your computer from a web browser, smartphone, tablet or even DLNA enabled devices.\n\nSimple setup. Start your own Personal Cloud in minutes.\n\nEasy to get started: just install the Tonido Server software and your computer turns into a private cloud server.\n\nEasy to remember link to your computer. e.g.: http://john.tonidoID.com.\n\nIdeal as a personal cloud server or a home cloud server. Your files reside on your computer not on a third party server.\t\n\n###SECURE ACCESS, FILE SHARING, SYNC AND BACKUP\nAccess your files from anywhere. Share large files and folders with family, friends and colleagues. Setup public direct links so anyone can access the content or create a secure private share that only authorized people are allowed to access them. Backup and sync any number of folders.\n\n###ENJOY YOUR PHOTOS, MUSIC AND VIDEOS FROM ANYWHERE\nUltra Fast, High Performance Media Organization. Quickly stream your entire media collection to any device.You are no longer limited by your phone's or tablet's capacity.\n\n###WORKS UNIVERSALLY\nWorks on Windows, Linux, Mac and all major mobile phones and tablets including iPhone, iPad, Android and Windows Phone. Works on Raspberry Pi.\n\n###AUTOMATICALLY BACKUP PHOTOS FROM YOUR PHONE\nAutomatically backup photos/video from Android/iPhone to your Personal Cloud without user intervention.\n\n###HAVE YOUR OWN LOGO, BRANDING, IDENTITY\nYou can customize the branding to what you want to make the Tonido space your own. You can even run the service using your own custom domain name.\n\n###PRIVATE AND SECURE\nBy providing direct access to your files on your computer, you can rest assured that your data stays with you, providing complete privacy and control.\n\nTrusted by world leading organizations in 90 countries\n\nWorks on Windows 2000, XP, Vista, Windows 7, Windows 8 and Windows 10 running on Intel x86 (32-bit or 64-bit)\n\n**PACKAGING NOTE:** This program is updated semi-frequently. The download link remains the same, but the checksum changes with each new release. If you get an error installing it please try --ignore-checksums and report the new version in Disquss or create an issue on GitHub.", "updated": "2024-03-11T13:03:26Z", "galleryUrl": "https://community.chocolatey.org/packages/tonido-server/14.90.0.34042", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tonido-server/14.90.0.34042", "licenseUrl": "http://www.tonido.com/tos/", "packageName": "tonido-server", "displayName": "Tonido Server (Install)", "summary": "Tonido allows you to host your own personal cloud drive and media server.", "version": "14.90.0.34042", "icon": "http://www.tonido.com/images/app_screenshot_default.png", "author": "CodeLathe", "downloadCount": 1011, "tags": ["codelathe", "tonido", "cloud", "home", "server", "admin"]}