{"description": "Toolwiz Time Freeze is an easy and effective Instant system restore software to keep your system safe and protect your computer from unwanted changes.\nTurnning on the Time Freeze mode, the whole system is running in the sandbox. Only the changes to the files in the exclusion list will be saved.\n\n## Features\n\n### Implement of Virtualization\nCreate a virtual environment as a copy of the real system where allows an unmodified operating system with all of its installed software to run, keeping your actual system ‘frozen’ and away from unwanted changes and malicious threats. Nothing bad can happen to your PC while Toolwiz Time Freeze is up and running.\n\n### Real Time Protection\nRun multiple operation systems (real&virtual systems) at the same time on the same PC without reboot and easily switch between them to optimize your PC resources and improve efficiency.\n\n### Infrastructure Consolidation\nConsolidate the management and utilization of your system’s resources to help you build a more flexible and responsive IT infrastructure.\n\n### Restore & Recovery\nNo matter what changes are made, no matter what happens, a simple restart will return things to the way they were. Modifications made to the settings can be undone, files downloaded from the web can be removed, and other unwanted changes will all can be undone when you restart your PC.\n\n## Support OS\nWinXP/Win2003/Vista/Win7/Win8/Win10(32/64bit)\n\n## Requirement\nDisable the scheduler defrag and backup of Windows.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/toolwiz-time-freeze/screenshot.png)", "updated": "2024-03-22T21:03:29Z", "galleryUrl": "https://community.chocolatey.org/packages/toolwiz-time-freeze/4.3.1.5000", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/toolwiz-time-freeze/4.3.1.5000", "licenseUrl": "", "packageName": "toolwiz-time-freeze", "displayName": "Toolwiz Time Freeze", "summary": "Toolwiz Time Freeze is an easy and effective Instant system restore software to keep your system safe and protect your computer from unwanted changes.", "version": "4.3.1.5000", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/toolwiz-time-freeze/toolwiz-time-freeze.png", "author": "ToolWiz Team.", "downloadCount": 674, "tags": ["toolwiz-time-freeze", "instant", "system", "restore"]}