{"description": "# Torguard VPN Client\n\nEvery internet connection, regardless of personal or public wifi, binds you to the \"terms and conditions\" of that provider. Many times, these terms of usage are vague, leaving the safety of your personal data to be determined by a policy you probably don’t have access to. One doesn't have to be doing anything illegal either – there are many documented cases in which personal freedoms have been violated by ISP’s, website owners, and search engines. At TorGuard VPN, we believe every law abiding citizen has the right to encrypt and protect their personal data online.\nBig businesses wouldn’t think of risking company secrets on an unsecured connection, so why should you?\n\nTorGuard VPN service protects your online identity by providing you an anonymous IP address to hide behind. By using an encrypted VPN tunnel, this makes it impossible for your personal IP address or internet usage to be captured. Not even an external ISP, website, or search engine will be able to determine your real IP address. TorGuard anonymous VPN provides access to 1600+ Servers in over 50+ countries with just the click of a button. Take back your online privacy today and surf the web in complete privacy.\n\n## Notes\n\nThis software requires a subscription to the [TorGuard VPN Service](https://torguard.net) in order to work.\n\n## Maintainer's Note\n\nI produce and maintain Chocolatey packages in my spare time, for free. If you use my packages, and appreciate the time and effort I put into making and maintaining them, please consider [making a small donation](https://www.buymeacoffee.com/jtcmedia). Thank-you!", "updated": "2024-03-23T18:33:35Z", "galleryUrl": "https://community.chocolatey.org/packages/torguard-client/4.8.28", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/torguard-client/4.8.28", "licenseUrl": "https://torguard.net/terms.php", "packageName": "torguard-client", "displayName": "TorGuard VPN Client (Install)", "summary": "TorGuard offers easy to setup VPN software for any operating system or device! Simply install the app, select your server, and sign in to connect within seconds!", "version": "4.8.28", "icon": "https://cdn.rawgit.com/jtcmedia/chocolatey-packages/torguard-icon/icons/torguard-client.png", "author": "TorGuard.net", "downloadCount": 24755, "tags": ["torguard-client", "admin", "vpn", "networking"]}