{"description": "TortoiseSVN is a really easy to use Revision control / version control / source control software for Windows. It is based on [Apache Subversion (SVN)](http://subversion.apache.org/).\n\nTortoiseSVN is implemented as a Windows shell extension. It's intuitive and easy to use, since it doesn't require the Subversion command line client to run and provides revision information graphically with overlay icons. TortoiseSVN is free to use, even in a commercial environment.\n\n## Features\n\n* Easy to use\n* all commands are available directly from the Windows Explorer.\n* only commands that make sense for the selected file/folder are shown. You won't see any commands that you can't use in your situation.\n* See the status of your files directly in the Windows explorer\n* descriptive dialogs, constantly improved due to user feedback\n* allows moving files by right-dragging them in the Windows explorer\n* All Subversion protocols are supported - http, https, svn, svn, file, svn+XXX\n* Powerful commit dialog\n* integrated spell checker for log messages\n* auto completion of paths and keywords of the modified files\n* text formatting with special chars\n* The big picture\n* Can create a graph of all revisions/commits. You can then easily see where you created a tag/branch or modified a file/folder\n* Graphs of commit statistics of the project\n* Easy comparing of two branches or tags\n* Per project settings\n* minimum log message length to avoid accidentally committing with an empty log message\n* language to use for the spell checker\n* Integration with issue tracking systems\nTortoiseSVN provides a flexible mechanism to integrate any web based bug tracking system.\n* A separate input box to enter the issue number assigned to the commit, or coloring of the issue number directly in the log message itself\n* When showing all log messages, an extra column is added with the issue number. You can immediately see to which issue the commit belongs to.\n* Issue numbers are converted into links which open the webbrowser directly on the corresponding issue\n* Optional warning if a commit isn't assigned to an issue number\n* Helpful Tools\n* TortoiseMerge\n* Shows changes you made to your files\n* Helps resolving conflicts\n* Can apply patchfiles you got from users without commit access to your repository\n* TortoiseBlame: to show blames of files. Shows also log messages for each line in a file.\n* TortoiseIDiff: to see the changes you made to your image files\n* SubWCRev: to include the revision numbers/dates/... into your source files\n* Available in many languages\n* TortoiseSVN is stable\n* Before every release, we create one or more \"release candidates\" for adventurous people to test first.\n* During development cycles, many people test intermediate builds. These are built every night automatically and made available to all our users. This helps finding bugs very early so they won't even get into an official release.\n* A big user community helps out with testing each build before we release it.\n* A custom crash report tool is included in every TortoiseSVN release which helps us fix the bugs much faster, even if you can't remember exactly what you did to trigger it.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/tortoisesvn/1.14.5.29465", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/tortoisesvn/1.14.5.29465", "licenseUrl": "https://sourceforge.net/p/tortoisesvn/code/HEAD/tree/trunk/src/COPYING.txt", "packageName": "tortoisesvn", "displayName": "TortoiseSVN", "summary": "Subversion® source control management client implemented as File Explorer shell extension", "version": "1.14.5.29465", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@81c6df0de9bb542ecc516c813101d10525c74e51/icons/tortoisesvn.png", "author": "TortoiseSVN Team", "downloadCount": 591532, "tags": ["svn", "subversion", "scm", "version-control", "admin", "foss"]}