{"description": "TortoiseGit is a Windows Shell Interface to Git and based on TortoiseSVN.\nTortoiseGit supports you with regular tasks, such as committing, showing logs, diffing two versions, creating branches and tags, creating patches and so on.\n\nSince it's not an integration for a specific IDE like Visual Studio, Eclipse or others, you can use it with whatever development tools you like, and with any type of file.\nMain interaction with TortoiseGit will be using the context menu of the Windows explorer.\n\n## Features\n\n* Easy to use\n* all commands are available directly from the Windows Explorer ([see screenshots](https://tortoisegit.org/about/screenshots/#Explorer_integration)).\n* only commands that make sense for the selected file/folder are shown. You won't see any commands that you can't use in your situation.\n* See the status of your files directly in the Windows explorer ([see screenshots](https://tortoisegit.org/about/screenshots/#Overlay_icons_in_explorer))\n* descriptive dialogs, constantly improved due to user feedback\n* allows moving files by right-dragging them in the Windows explorer\n* Powerful commit dialog ([see screenshots](https://tortoisegit.org/about/screenshots/#Commit_Dialog))\n* integrated spell checker for log messages\n* auto completion of paths and keywords of the modified files\n* text formatting with special chars\n* Per project settings\n* minimum log message length to avoid accidentally committing with an empty log message\n* language to use for the spell checker\n* Integration with issue tracking systems\nTortoiseGit provides a flexible mechanism to integrate any web based bug tracking system.\n* A separate input box to enter the issue number assigned to the commit, or coloring of the issue number directly in the log message itself\n* When showing all log messages, an extra column is added with the issue number. You can immediately see to which issue the commit belongs to.\n* Issue numbers are converted into links which open the webbrowser directly on the corresponding issue\n* Optional warning if a commit isn't assigned to an issue number\n* Helpful Tools\n* TortoiseGitMerge ([see screenshot](https://tortoisegit.org/about/screenshots/#TortoiseGitMerge) and the [TortoiseGitMerge manual](https://tortoisegit.org/docs/tortoisegitmerge/))\n* Shows changes you made to your files\n* Helps resolving conflicts\n* Can apply patchfiles you got from users without commit access to your repository\n* TortoiseGitBlame: to show blames of files. Shows also log messages for each line in a file. ([see screenshot](https://tortoisegit.org/about/screenshots/#TortoiseGitBlame))\n* TortoiseGitIDiff: to see the changes you made to your image files ([see screenshot](https://tortoisegit.org/about/screenshots/#TortoiseGitMerge))\n* Available in many languages\n* TortoiseGit is stable\n* Before every release, we create one or more [preview releases](https://download.tortoisegit.org/tgit/previews/) for \"adventurous\" people to test first. This helps finding bugs very early so they won't even get into an official release.\n* A custom crash report tool is included in every TortoiseGit release which helps us fix the bugs much faster, even if you can't remember exactly what you did to trigger it.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/TortoiseGit/2.15.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/TortoiseGit/2.15.0", "licenseUrl": "http://www.gnu.org/licenses/old-licenses/gpl-2.0.html", "packageName": "TortoiseGit", "displayName": "TortoiseGit", "summary": "TortoiseGit provides overlay icons showing the file status, a powerful context menu for Git and much more!", "version": "2.15.0", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@25a40985eb12778b130d754058887895f8b1bc40/icons/tortoisegit.png", "author": "TortoiseGit and contributors", "downloadCount": 948888, "tags": ["git", "version-control", "dvcs", "admin", "foss"]}