{"description": "A lightweight (uses a few MB of RAM and almost no CPU) utility that makes the Windows taskbar translucent/transparent on Windows 10.\n\n## Features\n\n* Advanced color picker supporting alpha and live preview to change the taskbar's color.\n* Taskbar states (choose one - color can be customized on every state except Normal):\n    * Normal: Regular Windows style. (as if TranslucentTB was not running)\n    * Opaque: Tinted taskbar, without transparency.\n    * Clear: Tinted taskbar.\n    * Blur: Will make the taskbar slightly blurred.\n    * Acrylic: Will give the taskbar an appearance similar to Microsoft's Fluent Design guidelines.\n* Dynamic modes (these can be used together and each of them provides a taskbar state and color you can customize):\n    * Dynamic Windows: Will change the taskbar to a different appearance if a window is currently maximised.\n    * Dynamic Start Menu: Will change the taskbar appearance when the start menu is opened.\n    * Dynamic Cortana: Will change the taskbar appearance when Cortana (or the search menu if Cortana is disabled) is open.\n    * Dynamic Timeline: Will change the taskbar appearance when the Timeline is open.\n* Ability to show or hide the Aero Peek button. Can be customized at will or dynamic.\n\nYou can see it in action [here](https://gfycat.com/TidyFelineCrownofthornsstarfish) (short) and [here](https://gfycat.com/ConsciousCriminalDassie) (longer).\n\n**NOTE**: This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-24T00:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/translucenttb/2024.1.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/translucenttb/2024.1.0", "licenseUrl": "https://github.com/TranslucentTB/TranslucentTB/blob/master/LICENSE.md", "packageName": "translucenttb", "displayName": "TranslucentTB", "summary": "A lightweight (uses a few MB of RAM and almost no CPU) utility that makes the Windows taskbar translucent/transparent on Windows 10.", "version": "2024.1.0", "icon": "https://cdn.jsdelivr.net/gh/pauby/ChocoPackages@4348898/icons/translucenttb.png", "author": "Charles Milette", "downloadCount": 15712, "tags": ["admin", "taskbar", "windows"]}