{"description": "Simple. Powerful. Innovative\nTranswiz makes it easy to transfer your personal data and settings to a new computer:\n\n\nSimple Wizard interface for backing up and restoring user profiles\nAutomatically converts Windows 7 profiles to Windows 10\nMulti-language support\nCreates a standard zip archive\nCommand-line interface to automate transfers\nTransfer from Windows XP/Vista/Windows 7/Windows 8 and Windows 10\nBackup additional folder locations\nAutomatically join a domain\nFreeware Edition\n\nAbsolute Simplicity\nIn developing Transwiz - User Profile Transfer Wizard - we want to create a method of transferring user profile data and settings between computers that is as simple as it is powerful.\n\nTranswiz will pack your existing personal data and settings into a standard zip archive for easy transfer to another computer. The Wizard will then unpack the archive on the new computer and restore your user profile - automatically reconfiguring the profile as necessary for the new Operating System. The Wizard will also rename the new computer and join it to your domain as required.\n\nTranswiz can transfer profile data from Windows XP, Vista, Windows 7, Windows 8 and Windows 10, and to machines running Windows XP, Windows 7, and Windows 10. You can use the same archive file to transfer your user profile to and from 32-bit and 64-bit versions of Windows.\n\n\nAny account, any domain, any language\nTranswiz enables you to move a user's profile and assign it to any user account on any domain in any language. By separating the user account from the user data, Transwiz enables you to move user accounts as well as computers.", "updated": "2024-03-23T23:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/transwiz-new/1.19", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/transwiz-new/1.19", "licenseUrl": "https://www.forensit.com/Move/END-USER LICENSE AGREEMENT.rtf", "packageName": "transwiz-new", "displayName": "Transwiz - User Profile Transfer Wizard", "summary": "Personal and Professional Editions\nTranswiz comes in two editions.\n\nThe Personal Edition of Transwiz is Freeware and offers a simple Wizard interface to transfer profile data between Windows workstations.\n\nTranswiz Professional Edition adds a command-line interface enabling you to automate the transfer of multiple profiles using scripting. You can also backup and restore additional folders outside of the user's profile, exclude specific file types, and save your transfer settings in a configuration file. The Professional Edition is licensed per technician with no limit on the number of workstations that can be migrated.", "version": "1.19", "icon": "https://rawcdn.githack.com/boubou/chocolatey/efcb72874242c148f5dc94b040c21379e5d044e8/packages/icons/transwiz.jpg", "author": "ForensiT Ltd", "downloadCount": 2014, "tags": ["transfer", "user", "data", "other", "computer"]}