{"description": "Keeping track of disk space and tidying it up\n\nWith TreeSize, you can analyze your most important storage systems and directly manage and clean up your files. You can evaluate space usage with statistics and charts, create reports or search for old or duplicate files based on specific criteria – manually, or automatically according to a schedule.\n\nTreeSize can move, archive, delete, but also bulk rename files across systems and much more. Organizing and cleaning up has never been easier.\n\t\t\nTreeSize can be started from the context menu of a folder or drive and shows you the size of this folder, including its subfolders. Expand folders in an Explorer-like fashion and see the size of every subfolder. All results can also be drilled down to the file level. \nThe Explorer context menu is supported within TreeSize, as well as the usual drag & drop operations.\n\nInstallation instructions:\nTreeSize is automatically installed in English to \"Program Files (x86)\\JAM Software\\TreeSize\" (64 Bit).\nThere are two parameter you can give to the installer if you add \"-params\" to the installation command:\n\n1. \"/dir=Your_Dir\"\nChanges the installation location to \"Your_Dir\".\n\n2. \"/lang=DE\"\nChanges the language from English to German. Other languages are also available (but can be changed in the options dialog later as well).\n\nExample:\ncinst treesize -params \"/dir=C:\\Users\\Administrator\\Admin Tools\\ /lang=de\"", "updated": "2024-03-23T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/treesize/9.1.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/treesize/9.1.3", "licenseUrl": "https://www.jam-software.com/company/license_agreement.shtml", "packageName": "treesize", "displayName": "TreeSize", "summary": "The powerful graphical manager for your storage systems", "version": "9.1.3", "icon": "https://www.jam-software.com/sites/default/files/img/icons/TreeSize-Icon.png", "author": "JAM Software GmbH", "downloadCount": 13370, "tags": ["system", "size", "management", "disk", "free", "space", "available", "harddisk", "harddrive"]}