{"description": "Trojita is a fast Qt IMAP e-mail client. Our mission is to deliver an application which:\n\nEnables you to access your mail anytime, anywhere.\nDoes not slow you down. If we can improve the productivity of an e-mail user, we better do.\nRespects open standards and facilitate modern technologies. We value the vendor-neutrality that IMAP provides and are committed to be as interoperable as possible.\nIs efficient -- be it at conserving the network bandwidth, keeping memory use at a reasonable level or not hogging the system's CPU.\nCan be used on many platforms. One UI is not enough for everyone, but our IMAP core works fine on anything from desktop computers to cell phones and big ERP systems.\nPlays well with the rest of the ecosystem. We don't like reinventing wheels, but when the existing wheels quite don't fit the tracks, we're not afraid of making them work.\n\nBeing Fast\nAre you tired of other mail programs taking ages to open a \"big mailbox\"? A unique feature of Trojitá is that it is designed from the ground up to be fast -- opening a mailbox with tens of thousands of messages is something which Trojitá is very good at. There is no need to wait for all messages being downloaded -- or to download them at all.\n\nRespecting Standards\nTrojitá's development is conducted with standard conformance in mind. We will never break an Internet standard knowingly, and all possible deviations from best practices will be fixed quickly. We care about the future of IMAP and other e-mail related protocols, we take part in the IETF discussions and have proposed quite a few improvements already. Our aim is to support all useful IMAP extensions to make the user experience better.\n\nEfficiency\nConserving resources is something which we take very seriously -- be it network bandwidth, memory usage or CPU/energy/battery consumption. Among other things, Trojitá implements IMAP's QRESYNC, CONDSTORE, ESEARCH, CATENATE, BURL, COMPRESS=DEFLATE, CONTEXT=SORT extensions (and many more!). Data which were transfered once will not be downloaded again.\nCross-platform Support\n\nTrojitá works well on any reasonable desktop computer thanks to the power of the Qt library -- be it Linux, Windows or a Mac. We don't care what desktop environment you run, but we try to fit into KDE and Gnome if that's what you prefer. Trojitá is also available on cell phones with an optimized, touch-friendly user interface. The same core IMAP library also powers an enterprise CRM product.\n\nWhat Trojitá is not:\nA full PIM suite. That's something which we leave to other applications, so you won't find a fully fledged calendar in Trojitá. But you might help us make Trojitá a part of a fully-fledged PIM if you're interested.\nA POP3 client. Trojitá works by accessing a remote mail store over the IMAP protocol. POP3 cannot work this way for technical reasons.\nFeature complete. Perhaps something which you would really like to see is still missing from Trojitá. We are working pretty hard on making Trojitá the best MUA, but we could definitely use a help.\n\nSome highlights of Trojitá are:\nA pure Qt5 application with no additional dependencies\nRobust IMAP core implemented using Qt's Model-View framework\nStandards compliance is a design goal\nOn-demand message list and body part loading\nOffline IMAP support\nSupport for bandwidth-saving mode aimed at mobile users with expensive connection\nOpenPGP and S/MIME cryptography\nSafe and robust dealing with HTML mail\nIMAP over SSH -- in addition to usual SSL/TLS connections, the server could be accessed via SSH", "updated": "2024-03-16T08:33:42Z", "galleryUrl": "https://community.chocolatey.org/packages/trojita/0.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/trojita/0.7", "licenseUrl": "https://www.gnu.org/licenses/gpl.html", "packageName": "trojita", "displayName": "Trojitá", "summary": "Trojitá, a Qt IMAP e-mail client.", "version": "0.7", "icon": "https://gitlab.com/dimqua/choco/raw/master/icons/trojita.png", "author": "Trojita team", "downloadCount": 7146, "tags": ["trojita", "e-mail", "qt", "qt5", "kde", "mail", "client", "imap", "admin"]}