{"description": "---\n\n### [choco://trojan-remover](choco://trojan-remover)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n\n---\n\n![Screenshot of Trojan Remover](http://www.simplysup.com/tremover/images/screen1_small.png)\n![Screenshot of Trojan Remover](http://www.simplysup.com/tremover/images/scanshot_small.png)\t\n\n\n \t \t \t\n \nTrojan Remover aids in the removal of Malware - Trojan Horses, Worms, Adware, Spyware - when standard anti-virus software either fails to detect them or fails to effectively eliminate them. Standard antivirus programs are good at detecting this Malware, but not always good at effectively removing it.\n\n \n\nTrojan Remover runs on Windows XP, Windows Vista, Windows 7 and 8, through to the latest Windows 10.\n\nThe majority of Virus and Trojan Scanners are well able to detect malicious software - Trojan Horses, Internet Worms, Adware/Spyware etc. - but are not always very efficient in removing them once they have been triggered. \n\nTrojan Remover is designed specifically to disable/remove Malware without the user having to manually edit system files or the Registry. The program also removes the additional system modifications some Malware carries out which are ignored by standard antivirus and trojan scanners.\n\n \n\nTrojan Remover scans ALL the files loaded at boot time for Adware, Spyware, Remote Access Trojans, Internet Worms and other malware. Trojan Remover also checks to see if Windows loads Files/Services which are hidden by Rootkit techniques and warns you if it finds any.\n\nThis essential security utility is available for you to try out FREE. Download a fully-working evaluation copy today. The program will work for 30 days before you need to decide whether you would like to register it.\n\nThe registration fee for Trojan Remover is US$24.95. This fee covers all database updates and future program updates for 1 year from the date of registration. The fee for renewals in subsequent years is currently set at US$17.95 per year. You can install Trojan Remover on up to 3 additional computers, for no extra charge. EU residents will also have to pay VAT at the standard rate applicable in their country.\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/trojan-remover/readme.md)**\n    \n\n---\n\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n\n---", "updated": "2024-03-20T15:33:27Z", "galleryUrl": "https://community.chocolatey.org/packages/trojan-remover/6.9.5.2966", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/trojan-remover/6.9.5.2966", "licenseUrl": "", "packageName": "trojan-remover", "displayName": "Trojan Remover (Trial) (Install)", "summary": "Trojan Remover aids in the removal of Malware - Trojan Horses, Worms, Adware, Spyware - when standard anti-virus software either fails to detect them or fails to effectively eliminate them. Standard antivirus programs are good at detecting this Malware, but not always so good at effectively removing it.", "version": "6.9.5.2966", "icon": "https://cdn.staticaly.com/gh/bcurran3/ChocolateyPackages/master/trojan-remover/trojan-remover_icon.png", "author": "Simply Super Software", "downloadCount": 5509, "tags": ["trojan", "remover", "malware", "adware", "worms", "spyware", "virus", "trial", "notsilent", "binary"]}