{"description": "Twisted is a networking engine written in Python, supporting numerous protocols. It contains a web server, numerous chat clients, chat servers, mail servers, and more.  Twisted is made up of a number of modules for many different purposes, including the following:\n\n#### twisted.application\nA \"Service\" system that allows you to organize your application in hierarchies with well-defined startup and dependency semantics,\n\n#### twisted.cred\nA general credentials and authentication system that facilitates pluggable authentication backends,\n\n#### twisted.enterprise\nAsynchronous database access, compatible with any Python DBAPI2.0 modules\n\n#### twisted.internet\nLow-level asynchronous networking APIs that allow you to define your own protocols that run over certain transports\n\n#### twisted.manhole\nA tool for remote debugging of your services which gives you a Python interactive interpreter\n\n#### twisted.protocols\nBasic protocol implementations and helpers for your own protocol implementations,\n\n#### twisted.python\nA large set of utilities for Python tricks, reflection, text processing, and anything else,\n\n#### twisted.spread\nA secure, fast remote object system,\n\n#### twisted.trial\nA unit testing framework that integrates well with Twisted-based code.\n\nTwisted supports integration of the Win32, Tk, GTK+ and GTK+ 2 event loops with its main event loop.  There is experimental support for Mac OS X and wxPython event loop integration, which you use at your peril.\n\nThere are many official [Twisted subprojects](http://twistedmatrix.com/trac/wiki/TwistedProjects), including clients and servers for web, mail, DNS, and more.\n\n#### Resources\n* [Community](https://twistedmatrix.com/trac/wiki/TwistedCommunity)\n* [API reference](http://twistedmatrix.com/documents/current/api/)", "updated": "2024-03-23T16:03:31Z", "galleryUrl": "https://community.chocolatey.org/packages/twisted/15.4.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/twisted/15.4.0", "licenseUrl": "http://twistedmatrix.com/trac/export/43938/trunk/LICENSE", "packageName": "twisted", "displayName": "Twisted", "summary": "Event-driven framework for internet applications", "version": "15.4.0", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/eb824d7a427a4db7174b3d26161fc65642a670ed/icons/twisted.svg", "author": "Glyph Lefkowitz", "downloadCount": 2305, "tags": ["framework", "network", "protocol"]}