{"description": "WebTools 2.x is a collection of utilities to help with the management of your Plex Server. \nThis plugin is not limited to the usual channel interface. Instead, it utilizes a built-in webserver to display a responsive web interface which also works on mobile devices, allowing you to manage your Plex Server from any device.\nThis tool was created by Dagalufh (Frontend) and Dane22 (Backend) with the beta testing from:\n\n* OttoKerner\n* sa2000\n* trumpy81\n* Xandi92\n* chuckpa\n\n##Currently the tools available are:\n\n###Logviewer\nThis tool allows for easy viewing of logs related to Plex and it's plugins via an easy to use web interface. It also gives you the ability to download all of the logs in a .zip file to easily send to a developer of a specific plugin.\n(This includes logs of 3rd party plugins, contrary to the Log download button in Plex Web.)\n\n###Subtitle Management\nThe purpose of this tool is to give the user a way to manage subtitles that are not embedded.\nCurrent features:\n\n* View the content of a subtitle file for easier identification.\n* Highlights the subtitle that is selected as active in Plex for a specific Movie or Episode\n* Removal of one or more subtitles. Usage is on your own risk as this will delete files on your hard drive.\n\n###Unsupported AppStore\nThis tool was originally created by mikedm139 and was one of the most popular plugins in the Plex universe. Now, this is included in WebTools 2.0, giving it an easy to use web interface that allows for quick installation/removal/update of plugins.\n\n###FindMedia\nThis tool will quickly search a library, and then compare the items in the Plex database to the actually accessible media files on disk. It will then list all missing items from either the Plex Media Server database, or from your file system. This tool combines the outcome from the 3rd party plugins \"Find-Missing\" and \"Find-Unmatched\".\nFind-Unmatched is due to that discontinued, and removed from UAS.", "updated": "2024-03-20T19:48:31Z", "galleryUrl": "https://community.chocolatey.org/packages/uas-plex/2.4.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/uas-plex/2.4.1", "licenseUrl": "", "packageName": "uas-plex", "displayName": "Unsupported AppStore for Plex", "summary": "", "version": "2.4.1", "icon": "", "author": "Mikael Aspehed", "downloadCount": 1442, "tags": ["webtools", "unsupported", "appstore", "uas", "plex", "admin"]}