{"description": "Ubisoft Connect is the ecosystem of players services for Ubisoft games across all platforms. It aims at giving the best environment for all players to enjoy their games and connect with each other whatever the device.\n\nUbisoft Connect is a free service available on all devices. You can access it on your PC, through a mobile app, or even directly from your games. All you need to login is a [Ubisoft Account](https://ubisoftconnect.com/)!\n\n## Features\n\n### One network for all players\n\n**Connect with players across all platforms, for all games**\nWhether you play on PC or console, you'll be part of a global network of Ubisoft players with access to all the same services. Regular updates will provide you with more ways to interact with an ever-growing community.\n\nFind friends on all platforms, see what they're playing, and check their achievements.\n\n**Keep your progression on all devices**\nFor our newest releases, all your game progression is saved within Ubisoft Connect, so you won't lose a step if you change consoles or switch to PC.\n\n### Endless celebration\n\n**Win more**\nOver 1000 free rewards are available across our back catalogue of games.\n\nOn our latest titles, unlock legendary weapons, character outfits, emotes, and consumables just by playing your games. Every time you level up in Ubisoft Connect, you'll earn [Units](https://ubisoftconnect.com/en-GB/units/) you can spend on unique rewards.\n\nLearn more about our loyalty program [here](https://ubisoftconnect.com/en-GB/faq/#loyalty-program).\n\n**20% off the Ubisoft Store**\nRedeem 100 Units to get 20% off your next purchase in the Ubisoft Store.\n\n### Know more and improve\n\n**Access your stats at any time and compare with your friends**\nKeep up to date with your stats, progression and performance in your favorite games.\n\nCompare yourself with your friends, no matter what platform they are playing on.\n\n**Get Smart Intel to improve your next session**\nBefore starting your game session, get highlights of your best performances, along with some personalized tips based on your playstyle.\n\n**Don't miss any news or events on your favorite games**\nCheck your feed to get all the latest news on your games: upcoming seasons, new challenges, and rewards... We'll give you everything you need to know about the games you love.", "updated": "2024-03-24T00:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/ubisoft-connect/150.1.0.11037", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ubisoft-connect/150.1.0.11037", "licenseUrl": "https://legal.ubi.com/eula/", "packageName": "ubisoft-connect", "displayName": "Ubisoft Connect", "summary": "Ubisoft Connect is a cross-platform service available in more than 50 games. It enables actions, rewards and social interactions.", "version": "150.1.0.11037", "icon": "https://cdn.jsdelivr.net/gh/AdmiringWorm/chocolatey-packages@c83e5c78e07916aca67a4eabb48fc5b81f17cef7/automatic/ubisoft-connect/icons/128x128.png", "author": "Ubisoft Entertainment", "downloadCount": 137334, "tags": ["ubisoft-connect", "uplay", "ubisoft", "ubisoft-client", "games-distributor", "games-delivery", "ubisoft-downloader", "game-downloader", "gaming"]}