{"description": "Still trying to remember ALT codes for accented characters, or using Character Map to insert symbols? There is an easier way...\n\nIf you frequently work with foreign languages, you may well find it awkward to type accented characters, symbols or other characters not represented on the standard UK keyboard. This was a problem I also had, until I was introduced to the Windows \"United States International keyboard\", which is a keyboard layout you can install in Windows that enables you to easily type the accented characters used in major European languages, using the AltGr key on the keyboard to access the additional characters. The problem with the US International keyboard is that, as its name implies, it is based on the US keyboard and therefore double-quote, at sign, hash sign and so on are in the wrong place.\n\nFortunately, there is a little-known Microsoft utility called the Microsoft Keyboard Layout Creator, which is ideal for inveterate fiddlers like me. I've used it to put together a UK International keyboard, based on the UK keyboard layout but using the principles of the US International keyboard (retaining, in most cases, the established positioning of the various accented characters and symbols). I have also extended the layout to include more symbols (typically, stuff that I, as a translator and editor, need to be able to type from time to time, but also anything else I thought might be helpful to other users) and to cover more languages.", "updated": "2024-03-07T16:03:22Z", "galleryUrl": "https://community.chocolatey.org/packages/ukinternationalkeyboard/2.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ukinternationalkeyboard/2.0.0", "licenseUrl": "", "packageName": "ukinternationalkeyboard", "displayName": "UK International Keyboard", "summary": "UK-based keyboard layout with support for many symbols / accents", "version": "2.0.0", "icon": "https://cdn.jsdelivr.net/gh/mfschumann/chocolatey-packages@66324faf67cc68bd3f87e7815c126a03917c4d35/ukinternationalkeyboard/ukinternationalkeyboard.png", "author": "James Campbell", "downloadCount": 439, "tags": ["keyboard", "layout", "uk"]}