{"description": "ULSViewer allows users with access to ULS log files to view their logs in a more user friendly interface instead of using standard log file viewers. Logs opened can be filtered, sorted, highlighted, appended, etc in order to single out the data that is important to the user. This information can be used to diagnose problems with machines running ULS services, or to monitor machines and the events they create.\n\nThe ULSViewer tool runs on either 32 or 64 bit architectures of Microsoft Windows 2003 Server, Windows 2008 Server, Windows 2008 Server R2, Windows 7, Windows Vista, and Windows XP.\n\nFeatures\nThe ULSViewer tool performs various actions against the data from ULS log files in order to better analyze it. ULSViewer allows the user to: \nHighlight data of importance to the user on the fly\nBookmark log entries\nAppend logs to other logs in order to track trends\nHide unimportant data\nOnly view critical log entries by sorting data by severity\nWrite rules to prompt the user when certain events occur\nView your data in a spreadsheet instead of the text file ULS generates\nMonitor remote machines logs that are running ULS services\nOpen multiple logs at the same time in order to compare log files.\nOpen logs files from multiple machines at the same time.", "updated": "2024-03-22T06:03:31Z", "galleryUrl": "https://community.chocolatey.org/packages/ulsviewer/16.0.3129.1000", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/ulsviewer/16.0.3129.1000", "licenseUrl": "http://archive.msdn.microsoft.com/ULSViewer/Project/License.aspx", "packageName": "ulsviewer", "displayName": "ULSViewer", "summary": "ULSViewer allows users to open a ULS log file and display its contents in a user friendly format. Users can then perform advanced functions such as filtering, sorting, highlighting, loading logs, appe", "version": "16.0.3129.1000", "icon": "", "author": "Microsoft", "downloadCount": 9861, "tags": ["SharePoint", "SP2007", "SP2010", "SP2013", "chocolatey", "ULS"]}