{"description": "Serverless backup solution with client side encryption with the following features.\n\n* Public key based encryption allows continuously running backups that can only be read with a key not available on the server running the backup.\n\n* Ties into [a free service](https://underscorebackup.com/) that helps coordination of your backup sources, optional encryption key recovery and coordination of sharing of backup data. However, all online services are optional, and you can run the backup software without an online account.\n\n* Provides optional [paid for storage service](https://underscorebackup.com/pricing) as part of the service offering. This is entirely optional and you can use any supported storage service you wish.\n\n* Pre-egress encryption means no proprietary data leaves your system in a format where it can be compromised as long as your private key is not compromised.\n\n* Allow selective sharing of backup data with other participants with complete cryptographically enforced security.\n\n* Designed from the ground up to manage very large backup sets with multiple TB of data and millions of file in a single repository.\n\n* Multi-platform support based on Java 17. Linux, Windows and MacOS are supported platforms, but should run anywhere Java 17 is supported.\n\n* Low resource requirements, runs efficiently with 256MB of heap memory even if the backup sets have millions of files and terabytes of data.\n\n* Efficient storage of both large and small file with built-in deduplication of data.\n\n* Handles backing up large files with small changes in them efficiently.\n\n* Optional error correction to support unreliable storage destinations.\n\n* Encryption, error correction and destination IO are plugin based and easily extendable.\n\n* Supports Dropbox, local file, Windows Shares, S3, Wasabi, Backblaze B2 and iDrive E2 for backup destinations.\n\n* Fully fledged web based UI for both initial setup, monitoring and restore operations.", "updated": "2024-03-11T22:33:40Z", "galleryUrl": "https://community.chocolatey.org/packages/UnderscoreBackup/2.2.0.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/UnderscoreBackup/2.2.0.7", "licenseUrl": "https://www.gnu.org/licenses/gpl-3.0.en.html", "packageName": "UnderscoreBackup", "displayName": "Underscore Backup", "summary": "Private, secure backups in the cloud of any size with minimal resource usage exactly the way you want them.", "version": "2.2.0.7", "icon": "https://underscorebackup.com/images/logo.png", "author": "Underscore Research LLC", "downloadCount": 161, "tags": ["underscorebackup", "backup"]}