{"description": "Disable winrm through a self-deleting shutdown task.\n     Many windows remote orchestration tools (e.g. Packer) instruct you to completely open up winrm permissions in a way that is not safe for production.\n     Usually there is no built in method nor instruction on how to re-secure it or shut it back down.\n     The assumption most likely being that you would handle proper winrm re-configuration as a part of production deployment.\n     This is not a least privileged approach - depending on how big your company is and how widely your hypervisor templates are used - this is a disaster waiting to happen.  So I feel leaving it in a disabled state by default is the far safer option.\n     To complicate things, if you attempt to secure winrm or shut it down as your last step in orchestration you slam the door on the orchestration system and it marks the attempt as a failure.\n     Due to imprecise timing, start up tasks that disable winrm could conflict with a subsequent attempt to re-enable it on the next boot for final configuration steps (especially if you are building a hypervisor template).\n     This self-deleting shutdown task performs the disable on the first shutdown and deletes itself.\n     If a system shutsdown extremely quickly there is some risk that the shutdown job would not be deleted - but in testing on AWS (very fast shutdown), there have not been an observed problems.", "updated": "2024-03-23T11:18:30Z", "galleryUrl": "https://community.chocolatey.org/packages/undo-winrmconfig-during-shutdown/1.2.0.20191031", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/undo-winrmconfig-during-shutdown/1.2.0.20191031", "licenseUrl": "", "packageName": "undo-winrmconfig-during-shutdown", "displayName": "undo-winrmconfig-during-shutdown (Install)", "summary": "Attempts to return WinRM to a pristine state after it has been used for system preparation (e.g. Packer) using a self-deleting computer shutdown script.", "version": "1.2.0.20191031", "icon": "https://cdn.rawgit.com/DarwinJS/Undo-WinRMConfig/f9724192/chocolateypackaging/UndoWinRmRemotingicon256.png", "author": "DarwinJS", "downloadCount": 13015, "tags": ["undo-winrmconfig-during-shutdown", "winrm", "packer", "admin"]}