{"description": "Code review, project analytics. Improve your code, project, and process\n\n#### Perform efficient code reviews\n\nAutomate your workflow – let Upsource analyze your code and track the progress, while you focus on improvements.\n\n#### Review changes from IDE\n\nParticipate in discussions and manage your reviews without leaving the comfort of your IDE.\n\n#### Keep up with updates\n\nExplore new changes in the browser with IDE-like navigation, reply by email, and never miss an important change.\n\n#### Discover design flaws\n\nSpot parts of your project in need of a developers’ attention, such as hotspots and abandoned files.\n\n#### Detect project-wide risks\n\nSpread responsibilities and make sure no part of the code is “owned” by a sole developer.\n\n#### Onboard faster\n\nNew team members can quickly learn how the project has evolved and discover the responsibility scopes of other team members.\n\n#### Have fun building awesome software together!\n\nDiscuss changes, @mention others, react to comments, and unlock achievements as you discover new features and help your teammates!\n\n#### Integrate Upsource into your environment\n\nEasily make Upsource part of your process: integrate it with issue trackers, CI servers, and sync with GitHub.\n\n#### Scale it\n\nDon’t worry about outgrowing Upsource! No matter how large your team becomes or how many projects you have, Upsource can handle it.\n\n### Package Specific\n\nUpsource is installed into a folder under `c:\\` using with a version in the directory. eg. `c:\\upsource-2020.1.1802`.", "updated": "2024-03-22T08:48:51Z", "galleryUrl": "https://community.chocolatey.org/packages/upsource/2020.1.1802", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/upsource/2020.1.1802", "licenseUrl": "https://www.jetbrains.com/upsource/buy/license.html", "packageName": "upsource", "displayName": "JetBrains Upsource", "summary": "Improve your code, project, and process", "version": "2020.1.1802", "icon": "https://rawcdn.githack.com/flcdrg/au-packages/b752fcb9e78cdc71e5793c554fc628a81df3ca08/upsource/icons/upsource.png", "author": "JetBrains", "downloadCount": 660, "tags": ["Upsource", "Code", "Review", "JetBrains"]}