{"description": "UrBackup is an easy to setup Open Source client/server backup system, that through a combination of image and file backups accomplishes both data safety and a fast restoration time.\n\nFile and image backups are made while the system is running without interrupting current processes.\n\nUrBackup also continuously watches folders you want backed up in order to quickly find differences to previous backups. Because of that, incremental file backups are really fast.\n\nYour files can be restored through the web interface, via the client or the Windows Explorer while the backups of drive volumes can be restored with a bootable CD or USB-Stick (bare metal restore).\n\nA web interface makes setting up your own backup server really easy. For a quick impression please look at the [screenshots here](https://www.urbackup.org/impressions.html).\n\nCurrently there are over 21,000 running UrBackup server instances (with auto-update enabled) with some instances having hundreds of active clients.\n\n### Installation with Tray Icon\n\nBy default, the client version without tray icon will be installed. To choose the version with tray icon, pass the package parameter `/TrayIcon` during install:\n\n`choco install urbackup-client [other options] --params=\"'/TrayIcon'\"`\n\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.", "updated": "2024-03-23T20:48:38Z", "galleryUrl": "https://community.chocolatey.org/packages/urbackup-client/2.5.25", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/urbackup-client/2.5.25", "licenseUrl": "https://www.gnu.org/licenses/agpl-3.0", "packageName": "urbackup-client", "displayName": "UrBackup-Client (Install)", "summary": "UrBackup is an easy to setup Open Source client/server backup system.", "version": "2.5.25", "icon": "https://rawcdn.githack.com/daerSeebaer/choco-urbackup-server/e60906ca1f204b7194c5efe541a5ad0c610f11a2/UrBackup_icon.png", "author": "Martin Raiber", "downloadCount": 28362, "tags": ["urbackup-client", "admin", "backup"]}