{"description": "## Introduction\n\nThe journal is a log of changes to files on an NTFS volume. Such changes can for instance be the creation, deletion or modification of files or directories. It is optional to have it on, and can be configured with fsutil.exe on Windows. However, it was not turned on by default until Vista and later.\n\n## Details\n\nThe journal, if turned on, can be found in the directory \\$Extend and is named $UsnJrnl (this is not visible in explorer as it is part of the system files on NTFS). Actually it is an alternate data stream $J that contains the relevant data. This stream is usually rather large and can be several GB in size. Thus it may take quite some time to process, if filled up. The file is sparse, so preferrably use the ExtractUsnJrnl tool to extract it.\n\nThe structure is well known and very simple; http://www.microsoft.com/msj/0999/journal/journal.aspx \n\nThe tool supports USN_RECORD_V2 and USN_RECORD_V3, but not USN_RECORD_V4 (introduced in Windows 8.1 and not activated by default.).\n\nThe nice thing about it, is that it contains large amount of historical data.\n\nFrom version 1.0.0.5, all structure members were included in the output.\n\nThe USN_PAGE_SIZE is configurable. The default value is 4096, and should be sufficient for most cases.\n\nTimestamps are written UTC 0.00 by default, but can be configured to anything. The format and precision of the timestamps can also be configured, as well as the millisec/precision separator. See displayed examples in the gui.\n\n## Note on VirusTotal detections\n\nThis application is a compiled [AutoIt](https://www.autoitscript.com/site/) script.\nAutoIt scripts packaged in this way are often incorrectly flagged as malware.\nThis is issue is documented in the AutoIt Wiki here: https://www.autoitscript.com/wiki/AutoIt_and_Malware", "updated": "2024-03-06T14:18:24Z", "galleryUrl": "https://community.chocolatey.org/packages/usnjrnl2csv/1.0.0.24", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/usnjrnl2csv/1.0.0.24", "licenseUrl": "https://github.com/jschicht/UsnJrnl2Csv/blob/master/LICENSE.md", "packageName": "usnjrnl2csv", "displayName": "UsnJrnl2Csv", "summary": "Parser for $UsnJrnl on NTFS", "version": "1.0.0.24", "icon": "", "author": "Joakim Schicht", "downloadCount": 149, "tags": ["usnjrnl2csv", "usnjrnl", "csv", "ntfs", "digital", "forensics", "incident", "response", "dfir"]}