{"description": "![Screenshot of uTorrent Link Sender](https://lh6.googleusercontent.com/l_--AbDt5pWj7LY5MdIRlRY3tyA9_XZP1NsY4KFVz_tIUA2MnONqLOCvDcffo-CNN1WmlIaH1Wk=s640-h400-e365-rw)\n\n###Send a link to the uTorrent Web UI\n\nThe extension adds an item in the contextual menu when right click is done over a magnet link. You can then, send that link to the uTorrent UI without leaving the current page.\n\nJust install the extension, update your uTorrent server settings and start using it.\n\nNo ads, not spyware. This just works...I added it because I got tired of extensions full of this kind of stuff.\n\nThe code is open-source if you want to check it out: https://github.com/pendexgabo/utorrent-download\n\nDo you have feedback? Please post it here: http://bit.ly/1rP8bxS (google store feedback)\n\nIf you think the extension is cool and you are in a good mood you can consider buying me a beer :) Just press the button in the settings page\t\n\t\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-19T02:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/utorrent-link-sender-chrome/0.0.9", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/utorrent-link-sender-chrome/0.0.9", "licenseUrl": "https://github.com/pendexgabo/utorrent-download", "packageName": "utorrent-link-sender-chrome", "displayName": "uTorrent Link Sender for Chrome", "summary": "uTorrent Link Sender adds a context menu selection to send a torrent link to uTorrent running on another computer.", "version": "0.0.9", "icon": "https://raw.githubusercontent.com/pendexgabo/utorrent-download/master/utorrent-128.png", "author": "Pendexgabo", "downloadCount": 933, "tags": ["utorrent", "link", "sender", "chrome", "extension"]}