{"description": "VBoxVmService is a wrapper-service that calls VirtualBox COM API interfaces. When Windows starts up, the wrapper-service will start running. It will check for the settings in `VBoxVmService.ini` file, and call up the Virtual Machines as specified. Both the wrapper-service and Virtual Machines are run with the account specified in the `VBoxVmService.ini` file.\n\nIf `RunWebService=yes` is specified in `VBoxVmService.ini` file, the wrapper-service will also try to start VirtualBox web service automatically. This might be useful for people who use the web service a lot, like users of phpVirtualBox.\n\nWhen windows shuts down, the wrapper-service will try to stop all the VMs configured in `VBoxVmService.ini`.\n\n`VmServiceControl.exe` is the CLI (command line interface) client that sends control commands to VBoxVmService and display returned results.\n\n`VmServiceTray.exe` is another client like `VmServiceControl.exe`, but comes with GUI interface and stays in system tray.\n\nOld Windows versions like Windows 7 are no longer supported.\n\nIt hasn't been fully tested on systems other than Windows 10, but it is supposed to work on server systems like Win2012, Win2016, ... etc, both 32bit and 64bit versions.\n\nNOTE: Your AntiVirus software might detect a virus in this package. This is a known issue which arises due to this software using an InnoSetup installer, which is also often used by malware. PLease see these resources: https://github.com/onlyfang/VBoxVmService/issues/47, https://github.com/onlyfang/VBoxVmService/issues/48, https://groups.google.com/g/innosetup/c/w2weZ4afFqs/m/S62Rm5dfAgAJ.", "updated": "2024-03-23T02:33:29Z", "galleryUrl": "https://community.chocolatey.org/packages/VBoxVmService/6.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/VBoxVmService/6.1", "licenseUrl": "https://github.com/onlyfang/VBoxVmService/blob/master/doc/Licence.txt", "packageName": "VBoxVmService", "displayName": "VBoxVmService", "summary": "VBoxVmService is a Windows Service, that enables the host-system to run or shutdown VirtualBox Virtual Machines (VMs) without a user being logged on to the host-system running Windows (Win10/2012/2016, both x86 and x64 supported).", "version": "6.1", "icon": "https://cdn.staticaly.com/gh/onlyfang/VBoxVmService/5453a343/src/gfx/VmServiceControl.png", "author": "Mathias Herrmann,  Zhe Fang,  Runar Buvik", "downloadCount": 5007, "tags": ["oracle", "VBoxVmService", "virtualbox", "virtualization", "vm", "service"]}