{"description": "# Vikunja (/vɪˈkuːnjə/)\n## The to-do app to organize your life.\nAlso one of the two wild South American camelids which live in the high alpine areas of the Andes and a relative of the llama.\nVikunja is an Open-Source, self-hosted To-Do list application for all platforms. It is licensed under the AGPLv3.\n\n## Stay organized\nOrganize your tasks in lists, organize lists in namespaces.\n\n## Tasks\nTasks are not only simple tasks. You can let Vikunja remind you of tasks when they're due. Never miss an important deadline again!\n\nRemember that thing you have to do every week but can't get the hang on? You can set tasks to repeat in a time interval, letting Vikunja remind you of important weekly or monthly tasks.\n\nVikunja also lets you split a task in multiple subtasks for easy progress tracking and more satisfaction when crossing them off the list!\n\n##  Collaboration\nEver wished you could just share that grocery list with your roomate instead of having to send dozens of texts on your way to the supermarket? With Vikunja, you can. Simply share a list (or a namespace with all its lists) to another user. Don't want your roommate to add new things to the grocery list and only do the shopping? You can also share a list with read-only access!\n\nPlanning a bigger thing? You can use teams to share a list or namespace with multiple people at a time!\n\n## Share links\nYou can share a list with a link so that others can directly see or edit all tasks on a list but don't need to create an account. Share links have all the same rights management as sharing with users or teams.\n\n## Kanban board\nVikunja lets you organize and prioritize your tasks in a kanban board.\nQuickly get an overview of the status of things - especially when collaborating with multiple people on a project.\n\nEach card on a board represents a task in Vikunja.\nAll tasks can be added through the usual ways and will then show up in the kanban board where they can be easily rearranged and reordered.\n\n## Labels\nEffortlessly mark tasks with a colorful label to find and group relevant tasks with a click!\n\n## Priorities\nKnow that feeling when you have a dozen things to do but can't decide on what to work next? Vikunja lets you prioritize your tasks with a few clicks, so you'll always know on what to work next.\n\n## Delegation\nAssign tasks to team members so everyone knows what to do.\n\n\n## Attachments\nAttach files to tasks, so you can always have all related files for a task in one place!\n\n## Relations\nRelate different tasks together - even if they're not on the same list! A relation can be multiple things, for example a subtask or blocking task.\n\n## Due dates\nRemember these tasks with a deadline coming up? Set a due date for a task and see all tasks with upcoming deadlines at once!\n\n## CalDAV\nVikunja comes with a calDAV-integration which lets you use the tools you already use and love.", "updated": "2024-03-23T04:33:32Z", "galleryUrl": "https://community.chocolatey.org/packages/vikunja-desktop/0.23.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/vikunja-desktop/0.23.0", "licenseUrl": "https://kolaente.dev/vikunja/frontend/src/branch/master/LICENSE", "packageName": "vikunja-desktop", "displayName": "Vikunja Desktop", "summary": "The to-do app to organize your life.", "version": "0.23.0", "icon": "https://cdn.statically.io/gh/TheCakeIsNaOH/chocolatey-packages/97fc87d57673255d9490a64e54bea94a3db79616/Icons/Vikunja.png", "author": "The Vikunja Authors", "downloadCount": 1456, "tags": ["vikunja", "todo", "organize", "to-do", "lists", "list"]}