{"description": "Virtual CloneDrive works and behaves just like a physical CD, DVD, or Blu-ray drive, although it only exists virtually.\nImage files can be \"inserted\" into the virtual drive from your harddisk or from a network drive by just a double-click,\nand thus be used like a normal CD, DVD, or Blu-ray. Virtual CloneDrive supports up to 15 virtual drives at the same\ntime - no matter if the image file contains audio, video or just simple data. Virtual CloneDrive is fully integrated in\nWindows Explorer context menus and on top of all it is free!\n\n## Features\n\n* Mounts images as virtual drive\n* Supports all common image formats such as ISO, BIN, IMG, UDF, DVD, and CCD\n* Emulation of CD, DVD, and Blu-ray media\n* Supports up to 15 virtual drives at the same time\n* History of recently mounted images\n* Automount last image\n* Unmount image with eject button\n* Seamless integration in Windows Explorer context menu\n* Easy to use - just double-click an image file to mount as a drive\n* Virtual CloneDrive is freeware, you may use it at no cost\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@035d53ae4064356b41c51a5397ff1cba8a9c409f/automatic/virtualclonedrive/screenshot.png)\n\n## Package Parameters\n\nThe following package parameter can be set:\n\n* `/AddToDesktop` - this puts a shortcut on your desktop to configure Virtual CloneDrive.\n\nThis parameter can be passed to the installer with the use of `--params`.\nFor example: `--params \"/AddToDesktop\"`.\n\nTo have Chocolatey remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.\n\n## Notes\n\n* For versions of Windows prior to Windows 10 a reboot is required before the software can be used\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T22:18:48Z", "galleryUrl": "https://community.chocolatey.org/packages/VirtualCloneDrive/5.5.2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/VirtualCloneDrive/5.5.2.0", "licenseUrl": "http://www.elby.ch/download/SetupVirtualCloneDrive5.xml", "packageName": "VirtualCloneDrive", "displayName": "Virtual CloneDrive", "summary": "Mount ISO files and use them like a physical drive", "version": "5.5.2.0", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@035d53ae4064356b41c51a5397ff1cba8a9c409f/icons/virtualclonedrive.png", "author": "Elaborate Bytes", "downloadCount": 69872, "tags": ["iso", "bin", "img", "udf", "ccd", "cd", "dvd", "blueray", "freeware", "elaborate-bytes", "elby"]}