{"description": "### Overview\nEnterprise grade solution with advanced capabilities for teams working on projects of any size or complexity, including advanced testing and DevOps.\n- End-to-end solution for your development teams, including the most feature-rich Visual Studio IDE for working on any type of project.\n- Build quality applications at scale with advanced features such as Load Testing, automated and manual testing and new IntelliTest capabilities.\n- Manage complexity and resolve issues quickly with features such as Code Map and IntelliTrace.\n- Enhanced MSDN subscription benefits including comprehensive access to software for dev/test, Team Foundation Server, Visual Studio Online Advanced, $150/month in Azure credits, training and support.\n\n### Attention Windows 8.1 and  Windows Server 2012 R2 Users\n\nYou must have Windows RT 8.1, Windows 8.1, and Windows Server 2012 R2 update: April 2014 installed in order to install Visual Studio 2015\nYou can download KB2919355 here https://support.microsoft.com/en-us/kb/2919355\n\n### Customizations\nYou can customize the installation either by specifying your own installation configuration file.\n#### Adding optional features\nOptional features (Sql tools, phone tools, etc.) are available but not installed by default.\nTo specify the features you want installed you can download the AdminDeployment.xml and modify it to support your needs.\n\nhttps://raw.githubusercontent.com/KennethB/Chocolatey-Packages/master/VisualStudio2015Enterprise/Tools/AdminDeployment.xml\nSpecifying the optional features above modifies the configuration file used during installation (AdminDeployment.xml). If that is not enough you can provide this file on your own.\nExample:\nchoco install VisualStudio2015Enterprise -packageParameters \"--AdminFile c:\\path to your\\AdminDeployment.xml\"\nchoco install VisualStudio2015Enterprise -packageParameters \"--AdminFile http://path/to/your/AdminDeployment.xml\"", "updated": "2024-03-20T01:48:58Z", "galleryUrl": "https://community.chocolatey.org/packages/VisualStudio2015Enterprise/2015.03.03", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/VisualStudio2015Enterprise/2015.03.03", "licenseUrl": "http://msdn.microsoft.com/en-US/cc300389.aspx", "packageName": "VisualStudio2015Enterprise", "displayName": "Visual Studio 2015 Enterprise Update 3", "summary": "Enterprise grade solution with advanced capabilities for teams working on projects of any size or complexity, including advanced testing and DevOps", "version": "2015.03.03", "icon": "https://raw.githubusercontent.com/KennethB/Chocolatey-Packages/master/icons/VS2015.png", "author": "Microsoft", "downloadCount": 31436, "tags": ["Microsoft", "Visual", "Studio", "2015", "Enterprise", "IDE", "admin"]}