{"description": "This silently installs the 90 day trial (http://msdn.microsoft.com/en-us/library/gg442061.aspx) of Visual Studio Professional along with the Microsoft .Net 4.5 Framework SDK. All Optional Features such as Blend, Sql Dev tools, Web dev tools, etc. are not installed. However, from the \"Programs and Features\" menu in Windows you can right click Microsoft Visual Studio Ultimate and choose \"Change\" and then add the features you want. This may take quite a while to install so grab your Lord of the Rings Battle Axe and re-enact the battle of Isengard while you wait!\n    ==================OPTIONAL FEATURES==================\n    All Optional Features such as Blend, Sql Dev tools, Web dev tools, etc. are not installed by default, but you can provide install arguments to add them. Here is an example that includes the Web Tools and SQL features:\n\n    cinst VisualStudio2012Professional -packageParameters \"/Features:'WebTools SQL' /ProductKey:AB1CD-EF2GH-IJ3KL-MN4OP-QR5ST\"\n\n    You simply need to send a white space delimited list of the features to install via the InstallArguments parameter. Here are the available features:\n    Blend\n    LightSwitch\n    VC_MFC_Libraries\n    OfficeTools\n    SharepointTools\n    SQL\n    WebTools\n    SilverLight_Developer_Kit", "updated": "2024-03-23T20:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/VisualStudio2012Professional/11.0.1.20151219", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/VisualStudio2012Professional/11.0.1.20151219", "licenseUrl": "http://msdn.microsoft.com/en-US/cc300389.aspx", "packageName": "VisualStudio2012Professional", "displayName": "Visual Studio 2012 - Professional", "summary": "Professional developers need professional tools. Visual Studio Professional 2012 is a unified development experience that enables developers to create multi-tier applications across the web, cloud, and devices.", "version": "11.0.1.20151219", "icon": "https://github.com/mwrock/Chocolatey-Packages/raw/master/VisualStudio2012Ultimate/vs.png", "author": "Microsoft", "downloadCount": 11221, "tags": ["Microsoft", "Visual", "Studio", "2012", "Professional", "IDE", "ALM"]}