{"description": "This silently installs Visual Studio 2013 Ultimate with Update 5 along with the Microsoft .Net 4.5.1 Framework SDK. \n    ==================OPTIONAL FEATURES==================\n    All Optional Features such as Blend, Sql Dev tools, Web dev tools, etc. are not installed by default, but you can provide install arguments to add them. Here is an example that includes the Web Tools and the Windows 8 Store App SDK:\n\n    cinst VisualStudio2013Ultimate -InstallArguments \"/Features:'WebTools Win8SDK' /ProductKey:AB1CD-EF2GH-IJ3KL-MN4OP-QR5ST\"\n\n\n    You simply need to send a white space delimited list of the features to install via the InstallArguments parameter. Here are the available features:\n    Blend\n    LightSwitch\n    VC_MFC_Libraries\n    OfficeDeveloperTools\n    SQL\n    WebTools\n    Win8SDK\n    SilverLight_Developer_Kit\n    WindowsPhone80", "updated": "2024-03-23T22:33:38Z", "galleryUrl": "https://community.chocolatey.org/packages/VisualStudio2013Ultimate/12.0.40629.20150920", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/VisualStudio2013Ultimate/12.0.40629.20150920", "licenseUrl": "http://msdn.microsoft.com/en-US/cc300389.aspx", "packageName": "VisualStudio2013Ultimate", "displayName": "Visual Studio 2013 - Ultimate with Update 5", "summary": "Visual Studio Ultimate 2013 is the state-of-the-art development solution that empowers teams of all sizes to design and create compelling apps to delight users. You can use flexible agile planning tools—for example, capacity planning, taskboards, and backlog management—to enable incremental development techniques and agile methodologies, at your own pace. Use advanced modeling, discovery, and architecture tools to describe your system and help ensure that your architecture vision is preserved in the implementation. Bring development and operation teams together by using IntelliTrace, Operations Manager Connector, and Preemptive Analytics. Improve quality and reduce time to resolution by generating actionable bugs from deployed software, and effectively partner with the operations staff to provide data that gives developers greater insight into production issues.", "version": "12.0.40629.20150920", "icon": "https://github.com/mwrock/Chocolatey-Packages/raw/master/VisualStudio2012Ultimate/vs.png", "author": "Microsoft", "downloadCount": 19962, "tags": ["Microsoft", "Visual", "Studio", "2013", "Ultimate", "IDE", "ALM"]}