{"description": "PowerShell Tools for Visual Studio – PowerShell editing and debugging in Visual Studio.\n\n#### Requirements\n- Microsoft Visual Studio 2015\n- PowerShell v3 or later\n\n#### Overview\nPowerShell Tools for Visual Studio brings the richness of the Visual Studio development experience together with the power of PowerShell. Using this extension you can:\n\n- Edit, run and debug PowerShell scripts locally and remotely using the Visual Studio debugger \n- Create projects for PowerShell scripts and modules \n- Leverage Visual Studio’s locals, watch, call stack for your scripts and modules \n- Use the PowerShell interactive REPL window to execute PowerShell scripts and command right from Visual Studio \n- Automated Testing support using Pester \n\n#### Details\nAn improved editing experience offers syntax highlighting, IntelliSense and code folding. You can quickly navigate your scripts with a function selection drop down. \nA rich debugging experience allows you to execute and single step through local and remote scripts. With support for breakpoints, the locals window and the call stack window you can easily find and fix bugs in your scripts. \nSupport for running utilizing features such as DSC, Workflows and 64-bit modules (e.g. Sharepoint). \nThe PowerShell Interactive Window provides instant execution with IntelliSense and remote session support. \nA project system is available to organize scripts and easily integrate with source control systems. It also offers a mechanism to provide module information for use in MSBuild scripts. \nTest adapter support for discovering and running Pester tests.", "updated": "2024-03-17T02:48:41Z", "galleryUrl": "https://community.chocolatey.org/packages/visualstudio2015-powershelltools/3.0.539", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/visualstudio2015-powershelltools/3.0.539", "licenseUrl": "https://marketplace.visualstudio.com/items/AdamRDriscoll.PowerShellToolsforVisualStudio2015/license", "packageName": "visualstudio2015-powershelltools", "displayName": "PowerShell Tools for Visual Studio 2015", "summary": "A set of tools for developing and debugging PowerShell scripts and modules in Visual Studio.", "version": "3.0.539", "icon": "https://cdn.rawgit.com/jberezanski/ChocolateyPackages/8e10836069f1d3139a9c70f844addd3f5d3b1ac2/icons/visualstudio2015-powershelltools.png", "author": "Microsoft", "downloadCount": 1164, "tags": ["visual", "studio", "2015", "powershell", "tools", "vsix", "admin"]}