{"description": "This silently installs the 90 day trial (http://msdn.microsoft.com/en-us/library/gg442061.aspx) of Visual Studio Premium along with the Microsoft .Net 4.5 Framework SDK. All Optional Features such as Blend, Sql Dev tools, Web dev tools, etc. are not installed. However, from the \"Programs and Features\" menu in Windows you can right click Microsoft Visual Studio Ultimate and choose \"Change\" and then add the features you want. This may take quite a while to install so grab your Chubaka mask and practice your wookie grunts with your co-workers while you wait!\n        ==================OPTIONAL FEATURES==================\n    All Optional Features such as Blend, Sql Dev tools, Web dev tools, etc. are not installed by default, but you can provide install arguments to add them. Here is an example that includes the Web Tools and SQL features:\n\n    cinst VisualStudio2012Premium -packageParameters \"/Features:'WebTools SQL' /ProductKey:AB1CD-EF2GH-IJ3KL-MN4OP-QR5ST\"\n\n    You simply need to send a white space delimited list of the features to install via the packageParameters parameter. Here are the available features:\n    Blend\n    LightSwitch\n    VC_MFC_Libraries\n    OfficeTools\n    SharepointTools\n    SQL\n    WebTools\n    SilverLight_Developer_Kit", "updated": "2024-03-22T00:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/VisualStudio2012Premium/11.0.1.20151219", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/VisualStudio2012Premium/11.0.1.20151219", "licenseUrl": "http://msdn.microsoft.com/en-US/cc300389.aspx", "packageName": "VisualStudio2012Premium", "displayName": "Visual Studio 2012 - Premium", "summary": "From small development shops to large companies, most software is built by a team. Visual Studio Premium 2012 offers an integrated ALM solution to bring together stakeholders, users, and software development functions to deliver compelling applications as a unified team.", "version": "11.0.1.20151219", "icon": "https://github.com/mwrock/Chocolatey-Packages/raw/master/VisualStudio2012Ultimate/vs.png", "author": "Microsoft", "downloadCount": 3348, "tags": ["Microsoft", "Visual", "Studio", "2012", "Premium", "IDE", "ALM"]}