{"description": "VMMap is a process virtual and physical memory analysis utility. It shows a breakdown of a process's committed virtual\nmemory types as well as the amount of physical memory (working set) assigned by the operating system to those types.\nBesides graphical representations of memory usage, VMMap also shows summary information and a detailed process memory\nmap. Powerful filtering and refresh capabilities allow you to identify the sources of process memory usage and the\nmemory cost of application features.\n\nBesides flexible views for analyzing live processes, VMMap supports the export of data in multiple forms, including a\nnative format that preserves all the information so that you can load back in. It also includes command-line options\nthat enable scripting scenarios.\n\nVMMap is the ideal tool for developers wanting to understand and optimize their application's memory resource usage.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@ab7733d9bd5714cac138fe9e5eec447633fb3d75/automatic/vmmap/screenshot.png)\n\n## Notes\n\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-20T18:48:36Z", "galleryUrl": "https://community.chocolatey.org/packages/vmmap/3.33", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/vmmap/3.33", "licenseUrl": "https://docs.microsoft.com/sysinternals/license-terms", "packageName": "vmmap", "displayName": "VMMap - Windows Sysinternals", "summary": "VMMap is a process virtual and physical memory analysis utility", "version": "3.33", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@4a952cb67d3ba380d5d8dc2c26f1c41270affedf/icons/vmmap.png", "author": "Mark Russinovich", "downloadCount": 2815, "tags": ["memory", "process", "debug", "tools", "sysinternals"]}