{"description": "## Markdown Editor & Notes Management\n### Features\n#### Notebook-Based Notes Management\nVNote uses **notebooks** to hold your notes. Like OneNote, a notebook can be hosted on any location on your system. A notebook is designed to represent one account. For example, you could have one notebook hosted on local file system and another notebook hosted on an OwnCloud server. This is really useful when notes require different levels of security.\n\nA notebook corresponds to a self-contained folder (called the *Root Folder* of the notebook) in the file system. You could copy the folder to another location (or on another computer) and import it into VNote.\n\nA notebook could have infinite levels of folders. VNote supports copying or moving folders or notes within or between notebooks.\n\n#### Simple Notes Management\nAll your notes are managed by some plaintext configuration files and stored as plaintext files. You could access your notes without VNote. You could use external file synchronization services to synchronize your notes and import them on another machine.\n\nVNote supports both Markdown (suffix `md`) and rich text notes.\n\n#### Syntax Highlight\nVNote supports accurate syntax highlight for Markdown. Tuning the style of the highlight, VNote enables you to keep track of your document easily.\n\nVNote also supports **syntax highlight for fenced code blocks** in edit mode in Markdown, which is **superior** than almost all current Markdown editors.\n\n#### Live Image Preview\nVNote supports previewing the image link in edit mode. With this, you could just stay in edit mode as much as possible.\n\n#### Pleasant Image Experience\nJust paste your image into the Markdown note, VNote will manage all other stuffs. VNote stores images in a specified folder in the same folder with the note. VNote will pop up a window to preview the image when you insert an image. Furthermore, VNote will delete the useless image files automatically after you remove the image links.\n\n#### Interactive Outline Viewer In Read & Edit Mode\nVNote provides a user-friendly outline viewer for both edit and view mode. The outline viewer is a responsive item tree instead of a segment of HTML.\n\n#### Powerful Shortcuts\nVNote supports many pleasant and powerful shortcuts which facilitate your editing, including **Vim Mode**, **Captain Mode**, and **Navigation Mode** which enable you to work without the mouse.\n\n#### Highly Configurable\nIn VNote, almost everything is configurable, such as background color, font, and Markdown style. VNote uses a plaintext file to record all your configuration, so you could just copy that file to initialize a new VNote on another computer.", "updated": "2024-03-20T10:33:31Z", "galleryUrl": "https://community.chocolatey.org/packages/vnote.portable/3.17.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/vnote.portable/3.17.0", "licenseUrl": "https://github.com/vnotex/vnote/blob/master/COPYING.LESSER", "packageName": "vnote.portable", "displayName": "VNote (Portable)", "summary": "A Vim-inspired note-taking application that knows programmers and Markdown better.", "version": "3.17.0", "icon": "https://cdn.jsdelivr.net/gh/joachimschmidt557/chocolatey-packages-manual-automatic@3dc1f2b188005745729c4d67ee29585dfc262236/icons/VNote.png", "author": "Le Tan", "downloadCount": 8450, "tags": ["vnote", "notes", "markdown"]}