{"description": "![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/voicemeeter.install/screenshot.png)\n\nFor first use, it's highly recommended to follow user manual step by step, especially step ZERO of the [documentation](https://www.vb-audio.com/Voicemeeter/#Documentation).\n\n## Licensing\nVoicemeeter is distributed as [Donationware](https://www.vb-audio.com/Voicemeeter/Donationware.htm)!\n\nFor END USER, Voicemeeter is free to use! You pay what you want when you want if your find it useful. Thanks for your participation!\n\nFor Volume licensing / special deals, especially for company deployment or commercial distribution, you may contact us to get quotation / agreement. [Get more info...](https://www.vb-audio.com/Services/licensing.htm)\n## The Virtual Audio Mixer\n\n## Features\n\nVoiceMeeter is able to mix audio sources coming from audio device as well as from audio applications. it mixes 3 Inputs to 3 outputs though 2 buses. Then Microphone, Music, Movie, Skype call, video game sound, net radio... can be mixed and sent to different audio outputs, VOIP or Recording Application... \n\n**as Virtual Audio Device**\n\nVoicemeeter is an application endowed with Virtual Audio I/O and can be used as main audio device by your system, like it was hardware mixing console. Voicemeeter supports all audio interface: MME, Direct-X, KS, WaveRT, WASAPI, and ASIO to connect audio pro DAW or musical instrument.\n\n### Voicemeeter Audio Device Mixer\nUniversal Virtual Audio Device to connect everything together\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/voicemeeter.install/screenshot1.png)\n\n### Voicemeeter Virtual I/O\nAll Audio Interfaces Support: MME, Direct-X, KS, WaveRT, WASAPI, and ASIO\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/voicemeeter.install/screenshot2.png)\n\n### Voicemeeter new audio experiences\n\n1. To mix your voice with your music on Skype or Google Voice and make your live podcast or own radio program.\n2. To use 2x USB Headset on a computer, for VOIP applications or online educational program.\n3. To Play Video Game in 5.1 and keep the MIC for communication with your team.\n4. To make tutorial with your preferred audio/video capture software.\n5. To Record Conference or Interview in multichannel for post production.\n6. To use different Audio Application together and record the performance in live with your preferred DAW.\n7. Finally to manage simply whatever sound sources on your computer in an easy way.\n\n## Voicemeeter Mixing Console\n\nVoicemeeter is the first Application working as a virtual Mixer, able to manage every audio sources and audio points\n\nBy Including various DSP algorithms from VB-Audio, Voicemeeter is a concentrate of technology letting you control the sound as you want, without worrying about any limitations. Made it your way and retrieve feeling of vintage analog mixing console !\n\nVoicemeeter is a Unique Application designed for everyone willing to manage audio in a smart way! For VOIP users, Broadcasters, Podcasters, Video gamers, Musicians, DJ's and whatever Sound Lovers, P.A. System tweaker, Home-Cinema audiophiles...\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/voicemeeter.install/screenshot3.png)", "updated": "2024-03-23T20:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/voicemeeter.install/1.0.8.8", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/voicemeeter.install/1.0.8.8", "licenseUrl": "https://www.vb-audio.com/Services/licensing.htm", "packageName": "voicemeeter.install", "displayName": "Voicemeeter Virtual Audio Mixer (Install)", "summary": "Voicemeeter is Audio Mixer Application endowed with Virtual Audio Device used as Virtual I/O to mix and manage any audio sources from or to any audio devices or applications.", "version": "1.0.8.8", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/voicemeeter.install/voicemeeter.install.png", "author": "Vincent Burel", "downloadCount": 7833, "tags": ["voicemeeter", "audio", "mixer", "application"]}