{"description": "Vortex is the new, modern mod manager from Nexus Mods. It is designed to make modding your game as simple as possible for new users, while still providing enough control for more experienced veterans of the modding scene. Lead by Tannin, the creator of Mod Organizer, Vortex takes the lessons learnt during the development of MO and Nexus Mod Manager to provide the most powerful and intuitive modding experience available.\n\nOur approach with Vortex aims to take complex tasks such as sorting your load order or managing your mod files and automates as much of the process as possible with the goal of having you achieve a stable modded game with minimal effort. We want to help you spend less time modding and more time playing your games.\n\n## Features\n\n- MULTI-GAME SUPPORT:\n\nWith mod support for over 30 different games and counting - from Dark Souls, Fallout and Skyrim, to the Witcher series and Stardew Valley - Vortex is the most versatile mod manager available.\n\n- CLOSE INTEGRATION WITH NEXUS MODS:\n\nVortex is designed to seamlessly interact with Nexus Mods allowing you to easily find, install, and play mods from our site, learn about new files and catch the latest news.\n\n- MODDING MADE EASY:\n\nThe built-in auto-sorting system manages your load order and helps you to resolve mod conflicts with powerful, yet easy to use plugin management features.\n\n- MOD PROFILES:\n\nEasily set up, switch between, and manage independent mod profiles enabling you to use exactly the combination of mods that you want for a particular playthrough.\n\n- MODERN, EASY TO USE UI:\n\nFeaturing a fully customisable interface, Vortex allows you to quickly and easily access tools and manage your games, plugins, downloads and save games.\n\n- EXTENSIONS AND PLUGINS:\n\nVortex is released under a GPL-3 License giving our community the ability to write extensions and frameworks which can then interact with Vortex, continually adding to its functionality.", "updated": "2024-03-24T00:48:33Z", "galleryUrl": "https://community.chocolatey.org/packages/vortex/1.10.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/vortex/1.10.7", "licenseUrl": "https://github.com/Nexus-Mods/Vortex/blob/master/LICENSE.md", "packageName": "vortex", "displayName": "Vortex", "summary": "Vortex is a free and open source piece of software that allows you to download, install, update and manage your mod files through an easy to use interface. It integrates with the Nexus sites to provide you with a fast, efficient and much less hassled modding experience.", "version": "1.10.7", "icon": "https://cdn.jsdelivr.net/gh/JourneyOver/chocolatey-packages@1e514129d6064b64ccc88a99a27a23626e769856/automatic/vortex/icons/64x64.png", "author": "https://github.com/Nexus-Mods/Vortex/graphs/contributors", "downloadCount": 71550, "tags": ["vortex", "nexus", "mod", "mods", "manager", "vortexmodmanager", "vortex-mod-manager", "modmanager", "mod-manager", "nexusmods", "modding"]}