{"description": "Deprecation note: Package has been deprecated to reflect Voxengo's rebranding from `CRTIV Reverb 2` to `Sobor`. \n\nCRTIV Reverb is a stereo reverberation effect AAX, AudioUnit and VST plugin for professional music production applications.  This reverb plug-in provides a wide palette of reverb spaces while requiring only a minimal effort to obtain useful results.  The tails created by this reverb are very dense and produce a well-defined spatialization.  Since the reverb uses a kind of “true stereo” algorithm the panned sounds receive a good stereo field placement.  We believe CRTIV Reverb provides one of the lushest reverb tails available on the market.\n\nThe early reflections placement, pre-delay and levels are chosen automatically based on a pre-defined model that depends on the “Room Size” and “Ambience” parameters.  CRTIV Reverb is technically based on Feedback Delay Network building blocks using the Hadamard matrix, and uses self-modulation techniques.\n\nCRTIV Reverb is great on any sound sources: vocals, synths, drums, mixes.  The only drawback is that this reverb is a relatively CPU-demanding effect (it takes 7.5% of a single core of i7-7700K processor, at 44100 sample rate), for comfortable use it requires a higher-end processor.\n\n\n## Package Specific\n\n### Package Parameters\nThe following package parameters can be set:\n\n * `/NoVst2x86`       - Do not install the x86 VST2 version\n * `/NoVst2x64`       - Do not install the x64 VST2 version\n * `/NoVst3x86`       - Do not install the x86 VST3 version\n * `/NoVst3x64`       - Do not install the x64 VST3 version\n * `/NoAaxx86`        - Do not install the x86 AAX version\n * `/NoAaxx64`        - Do not install the x64 AAX version\n * `/NoShortcuts`     - Do not install shortcuts to manuals and uninstaller into start menu or onto desktop\n * `/Vst2Path:`       - Installation path of the VST2 version\n * `/Vst2x86Path:` - Installation path of the x86 VST2 version on x64 CPU architecture\n * `/InstallerPath:`  - Do not download the installer from the official Voxengo website and use the one passed with this argument instead. Use it, if you don't have an internet connection at your studio computer.\n * `/CompanyPath:`    - Path of the company to put all program files in. Override if you want to have the program files at a custom location.\n\nYou must pass the package parameters like this:\n```\n$VST2x86 = [System.Environment]::GetEnvironmentVariable('CommonProgramFiles(x86)') + \"\\VST2\\Voxengo\"\nchoco install voxengo-crtiv-reverb-2 --package-parameters \"'/NoVst2x64 /Vst2x86Path:$VST2x86 '\"\n```", "updated": "2024-02-22T23:04:30Z", "galleryUrl": "https://community.chocolatey.org/packages/voxengo-crtiv-reverb-2/3.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/voxengo-crtiv-reverb-2/3.1", "licenseUrl": "https://www.voxengo.com/terms-of-use/", "packageName": "voxengo-crtiv-reverb-2", "displayName": "[Deprecated] Voxengo CRTIV Reverb 2 (Install)", "summary": "A reverb plugin for VST2/3 and AAX compatible hosts by Voxengo.", "version": "3.1", "icon": "", "author": "Voxengo", "downloadCount": 995, "tags": ["crtiv-reverb-2", "reverb", "vst", "aax", "audio", "mixing", "mastering", "recording", "trial"]}