{"description": "The Visual Studio Shell (integrated mode) provides the foundation on which you can seamlessly integrate tools and programming languages within Visual Studio. The Visual Studio Shell (integrated mode) does not contain any programming language, so it provides the perfect foundation to deploy a development environment for your own language. The Visual Studio Shell (integrated mode) seamlessly integrates with Visual Studio 2010 Professional and above. Any tools and programming languages that run inside the Visual Studio Shell (integrated mode) will run together with Visual Studio 2010 if they are also installed on the same machine. By using the Visual Studio Shell (integrated mode), you will not need to make Visual Studio a pre-requisite on your user machines.\n\nThis download contains the redistributable runtime binaries that you can distribute with your Visual Studio tools and programming languages. For development and testing of your Visual Studio tools and programming languages, please download the Visual Studio 2010 SDK.\n\nIncludes WebApplication targets necessary for building web applications:\nMicrosoft\\VisualStudio\\v10.0\\WebApplications\\Microsoft.WebApplication.targets", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/VS2010.ShellIntegratedRedist/10.0.30319.2", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/VS2010.ShellIntegratedRedist/10.0.30319.2", "licenseUrl": "", "packageName": "VS2010.ShellIntegratedRedist", "displayName": "Microsoft Visual Studio 2010 Shell (Integrated) Redistributable Package", "summary": "Microsoft Visual Studio 2010 Shell (Integrated) Redistributable Package\n\n      The Visual Studio Shell (integrated mode) provides the foundation on which you can seamlessly integrate tools and programming languages within Visual Studio.", "version": "10.0.30319.2", "icon": "https://github.com/Iristyle/ChocolateyPackages/raw/master/VS2010.ShellIntegratedRedist/VS2010.jpg", "author": "Microsoft", "downloadCount": 327659, "tags": ["VisualStudio", "VS", ".NET", "2010"]}