{"description": "This Visual Studio Code extension allows you to connect to Azure DevOps Services and Team Foundation Server and provides support for Team Foundation Version Control (TFVC). It allows you to monitor your builds and manage your pull requests and work items for your TFVC or Git source repositories. The extension uses your local repository information to connect to either Azure DevOps Services or Team Foundation Server 2015 Update 2 (and later).\n\n## Features\n\n* Provide support for Team Foundation Version Control (TFVC)\n* Show information about repository in status bar\n* Add commands to work with Azure DevOps or Team Foundation Server\n\n## Notes\n\n* This package requires Visual Studio Code 1.2.0 or newer.\n  You can install either the [vscode](https://chocolatey.org/packages/vscode) or [vscode-insiders](https://chocolatey.org/packages/vscode-insiders) package.\n* The extension will be installed in any edition of Visual Studio Code which can be found.\n* While this package installs a specific version of the extension, Visual Studio Code by default will update the extension to the latest version on startup\n  if there's a newer version available on the marketplace.\n  See [Extension auto-update](https://code.visualstudio.com/docs/editor/extension-gallery#_extension-autoupdate) for instructions how to disable auto-update.\n\n![screenshot](https://cdn.jsdelivr.net/gh/pascalberger/chocolatey-packages@4979562f4aff867f0f0690570e6bc0547bc10b4c/automatic/vscode-azurerepos/screenshot.png)", "updated": "2024-03-18T15:03:25Z", "galleryUrl": "https://community.chocolatey.org/packages/vscode-azurerepos/1.161.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/vscode-azurerepos/1.161.1", "licenseUrl": "https://marketplace.visualstudio.com/items/ms-vsts.team/license", "packageName": "vscode-azurerepos", "displayName": "Azure Repos Extension for Visual Studio Code", "summary": "Visual Studio Code extension to connect to Azure Repos and work with Git and Team Foundation Version Control (TFVC) repositories. Manage your pull requests, work items, and more.", "version": "1.161.1", "icon": "https://cdn.jsdelivr.net/gh/pascalberger/chocolatey-packages@4979562f4aff867f0f0690570e6bc0547bc10b4c/icons/vscode-azurerepos.png", "author": "Microsoft", "downloadCount": 2077, "tags": ["vscode", "visualstudiocode", "azuredevops", "azurerepos"]}