{"description": "The extension for developers building applications to run in Kubernetes clusters and for DevOps staff troubleshooting Kubernetes applications.\n\nWorks with any Kubernetes anywhere (Azure, Minikube, AWS, GCP and more!).\n\n## Features\n\n* View your clusters in an explorer tree view, and drill into workloads, services, pods and nodes.\n* Browse Helm repos and install charts into your Kubernetes cluster.\n* Intellisense for Kubernetes resources and Helm charts and templates.\n* Edit Kubernetes resource manifests and apply them to your cluster.\n* Build and run containers in your cluster from Dockerfiles in your project.\n* View diffs of a resource's current state against the resource manifest in your Git repo\n* Easily check out the Git commit corresponding to a deployed application.\n* Run commands or start a shell within your application's pods.\n* Get or follow logs and events from your clusters.\n* Forward local ports to your application's pods.\n* Create Helm charts using scaffolding and snippets.\n* Bootstrap applications using Draft, and rapidly deploy and debug them to speed up the development loop.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@04c2c097ddd064697ce5d666d0dc3138ac671dbc/automatic/vscode-kubernetes-tools/screenshot.png)\n\n## Notes\n\n* This package requires Visual Studio Code 1.52.0 or newer.\n  You can install either the [vscode](https://chocolatey.org/packages/vscode) or [vscode-insiders](https://chocolatey.org/packages/vscode-insiders) package.\n* The extension will be installed in all editions of Visual Studio Code which can be found.\n* While this package installs a specific version of the extension, Visual Studio Code by default will update the extension to the latest version on startup if there's a newer version available on the marketplace.\n  See [Extension auto-update](https://code.visualstudio.com/docs/editor/extension-gallery#_extension-autoupdate) for instructions on how to disable auto-update.\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-22T18:18:28Z", "galleryUrl": "https://community.chocolatey.org/packages/vscode-kubernetes-tools/1.3.15", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/vscode-kubernetes-tools/1.3.15", "licenseUrl": "https://marketplace.visualstudio.com/items/ms-kubernetes-tools.vscode-kubernetes-tools/license", "packageName": "vscode-kubernetes-tools", "displayName": "Kubernetes Tools VSCode Extension", "summary": "Develop, deploy and debug Kubernetes applications", "version": "1.3.15", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@04c2c097ddd064697ce5d666d0dc3138ac671dbc/icons/vscode-kubernetes-tools.png", "author": "Microsoft", "downloadCount": 9552, "tags": ["kubernetes", "helm", "aws", "azure", "gcp", "minikube", "vscode", "microsoft"]}