{"description": "Visual Studio Online provides cloud-powered development environments for any activity - whether it's a long-term project, or a short-term task like reviewing a pull request. You can work with these environments from Visual Studio Code, Visual Studio ([sign up for the Private Preview(https://aka.ms/vsfutures-signup)]), or a browser-based editor that's accessible anywhere! You can even connect your own self-hosted environments to Visual Studio Online at no cost.\n\nAdditionally, Visual Studio Online brings many of the benefits of DevOps, like repeatability and reliability, which have typically been reserved for production workloads, to development environments. However, Visual Studio Online is also personaliazable to allow developers to leverage the tools, processes and configurations that they have come to love and rely on - truly the best of both worlds!\n\nLearn more at [online.visualstudio.com](http://online.visualstudio.com/).\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@db4cd0d0836bc43830830eb3bd2f5f25c706dd5e/automatic/vscode-vsonline/screenshot.png)\n\n## Notes\n\n* This package requires Visual Studio Code 1.47.3 or newer.\n  You can install either the [vscode](https://chocolatey.org/packages/vscode) or [vscode-insiders](https://chocolatey.org/packages/vscode-insiders) package.\n* The extension will be installed in all editions of Visual Studio Code which can be found.\n* While this package installs a specific version of the extension, Visual Studio Code by default will update the extension to the latest version on startup if there's a newer version available on the marketplace.\n  See [Extension auto-update](https://code.visualstudio.com/docs/editor/extension-gallery#_extension-autoupdate) for instructions on how to disable auto-update.\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-09T02:03:22Z", "galleryUrl": "https://community.chocolatey.org/packages/vscode-vsonline/1.0.3076", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/vscode-vsonline/1.0.3076", "licenseUrl": "https://marketplace.visualstudio.com/items/ms-vsonline.vsonline/license", "packageName": "vscode-vsonline", "displayName": "Visual Studio Codespaces VSCode Extension", "summary": "Intelligent productivity and collaboration, from anywhere, powered by the cloud", "version": "1.0.3076", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@9678bf5fd1d07c6f7a2dd3d08da205d8ad75ca59/icons/vscode-vsonline.png", "author": "Microsoft", "downloadCount": 6112, "tags": ["vsonline", "azure", "vscode", "codespaces", "vscode-codespaces", "microsoft"]}