{"description": "Cloud Code for VS Code extends VS Code to bring all the power and convenience of IDEs to developing cloud-native Kubernetes applications. With Google’s command-line [container tools](https://github.com/GoogleContainerTools) like [skaffold](https://skaffold.dev/) and [kubectl](https://kubernetes.io/docs/tasks/tools/install-kubectl/) under the hood, Cloud Code gives you local, continuous feedback on your project as you build it, extending this local edit-compile-debug loop to create cloud-native Kubernetes environments, on your workstation or in the cloud. Support for [deployment profiles](https://skaffold.dev/docs/how-tos/profiles/) lets you define different environments, like local development, shared development, test, or production, so you can easily test and debug on your workstation or in the cloud.\n\n## Features\n\n* Support for Go, Node, Java, and Python\n* Rapid Edit, Package, Deploy loop to your K8s cluster\n* Integrated Debugging and Log Viewing/Streaming\n* Snippets, completions, and linting for K8s artifacts\n* Profile support for dev, test and production environments\n* Cluster management, resource browsing and inspection of K8s clusters\n* Cluster creation supporting Google GKE, Amazon EKS and Azure AKS\n* Support for Custom Resources (CRDs) e.g. Istio, KNative\n* Automatically uses your Google Cloud SDK credentials\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@edf2228388178bdda72db56ab68b5ef8ae7e1359/automatic/vscode-cloud-code/screenshot.png)\n\n## Notes\n\n* This package requires Visual Studio Code 1.68.1 or newer.\n  You can install either the [vscode](https://chocolatey.org/packages/vscode) or [vscode-insiders](https://chocolatey.org/packages/vscode-insiders) package.\n* The extension will be installed in all editions of Visual Studio Code which can be found.\n* While this package installs a specific version of the extension, Visual Studio Code by default will update the extension to the latest version on startup if there's a newer version available on the marketplace.\n  See [Extension auto-update](https://code.visualstudio.com/docs/editor/extension-gallery#_extension-autoupdate) for instructions on how to disable auto-update.\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T15:18:32Z", "galleryUrl": "https://community.chocolatey.org/packages/vscode-cloud-code/2.6.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/vscode-cloud-code/2.6.0", "licenseUrl": "https://cloud.google.com/terms/plugins/", "packageName": "vscode-cloud-code", "displayName": "Cloud Code VSCode Extension", "summary": "Makes working with Kubernetes feel like editing and debugging local code. Cloud Code from Google Cloud, tools for Cloud Native development", "version": "2.6.0", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@edf2228388178bdda72db56ab68b5ef8ae7e1359/icons/vscode-cloud-code.png", "author": "Google", "downloadCount": 5831, "tags": ["aws", "azure", "gcp", "kubernetes", "k8s", "vscode", "google"]}