{"description": "Connect to MongoDB and [Atlas](https://www.mongodb.com/cloud/atlas) directly from your VS Code\nenvironment, navigate your databases and collections, inspect your schema and use playgrounds to\nprototype queries and aggregations.\n\n## Features\n\n### Navigate your MongoDB Data\n\n* Navigate your database, collections and read-only views\n* See the documents in your collections\n* Get a quick overview of your schema\n\n### MongoDB Playgrounds\n\nMongoDB Playgrounds are the most convenient way to prototype and execute CRUD operations and other MongoDB commands directly inside VS Code.\n\n* Prototype your queries, aggregations, and MongoDB commands with MongoDB syntax highlighting and intelligent autocomplete for MongoDB shell API, MongoDB operators,\nand for database, collection, and field names.\n* Run your playgrounds and see the results instantly. Click the play button in the tab bar to see the output.\n* Save your playgrounds in your workspace and use them to document how your application interacts with MongoDB\n* Build aggregations quickly with helpful and well-commented stage snippets\n\n### Quick access to the MongoDB Shell\n\nLaunch the MongoDB Shell from the command palette to quickly connect to the same cluster you have active in VS Code.\n\n### Terraform snippet for MongoDB Atlas\n\n* If you use Terraform to manage your infrastructure, MongoDB for VS Code helps you get started with the [MongoDB Atlas Provider](https://www.terraform.io/docs/providers/mongodbatlas/index.html).  Just\nopen a Terraform file, type atlas and you are good to go.\n\n![screenshot](https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@173a172f9194c0956fe278cf3c7c69f61f0e71cf/automatic/vscode-mongodb/screenshot.png)\n\n## Notes\n\n* This package requires Visual Studio Code 1.79.1 or newer.\n  You can install either the [vscode](https://chocolatey.org/packages/vscode) or [vscode-insiders](https://chocolatey.org/packages/vscode-insiders) package.\n* The extension will be installed in all editions of Visual Studio Code which can be found.\n* While this package installs a specific version of the extension, Visual Studio Code by default will update the extension to the latest version on startup if there's a newer version available on the marketplace.\n  See [Extension auto-update](https://code.visualstudio.com/docs/editor/extension-gallery#_extension-autoupdate) for instructions on how to disable auto-update.\n* This package is automatically updated using the [Chocolatey Automatic Package Update Model (AU)](https://github.com/majkinetor/au/blob/master/README.md).\n  If you find it is out of date by more than a day or two, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-20T19:33:44Z", "galleryUrl": "https://community.chocolatey.org/packages/vscode-mongodb/1.5.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/vscode-mongodb/1.5.0", "licenseUrl": "https://marketplace.visualstudio.com/items/mongodb.mongodb-vscode/license", "packageName": "vscode-mongodb", "displayName": "MongoDB VSCode Extension", "summary": "MongoDB for VS Code makes it easy to work with MongoDB, whether your own instance or in MongoDB Atlas", "version": "1.5.0", "icon": "https://cdn.jsdelivr.net/gh/dgalbraith/chocolatey-packages@173a172f9194c0956fe278cf3c7c69f61f0e71cf/icons/vscode-mongodb.png", "author": "MongoDB", "downloadCount": 4829, "tags": ["mongodb", "database", "atlas", "mongodb-atlas", "terraform", "vscode"]}