{"description": "WavPack is a completely open audio compression format providing lossless, high-quality lossy, and a unique hybrid compression mode. Although the technology is loosely based on previous versions of WavPack, the new version 4 format has been designed from the ground up to offer unparalleled performance and functionality.\n\nIn the default lossless mode WavPack acts just like a WinZip compressor for audio files. However, unlike MP3 or WMA encoding which can affect the sound quality, not a single bit of the original information is lost, so there's no chance of degradation. This makes lossless mode ideal for archiving audio material or any other situation where quality is paramount. The compression ratio depends on the source material, but generally is between 30% and 70%.\n\nThe hybrid mode provides all the advantages of lossless compression with an additional bonus. Instead of creating a single file, this mode creates both a relatively small, high-quality lossy file that can be used all by itself, and a \"correction\" file that (when combined with the lossy file) provides full lossless restoration. For some users this means never having to choose between lossless and lossy compression!\n\nWavPack employs only well known, public domain techniques (i.e., linear prediction with LMS adaptation, Elias and Golomb codes) in its implementation. Methods and algorithms that have ever been patented (e.g., arithmetic coding, LZW compression) are specifically avoided. This ensures that WavPack encoders and decoders will remain open and royalty-free.\n\n[Manual](http://www.wavpack.com/wavpack_doc.html)\n[Forum](http://www.hydrogenaud.io/forums/index.php?showforum=68)\n\n[Software support](http://www.wavpack.com/index.html#Software)\n[Hardware support](http://www.wavpack.com/index.html#Hardware)", "updated": "2024-03-20T19:33:44Z", "galleryUrl": "https://community.chocolatey.org/packages/wavpack/4.80.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wavpack/4.80.0", "licenseUrl": "http://www.opus-codec.org/license/", "packageName": "wavpack", "displayName": "WavPack", "summary": "Hybrid lossless audio compression", "version": "4.80.0", "icon": "https://cdn.rawgit.com/dtgm/chocolatey-packages/e613051da04b6f33809e8e260da4443f62a340dc/icons/wavpack.png", "author": "WavPack", "downloadCount": 2501, "tags": ["cli", "audio", "compression", "archive"]}