{"description": "From https://play.google.com/store/apps/details?id=com.tencent.mm\n\nWeChat is more than a messaging and social media app - it is a lifestyle for over one billion users across the world. Chat and make calls with friends, read news and use local services in Official Accounts and Mini Programs, play fun games with friends, enjoy mobile payment features with WeChat Pay, and much more.\n\nWhy do over one billion people use WeChat? Well...\n• MORE WAYS TO CHAT: Message friends using text, photo, voice, video, location sharing, and more. Create group chats with up to 500 members.\n• VOICE AND VIDEO CALLS: High-quality voice and video calls to anywhere in the world. Make group video calls with up to 9 people.\n• REAL-TIME LOCATION: Not good at explaining directions? Share your real-time location with the press of a button.\n• MOMENTS: Share your favorite moments. Post photos, videos, and more to your Moments stream.\n• TIME CAPSULE (NEW!): Share glimpses of your day. Record short videos to post in your Time Capsule before they disappear in 24 hours.\n• STICKER GALLERY: Browse thousands of fun, animated stickers to help express yourself in chats, including stickers with your favorite cartoon and movie characters.\n• CUSTOM STICKERS: Make chatting more unique with custom stickers and the new Selfie Stickers feature.\n• OFFICIAL ACCOUNTS: Tons of accounts to follow with original content and news for your reading pleasure.\n• MINI PROGRAMS: Countless third-party services all within the WeChat app that don’t require additional installation, saving you precious phone storage and time.\n• TOP STORIES: See the latest articles your friends are reading and discover all kinds of interesting content.\n• GAMES: Have fun and compete with friends in a huge selection of WeChat Mini Games and Tencent Games (*only available in certain regions).\n• WECHAT PAY: Enjoy the convenience of world-leading mobile payment features with WeChat Pay and Wallet (*only available in certain regions).\n• WECHAT OUT: Make calls to mobile phones and landlines around the globe at super low rates (*only available in certain regions).\n• LANGUAGE SUPPORT: Localized in 20 different languages and can translate friends’ messages and Moments posts.\n• BETTER PRIVACY: Giving you the highest level of control over your privacy, WeChat is the only messaging app to be certified by TRUSTe.\n• AND MUCH MORE: Exercise with friends on WeRun, scan QR codes, and much more.", "updated": "2024-03-23T23:03:35Z", "galleryUrl": "https://community.chocolatey.org/packages/wechat/3.9.8.15", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wechat/3.9.8.15", "licenseUrl": "https://www.wechat.com/en/service_terms.html", "packageName": "wechat", "displayName": "WeChat", "summary": "WeChat instant messaging tool", "version": "3.9.8.15", "icon": "https://cdn.jsdelivr.net/gh/facorread/wechat-chocolatey@master/wechat.png", "author": "Tencent Inc.", "downloadCount": 101131, "tags": ["admin", "messenger", "notSilent", "wechat"]}