{"description": "Help Builder is a documentation creation tool for end users and developers alike. Focused on easy content creation, Help Builder provides a productive work flow using the popular Markdown editing format. Simply type your text and easily add topic cross links,external Web links, paste or embed images, capture screen shots, tables and other text markup using either Markdown syntax or our toolbar options.\n\n        Help Builder can be used for documentation, but it's also a great tool for creating references, FAQs, code snippet and brainstorming repos, or any free form text storage. It's a great way to organize and search free form text and recover it later. When you're done creating content simply publish your content to your Web site using FTP, or create a CHM help file, Word or PDF document to share your content.\n\n        For developers Help Builder supports importing information from a variety of sources like classes, databases and entire libraries for full featured development documentation. Import .NET class libraries, SQL Server databases, COM Objects and Web Services. Imported documentation can be further amended and you can mix both imported and manually edited content. Syntax coloring support for most common languages lets you create very interactive and code centric developer documentation.\n\n        ![West Wind Html Help Builder](https://helpbuilder.west-wind.com/Images/HelpBuilderMain.png)", "updated": "2024-03-23T21:48:43Z", "galleryUrl": "https://community.chocolatey.org/packages/WestwindHtmlHelpBuilder/5.38.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/WestwindHtmlHelpBuilder/5.38.0", "licenseUrl": "https://helpbuilder.west-wind.com/pricing.aspx#License", "packageName": "WestwindHtmlHelpBuilder", "displayName": "West Wind Html Help Builder", "summary": "Documentation tool that creates HTML output that can be easily published on the Web or via CHM, PDF or MS Word files.", "version": "5.38.0", "icon": "https://helpbuilder.west-wind.com/images/wwhelp_128.png", "author": "Rick Strahl, West Wind Technologies", "downloadCount": 16090, "tags": ["documentation", "reference", "markdown", "html-help", "faq", "chm", "pdf", "msword", "web-site", "html-generator", "markdown-editor", ".net", "dotnet", "foxpro", "sql-server", "admin"]}