{"description": "West Wind WebSurge is an easy to use Http REST Client and Load Testing tool. It makes it easy to capture, import or manually create a series of Http requests, and test them either interactively individually for service discovery and logic testing, or test under heavy load with many simultaneous sessions for stress testing. \n        \nA key feature of WebSurge is that it's easy to use and understand without complex setup and configuration. You can be productive checking URLs or runing load tests in minutes. The goal is to make this process quick and easy, so that you use it frequently to check your sites for performance and stability. You can easily share sessions files and even export and import easily from other tools like PostMan or Fiddler. Or import sessions from OpenAPI/Swagger, or capture Web browser sessions interactively.\n\nLoad test sessions run a session of Http requests under heavy load and report easy to understand results back via a summary screen. You can export the result report, or the raw test data. Finally a command line tool is available to automate load tests from the terminal and capture results for automation or tests.\n\nWebSurge is also an alternative to the popular PostMan tool, with a more interactive and streamlined user interface, and load testing capability out of the box.\n\n![West Wind WebSurge](https://websurge.west-wind.com/images/MainScreenshot.png)", "updated": "2024-03-24T00:33:30Z", "galleryUrl": "https://community.chocolatey.org/packages/WestwindWebSurge/3.0.0.11", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/WestwindWebSurge/3.0.0.11", "licenseUrl": "https://websurge.west-wind.com/purchase", "packageName": "WestwindWebSurge", "displayName": "West Wind WebSurge (Preview)", "summary": "WebSurge: An Http REST Client and Load Testing Tool for Windows", "version": "3.0.0.11", "icon": "https://websurge.west-wind.com/images/WebSurgeLogo128.png", "author": "Rick Strahl, West Wind Technologies", "downloadCount": 25945, "tags": ["rest-client", "http-testing", "load-testing", "rest", "postman", "curl", "stress-testing", "web-test", "http", "client", "westwind", "websurge", "admin"]}