{"description": "GNU Wget is a free software package for retrieving files using HTTP, HTTPS and FTP, the most widely-used Internet protocols. It is a non-interactive commandline tool, so it may easily be called from scripts, cron jobs, terminals without X-Windows support, etc.\n\n## Features\n\nGNU Wget has many features to make retrieving large files or mirroring entire web or FTP sites easy, including:\n\n* Can resume aborted downloads, using REST and RANGE\n* Can use filename wild cards and recursively mirror directories\n* NLS-based message files for many different languages\n* Optionally converts absolute links in downloaded documents to relative, so that downloaded documents may link to each other locally\n* Runs on most UNIX-like operating systems as well as Microsoft Windows\n* Supports HTTP proxies\n* Supports HTTP cookies\n* Supports persistent HTTP connections\n* Unattended / background operation\n* Uses local file timestamps to determine whether documents need to be re-downloaded when mirroring\n* GNU Wget is distributed under the GNU General Public License.\n\n## Notes\n\n**If the package is out of date please check [Version History](#versionhistory) for the latest submitted version. If you have a question, please ask it in [Chocolatey Community Package Discussions](https://github.com/chocolatey-community/chocolatey-packages/discussions) or raise an issue on the [Chocolatey Community Packages Repository](https://github.com/chocolatey-community/chocolatey-packages/issues) if you have problems with the package. Disqus comments will generally not be responded to.**", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/Wget/1.21.4", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/Wget/1.21.4", "licenseUrl": "https://www.gnu.org/copyleft/gpl.html", "packageName": "Wget", "displayName": "GNU Wget", "summary": "A command-line utility for retrieving files using HTTP, HTTPS and FTP protocols.", "version": "1.21.4", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-packages@46ec3b4a65a31782b27c114c92155810d2f781a0/icons/wget.png", "author": "Giuseppe Scrivano, Hrvoje Nikšić, Jernej Simončič", "downloadCount": 5643515, "tags": ["wget", "download", "http", "https", "ftp", "cli", "foss", "cross-platform"]}