{"description": "WhiteboxTools is an advanced geospatial software package and a data analysis platform developed at the University of Guelph’s Geomorphometry and Hydrogeomatics Research Group (GHRG). The project began in January 2017 and quickly evolved in terms of its analytical capabilities. Some of WhiteboxTools features include:\n\n      * Contains more than 450 tools for processing various types of geospatial data\n      * Many tools operate in parallel, taking full advantage of your multi-core processor.\n      * Written in the safe and cross-platform systems programming language Rust and compiled to highly efficient native code. No virtual machine or interpreter required is needed to run WhiteboxTools.\n      * Small stand-alone application with no external dependencies, making installation as easy as downloading the small zip file and decompressing it.\n      * Simple yet powerful Python scripting interface that allows users to develop custom scripted workflows\n      * Embed WhiteboxTools functions into hetergeneous scripting environments along with ArcPy, GDAL, and other geoprocessing libraries.\n      * Serves as an analytical back-end for other GIS, remote sensing, and geospatial software (e.g. the QGIS Whitebox for Processing plugin). See more on the many front-ends developed for WhiteboxTools here.\n      * Permissive MIT open-source license allows for ready integration with other software.", "updated": "2024-03-20T06:03:33Z", "galleryUrl": "https://community.chocolatey.org/packages/whiteboxtools-open-core/2.2.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/whiteboxtools-open-core/2.2.0", "licenseUrl": "https://www.whiteboxgeo.com/geospatial-software/", "packageName": "whiteboxtools-open-core", "displayName": "WhiteboxTools Open Core (WbTOC)", "summary": "WbTOC is the foundation of the Whitebox Platform, containing over 460 open-source tools for processing and analyzing geospatial data of all kinds. It is freely available and the source code is hosted on Github. It's a true powerhouse of geospatial analysis.", "version": "2.2.0", "icon": "https://cdn.jsdelivr.net/gh/realmiketalbot/ChocolateyPackages@latest/whiteboxtools-open-core/whiteboxtools-logo.png", "author": "Whitebox Geospatial Inc.", "downloadCount": 84, "tags": ["whitebox", "tools", "open", "core", "dem", "gis", "vector", "raster", "geospatial"]}