{"description": "Generally, modern Wi-Fi networks are well protected, but there are a number of weaknesses that can compromise your Wi-Fi password; this includes vulnerabilities in encryption and brute force attacks. As a result, someone can gain unauthorised access to your Internet connection and LAN and exploit them while staying unnoticed.\n\nPerhaps, you can say: “No big deal, I have unlimited Internet traffic!”, but what about someone reading your personal emails, stealing private information or breaking the law online while using your Internet connection?\n\nHere comes our little application: it will alert you if your network is used without your knowledge. WiFi Guard is a specialised network scanner that runs through your network at set intervals and reports immediately if it has found any new, unknown or unrecognised connected devices that could possibly belong to an intruder.\n \n## Key features\n* Pings computers and other network devices and displays those alive.\n* Detects firewalled computers that do not respond to ping.\n* Scans your network at a specified interval.\n* Immediately alerts you if an unknown device is found.\n* Runs on Windows and macOS.\n* Free for Windows, only $9.99 for macOS.\n\n## Unlimited duration trial with maximum of 5 devices displayed.\n[Purchase a licence](https://www.softperfect.com/order/?wfg)", "updated": "2024-03-22T03:33:42Z", "galleryUrl": "https://community.chocolatey.org/packages/wifiguard/2.2.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wifiguard/2.2.3", "licenseUrl": "https://www.softperfect.com/products/wifiguard/", "packageName": "wifiguard", "displayName": "SoftPerfect WiFi Guard", "summary": "SoftPerfect WiFi Guard is an essential tool for everyone running a small wireless network and striving to keep it secure.", "version": "2.2.3", "icon": "https://cdn.jsdelivr.net/gh/TakataSanshiro/Chocolatey-Packages@master/automatic/wifiguard/icon.png", "author": "SoftPerfect", "downloadCount": 4381, "tags": ["admin", "wifi", "scan", "scanner", "ap", "security", "shareware"]}