{"description": "Winamp is a skinnable, multi-format media player.\n\nWinamp supports a wide variety of contemporary and specialized music file formats, including MIDI, MOD, MPEG-1 audio layers 1 and 2, AAC, M4A, FLAC, WAV, OGG Vorbis, and Windows Media Audio. It supports gapless playback for MP3 and AAC, and Replay Gain for volume leveling across tracks. In addition, Winamp can play and import music from audio CDs, optionally with CD-Text, and can also burn music to CDs. Winamp supports playback of Windows Media Video and Nullsoft Streaming Video, as well as most of the video formats supported by Windows Media Player. 5.1 Surround sound is supported where formats and decoders allow.\n\nWinamp supports many types of streaming media: Internet radio, Internet telelvision, XM Satellite Radio, AOL video, Singingfish content, podcasts, and RSS media feeds. It also has extendable support for portable media players, and users can access their media libraries anywhere via internet connections.\n\nYou can extend Winamp's functionality through the use of plug-ins, which are available on the Winamp site.\n\n## Package parameters\n\n- `/Light` - Install light version (basic 2.x-style mp3/cd player)\n\n## Notes\n\n- This is the last version of the software. It was [discontinued](http://news.softpedia.com/news/Winamp-to-Be-Discontinued-on-December-20-2013-402176.shtml) at December 2013.\n\n\n![screenshot](https://rawgit.com/chocolatey/chocolatey-coreteampackages/master/manual/winamp/screenshot.png)", "updated": "2024-03-24T00:18:33Z", "galleryUrl": "https://community.chocolatey.org/packages/winamp/5.666", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/winamp/5.666", "licenseUrl": "https://www.getwinamp.net/mirror/website/WINAMP_C/LEGAL/DISTRIBUTION.HTM", "packageName": "winamp", "displayName": "Winamp", "summary": "Winamp is a media player for Windows", "version": "5.666", "icon": "https://cdn.rawgit.com/chocolatey/chocolatey-coreteampackages/fd66d6390d7a1521a22aa1235dabff5eff38147b/icons/winamp.png", "author": "Nullsoft", "downloadCount": 27176, "tags": ["multimedia", "player", "mp3", "audio", "cross-platform", "freeware"]}