{"description": "## Windows Firewall Control - Managing Windows Firewall is now easier than ever\nProgram Overview\n\nWindows Firewall Control is a powerful tool which extends the functionality of \nWindows Firewall and provides new extra features which makes Windows Firewall \nbetter. It runs in the system tray and allows the user to control the native \nfirewall easily without having to waste time by navigating to the specific part \nof the firewall. This is the best tool to manage the native firewall from \nWindows 10, 8.1, 8, 7, Server 2012, Server 2016, Server 2019, Server 2022. \nWindows Firewall Control offers four filtering modes which can be switched\nwith just a mouse click:\n\nHigh Filtering - All outbound and inbound connections are blocked. This profile \nblocks all attempts to connect to and from your computer.\nMedium Filtering - Outbound connections that do not match a rule are blocked. \nOnly the programs that you allow can initiate outbound connections.\nLow Filtering - Outbound connections that do not match a rule are allowed. The \nuser can block the programs he doesn't want to allow initiating outbound connections.\nNo Filtering - Windows Firewall is turned off. Avoid using this setting unless \nyou have another firewall running on your computer.\n\nWindows Firewall Control doesn't do any packet filtering and does not block or \nallow any connection. This is done by Windows Firewall itself based on the \nexisting firewall rules.\nProgram Features\n\n√ Notifications of outbound blocked connections.\n√ Learning mode that automatically allows digitally signed programs.\n√ Create temporary rules which are automatically deleted when they expire or on \n    program restart.\n√ Intuitive user interface which is easy accessible through a system tray icon.\n√ Full support with standard user accounts. Elevated privileges are required \n    only at installation.\n√ Disable the ability of other programs to tamper Windows Firewall rules and state.\n√ Integrated support of creating, modifying and deleting Window Firewall rules.\n√ Multiple and easier ways of creating new rules in Windows Firewall.\n√ Lock feature which can disable the access to the settings of the program and \n    Windows Firewall.\n√ Shell integration into the right click context menu of the executable files.\n√ Automatically display invalid rules for programs that do not exist any more.\n√ Possibility to find and display duplicate firewall rules.\n√ Merge multiple similar rules or duplicate existing ones.\n√ View recently allowed and blocked connections and create new rules from the \n    Security log.\n√ Import and export of partial sets of rules.\n√ Protection to unauthorized uninstallation.\n√ Possibility to restore previous settings at uninstallation.\n√ Global hot keys are supported and various shortcut keys are available.\n√ Integrated multi language support in 29 languages.\n√ And many, many more. Just try it out.\n\n## System Requirements\n\n√ Microsoft .NET Framework version 4.5 or a newer version.\n√ Compatible with all x86 and x64 versions of Windows 10, 8.1, 8, 7, Server 2016, \nServer 2012.\n√ Windows Firewall service is required to be enabled for Windows Firewall Control to run.\n√ DNS Client service is required to be enabled for the notifications to work properly.\n\n### Package-specific issue\nIf this package isn't up-to-date for some days, [Create an issue](https://github.com/tunisiano187/Chocolatey-packages/issues/new/choose)\n\nSupport the package maintainer and [![Patreon](https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@d15c4e19c709e7148588d4523ffc6dd3cd3c7e5e/icons/patreon.png)](https://www.patreon.com/tunisiano)", "updated": "2024-03-23T22:33:38Z", "galleryUrl": "https://community.chocolatey.org/packages/windowsfirewallcontrol/6.9.9.6", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/windowsfirewallcontrol/6.9.9.6", "licenseUrl": "https://www.binisoft.org/eula", "packageName": "windowsfirewallcontrol", "displayName": "windowsfirewallcontrol (Install)", "summary": "Windows Firewall Control is a powerful tool which extends the functionality of Windows Firewall and provides new extra features which makes Windows Firewall better.", "version": "6.9.9.6", "icon": "https://cdn.jsdelivr.net/gh/tunisiano187/Chocolatey-packages@c0a1a3f3509041c77fd8542e19bad5542db174b0/icons/windowsfirewallcontrol.png", "author": "Alexandru Dicu", "downloadCount": 10808, "tags": ["windowsfirewallcontrol", "Windows", "Firewall", "Control", "WFC", "binisoft", "malwarebytes"]}