{"description": "![Screenshot of WinDV](http://windv.mourek.cz/img/null.gif)\n\nWinDV is a small and easy to use Windows application for capturing videos from DV device (camcorder) into AVI-files and for recording AVI-files into DV device via FireWire (IEEE 1394) interface. Capturing is very reliable thanks to use of large buffer queue.\tTimestamps recorded on DV tape by camcorder can be used to automatically split captured video into multiple files. During transmitting to DV, several AVI-files can be joined together to form final video recording. \nInternals: DirectShow \"filters\" are used for communication with DV devices, video-preview and for reading/writing AVI. Additional code handles memory buffering, timestamp decoding and simple user interface.\n\n###Main features\n* small and handy less than100kB one-file WinDV.exe\n* input / output - capturing from DV device to AVI files (both type-1 and type-2 supported) and recording vice versa\n* no dropped frames - memory buffering\n* automatic AVI splitting according to the timestamps on DV recordings - every video sequence can be saved into unique file\n* easy AVI joining - record multiple files joined to the DV device just using wildcards\n* preview of transmitted video in the window\n* free - you can download it and use it as you like at no cost\n\n###Requirements:\nWindows 98SE/ME/2000/XP -> Works on Windows 10! - bcurran3/PACKAGER\nDirectX 8.1+\nFireWire (IEEE 1394) controller (OHCI)\nDV camcorder (with DV-in for recording)\nor DV-videorecorder\n\n###Discontinued\nDevelopment of WinDV has been stopped. DV format is getting superceded by MPEG4 HD video, so further development of WinDV makes no sense for me.", "updated": "2024-03-04T02:03:21Z", "galleryUrl": "https://community.chocolatey.org/packages/windv/1.2.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/windv/1.2.3", "licenseUrl": "", "packageName": "windv", "displayName": "WinDV (Portable)", "summary": "WinDV - A small Windows utility for DV (FireWire digital video) input/output.", "version": "1.2.3", "icon": "http://windv.mourek.cz/img/windv.gif", "author": "Petr Mourek", "downloadCount": 960, "tags": ["windv", "dv", "digital", "video", "capture", "digitize", "firewire", "1394", "portable"]}