{"description": "Windows Admin Center is a new, locally-deployed, browser-based management tool set that lets you manage your Windows Servers with no Azure or cloud dependency. Windows Admin Center gives you full control over all aspects of your server infrastructure and is particularly useful for managing servers on private networks that are not connected to the Internet.\n\nWindows Admin Center is the modern evolution of in-box management tools, like Server Manager and MMC. It complements System Center and Operations Management Suite - it's not a replacement.\n\n### Supported operating systems\n\nYou can install Windows Admin Center on the following Windows operating systems:\nVersion \tInstallation Mode\n- Windows 10 \tLocal client\n- Windows Server Semi-Annual Channel \tGateway sever, managed server, failover cluster\n- Windows Server 2016 \tGateway sever, managed server, failover cluster\n- Windows Server 2019   Gateway sever, managed server, failover cluster\n\n### Package Specific\n#### Package Parameters\nThe following package parameters can be set:\n\n * `/Port:` - determines what port to listen on. Defaults to 6516. (You may want to use 443 on Windows Server)\n * `/Thumbprint:` - Existing certificate thumbprint. If not specified, a self-signed certificate is generated (expires after 60 days)\n * `/DisableRestartWinrm` -  If you are installing with an automation solution that would be broken by the WinRM service restarting, you can disable this by passing this parameter\n\nTo pass parameters, use `--params \"''\"` (e.g. `choco install packageID [other options] --params=\"'/ITEM:value /ITEM2:value2 /FLAG_BOOLEAN'\"`).\nTo have choco remember parameters on upgrade, be sure to set `choco feature enable -n=useRememberedArgumentsForUpgrades`.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/windows-admin-center/1.5.19713", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/windows-admin-center/1.5.19713", "licenseUrl": "https://docs.microsoft.com/en-us/windows-server/windows-server-licensing/windows-admin-center-licensing", "packageName": "windows-admin-center", "displayName": "Windows Admin Center (2311)", "summary": "Windows Admin Center is a locally deployed, browser-based app for managing servers, clusters, hyper-converged infrastructure, and Windows 10 PCs", "version": "1.5.19713", "icon": "http://raw.githubusercontent.com/flcdrg/au-packages/master/windows-admin-center/icons/windows-admin-center.png", "author": "Microsoft Corporation", "downloadCount": 66633, "tags": ["honolulu", "windows"]}