{"description": "![Screenshot of Windows Defender Browser Protection for Chrome](https://lh3.googleusercontent.com/isYGcP3WRpwRuvMGI4-2-Aa7rZhNyTlrXj57eeImve8nIwIJWQO36ffEtYQhcbJikPYQkZnJbQ=w640-h400-e365)\t\n\t\n##Protect yourself against online threats, like phishing and malicious websites, with real-time protection from Microsoft.\n\nThe Windows Defender Browser Protection extension helps protect you against online threats, such as links in phishing emails and websites designed to trick you into downloading and installing malicious software that can harm your computer. \n\nIf you click a malicious link in an email or navigate to a site designed to trick you into disclosing financial, personal or other sensitive information, or a website that hosts malware, Windows Defender Browser Protection will check it against a constantly updated list of malicious URLs known to Microsoft. \n\nIf the malicious link matches one on the list, Windows Defender Browser Protection will show a red warning screen letting you know that the web page you are about to visit is known to be harmful, giving you a clear path back to safety with one click.\t\n\t\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/windows-defender-browser-protection-chrome/readme.md)**", "updated": "2024-03-23T17:33:37Z", "galleryUrl": "https://community.chocolatey.org/packages/windows-defender-browser-protection-chrome/1.62", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/windows-defender-browser-protection-chrome/1.62", "licenseUrl": "", "packageName": "windows-defender-browser-protection-chrome", "displayName": "Windows Defender Browser Protection for Chrome", "summary": "Windows Defender Browser Protection - Protect yourself against online threats, like phishing and malicious websites, with real-time protection from Microsoft.", "version": "1.62", "icon": "https://browserprotection.microsoft.com/img/WindowsDefenderLogo_White.png", "author": "Microsoft", "downloadCount": 8049, "tags": ["microsoft", "defender", "malware", "protection", "chrome", "extension"]}