{"description": "___\n[choco://winflector](choco://winflector)\nTo use choco:// protocol URLs, install [(unofficial) choco:// Protocol support ](https://chocolatey.org/packages/choco-protocol-support)\n___\n\n![Screenshot of Winflector](http://www.winflector.com/uploads/images/Gallery/Sv_add_user_EN/3580/sv_003.png)\n\nWinflector is innovative, secure and easy to use software, which allows effective sharing and remote execution of choosen applications through local and wide area networks. Its basic features include:\n\n* low costs: applications executed remotely over a network\n* works over LAN, Internet, as well as dedicated connection, also at low throughput\n* application is executed on a main server, while a remote user accesses only its windows\n* the application server administrator decides which program(s) to share\n\nWinflector allows sharing of any Windows application, which can be executed by remote users without any modification of the application code, preserving its original appearance and functionality.\n\nThanks to Winflector server, the applications are executed only on the central machine, while the remote users, using a lightweight client supporting Linux, Windows, Android and HTML5 browser access them the same way they would do locally. Winflector does not use Remote Desktop Services (earlier Windows Terminal Services), RemoteApp or Citrix products (XenApp).\n\nWinflector Console is a special Winflector version designed exclusively for 32-bit text applications executed in the Windows console environment. The Winflector Console is the optimal, simple and low-cost solution for those who plan on using console applications only.\n\nRemote desktop - is it the best solution?\n\nA business application user needs to access applications and their functionality. In this case it is preferable to use a Winflector server, which enables the Windows application to be accessed as if they were locally displayed on the user's desktop. This way, a middle layer of remote desktop is eliminated, along with its increased bandwith usage and heavy interface, which makes it harder to use the actual application and increases the server load. Another advantage of this solution is limiting user access only to application functionality, hence increasing the server security.\nRemote desktop is a good solution when one wishes to remotely administrate the computer. In this case, it is efficient to use VNC software or single-user Terminal Services, which is included in the operating system.\n\nThis is a fully functional version of Winflector software for two concurrent workstations for free.\n\n[Winflector Client](https://chocolatey.org/packages/winflector-client)\n\n**[PACKAGE NOTES](https://github.com/bcurran3/ChocolateyPackages/blob/master/winflector/readme.md)**\n\n___\n**Click here to [Patreon-ize](https://www.patreon.com/bcurran3) the package maintainer.**\n___", "updated": "2024-03-19T13:18:31Z", "galleryUrl": "https://community.chocolatey.org/packages/winflector/3.9.6.5", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/winflector/3.9.6.5", "licenseUrl": "http://www.winflector.com/english/free-license.html", "packageName": "winflector", "displayName": "Winflector (Install)", "summary": "otc server for remote application execution", "version": "3.9.6.5", "icon": "http://www.winflector.com/img/winflector.png", "author": "OTC S.A.", "downloadCount": 44008, "tags": ["winflector", "remote", "application", "execution", "server", "rdp"]}