{"description": "## Features\n\n### Overview\n- Context sensitive interface\n- Configurable interface and hotkeys\n- Wide range of Selection and Mesh tools\n- Exports to common 3d file formats like .obj\n- UV mapper, Vertex Colors, Materials, and Lights\n\n### Intuitive Interface\nWings has a simple interface. Right-click menus give you easy access to common commands. These menus are context sensitive, so depending on your selection, a different menu pops up.\n\nHovering over any menu item will display a brief description of the command in the Info Line at the bottom of the main window.\n\nVariations to commands are listed in the Info Line. Many commands let you pick an extra vector or point that the command should operate upon. Command variations are initiated by selecting the command using the different mouse buttons. In the Info Line, the mouse buttons are abbreviated to L, M, and R.\n\n### Tools\nWings 3D has a comprehensive set of mesh modeling and selection tools.\n\n- Standard tools such as Move, Scale, Rotate, Extrude, Bevel, Bridge, Cut, and Weld.\n- Advanced tools including: Sweep, Plane Cut, Circularise, Intersect, Bend, Shear, and Inset.\n- Magnets and Magnet Masking\n- Virtual Mirror for symmetrical modeling\n- Tweak and Sculpt\n- Edge Loop and Edge Ring selection and navigation tools\n- Smooth Preview\n- Much, MUCH more!\n\n### AutoUV\nAdd textures to your model using the AutoUV facility. AutoUV helps you cut and unfold an image of your model’s surface, which you can then export for painting and texturing.\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/wings3d/screenshot.png)", "updated": "2024-03-20T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/wings3d/2.2.6.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wings3d/2.2.6.1", "licenseUrl": "https://sourceforge.net/p/wings/code/ci/master/tree/license.terms?format=raw", "packageName": "wings3d", "displayName": "Wings 3D", "summary": "Wings 3D is an advanced subdivision modeler that is both powerful and easy to use. Originally inspired by Nendo and Mirai from Izware, Wings 3D has been developed since 2001, when Björn Gustavsson (bjorng) and Dan Gudmundsson (dgud) first started the project. Richard Jones (optigon) maintained Wings and coded many new features between 2006 and 2011. Wings 3D is currently maintained by Dan and Richard with the help of the great community. Wings 3D offers a wide range of modeling tools, a customizable interface, support for lights and materials, and a built-in AutoUV mapping facility. There is no support in Wings for animation.", "version": "2.2.6.1", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/wings3d/wings3d.png", "author": "Wings3D Team", "downloadCount": 2989, "tags": ["wings3d", "modeler", "model", "modeling", "wings", "3D", "UV"]}