{"description": "This software has been in development for many years and the author (G0CUZ) provides this software FREE to use by all Radio Amateurs and SWL's in true 'Ham Spirit', as such no warranty is implied or given as to it's suitability or reliability.\n\nAlthough Winlog32 is general purpose logging software, it has a definite slant on DX'ing on both HF and VHF with comprehensive tracking of various awards programs like DXCC, IOTA, WAZ etc. and includes all the features you would expect from good quality logging and DXing software and more.....\n\n## Features\n\n**Winlog32 logging software for all Windows platforms.**\n\nDo you want to know if Winlog32 will suit your purposes? - please read on.....\n\n- FREE, unrestricted use with no limitations of any kind\n- Works on all Windows platforms, 95, 98, ME, 2000, XP, Vista, W7, W8, W8.1, W10\n- Includes all regular logging, DXCluster, rig control features\n- Dedicated web-site, info, download plus well supported Forum\n- Regular updates\n- Well established, respected and has been in development for over 20 years\n- Suitable for general logging purposes, with emphasis on award chasing and HF-VHF DXing\n- Used world-wide for many years\n- Simple and intuitive operation and uncluttered layout\n- Works within single container window\n- Logs\n\t- Versatile and secure log database system using established MS Access Jet 3.5\n\t- Multiple logs in each log database\n\t- Multiple log databases\n\t- Unlimited number of log entries\n\t- Remote logging capable\n- Separate award tracking for each individual log database\n- Real-time log input\n- Last entered QSOs always displayed\n- Auto-date and time function\n- Auto-search and display previous QSOs\n- Automatic database updates and checks made during QSO input\n\n![screenshot](https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/winlog32/screenshot.png)", "updated": "2024-03-22T01:18:24Z", "galleryUrl": "https://community.chocolatey.org/packages/winlog32/7.3.46", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/winlog32/7.3.46", "licenseUrl": "", "packageName": "winlog32", "displayName": "winlog32", "summary": "Winlog32 is Amateur Radio Logging software designed and working on all Microsoft Windows platforms, e.g. 95/98/ME/NT4/2000/XP/Vista/W7/W8/W10.", "version": "7.3.46", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/winlog32/winlog32.png", "author": "Colin Morris,  G0CUZ", "downloadCount": 2515, "tags": ["winlog32", "log", "HAM", "radio", "amateur"]}