{"description": "WinMerge is a Windows tool for visual difference display and merging, for both files and directories. It is highly useful for determining what has changed between file versions, and then merging those changes. WinMerge has Unicode support, Flexible syntax coloring editor, Visual SourceSafe integration, and Windows Shell integration. Regexp filtering for filenames and lines. Side-by-side line difference and highlights differences inside lines. A file map shows the overall file differences in a location pane. The user interface is translated into several languages.\n\n## Features\n\n- Visual differencing and merging of text files\n- Flexible editor with syntax highlighting, line numbers and word-wrap\n- Highlights differences inside lines\n- Difference pane shows current difference in two vertical panes\n- Location pane shows map of files compared\n- Moved lines detection\n- Compare folders in one level or recursive\n- Can show folder compare results flat or in a tree-style view\n- Regular Expression based file filters allow excluding and including items\n- Compares binary files in folder compare as well as text files\n- Shell Integration (supports 64-bit Windows versions)\n- Archive file support using 7-Zip\n- Fast compare using file sizes and dates\n- Creates patch files (Normal-, Context- and Unified formats)\n\n**NOTE**: This package is automatically updated. If it is out of date and there is no newer package submitted, please use the `Contact Maintainers` functionality to alert me.", "updated": "2024-03-23T21:03:47Z", "galleryUrl": "https://community.chocolatey.org/packages/winmerge.portable/2.16.38", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/winmerge.portable/2.16.38", "licenseUrl": "https://github.com/WinMerge/winmerge/blob/master/LICENSE.md", "packageName": "winmerge.portable", "displayName": "WinMerge (Portable)", "summary": "WinMerge is a Windows tool for visual difference display and merging, for both files and directories.", "version": "2.16.38", "icon": "https://cdn.jsdelivr.net/gh/mikeee/ChocoPackages/icons/winmerge.png", "author": "Dean Grimm", "downloadCount": 4803, "tags": ["winmerge", "win", "merge", "diff", "file", "folder", "changes", "comparison"]}