{"description": "WinMD is a driver allowing Windows to access MD RAID devices - software RAID volumes created by mdadm on Linux. Bear in mind that you will still need a filesystem driver: see, for instance, WinBtrfs and Ext2fsd.\n\nEverything here is released under the GNU Lesser General Public Licence (LGPL); see the file LICENCE for more info. You are encouraged to play about with the source code as you will, and I'd appreciate a note (mark@harmstone.com) if you come up with anything nifty.\n\nFeatures\nRAID 0\nRAID 1\nRAID 4\nRAID 5\nRAID 6\nRAID 10 (near, far, offset)\nLinear\nRecognizes version 1 superblocks (1.0, 1.1, 1.2)\nNested sets\nTodo\nwhole-disk RAID (i.e. recognizing partitions on MD device)\nreshaping\nrebuilding\nchecking\ndegraded mounts\nadding and removing devices\ncreating new sets from Windows\nRAID4/5/6 journal\nwrite-intent bitmaps\nversion 0.9 superblocks\nInstallation\nTo install the driver, download and extract the latest release, right-click winmd.inf, and choose Install. The driver is signed, so should work out of the box on modern versions of Windows.\n\nFor the very latest versions of Windows 10, Microsoft introduced more onerous requirements for signing, which are only available to corporations and not individuals. If this affects you (i.e. you get a signing error when trying to install the driver), try disabling Secure Boot in your BIOS settings.\n\nUninstalling\nFrom an elevated command prompt, run:\n\nRUNDLL32.EXE SETUPAPI.DLL,InstallHinfSection DefaultUninstall 132 winmd.inf\n\nYou will probably need to give the full path to winmd.inf. Next time you reboot, Windows will remove the driver from your system.\n\nYou can also disable it by opening regedit and setting the value of HKLM\\SYSTEM\\CurrentControlSet\\services\\winmd\\Start to 4.", "updated": "2024-03-22T22:33:38Z", "galleryUrl": "https://community.chocolatey.org/packages/winmd/0.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/winmd/0.1", "licenseUrl": "https://github.com/maharmstone/winmd/blob/master/LICENCE", "packageName": "winmd", "displayName": "WinMD", "summary": "WinMD is a driver allowing Windows to access MD RAID devices", "version": "0.1", "icon": "", "author": "Mark Harmstone", "downloadCount": 1369, "tags": ["winmd", "driver", "MD", "raid"]}