{"description": "# Windows security baselines\n\n**Applies to**\n-   Windows Server 2016+\n-   Windows 10\n\n### Package Specific\n#### Package Parameters\nThe following package parameters can be set:\n\n * `/OSType:workstation\\server` - Default values is server \n\n#### Package Uninstallation\n\n * Package LGPO settings cannot be uninsalled programticall once installed. This need to be done manually!\n\n## Using security baselines in your organization \n\nMicrosoft is dedicated to providing its customers with secure operating systems, such as Windows 10 and Windows Server, and secure apps, such as Microsoft Edge. In addition to the security assurance of its products, Microsoft also enables you to have fine control over your environments by providing various configuration capabilities. \n\nEven though Windows and Windows Server are designed to be secure out-of-the-box, many organizations still want more granular control over their security configurations. To navigate the large number of controls, organizations need guidance on configuring various security features. Microsoft provides this guidance in the form of security baselines.\n\nWe recommend that you implement an industry-standard configuration that is broadly known and well-tested, such as Microsoft security baselines, as opposed to creating a baseline yourself. This helps increase flexibility and reduce costs. \n\nHere is a good blog about [Sticking with Well-Known and Proven Solutions](https://blogs.technet.microsoft.com/fdcc/2010/10/06/sticking-with-well-known-and-proven-solutions/).\n\n## What are security baselines? \n\nEvery organization faces security threats. However, the types of security threats that are of most concern to one organization can be completely different from another organization. For example, an e-commerce company may focus on protecting its Internet-facing web apps, while a hospital may focus on protecting confidential patient information. The one thing that all organizations have in common is a need to keep their apps and devices secure. These devices must be compliant with the security standards (or security baselines) defined by the organization. \n\nA security baseline is a group of Microsoft-recommended configuration settings that explains their security impact. These settings are based on feedback from Microsoft security engineering teams, product groups, partners, and customers. \n\n## Why are security baselines needed? \n\nSecurity baselines are an essential benefit to customers because they bring together expert knowledge from Microsoft, partners, and customers. \n\nFor example, there are over 3,000 Group Policy settings for Windows 10, which does not include over 1,800 Internet Explorer 11 settings. Of these 4,800 settings, only some are security-related. Although Microsoft provides extensive guidance on different security features, exploring each one can take a long time. You would have to determine the security impact of each setting on your own. Then, you would still need to determine  the appropriate value for each setting. \n\nIn modern organizations, the security threat landscape is constantly evolving, and IT pros and policy-makers must keep up with security threats and make required changes to Windows security settings to help mitigate these threats. To enable faster deployments and make managing Windows easier, Microsoft provides customers with security baselines that are available in consumable formats, such as Group Policy Objects backups.", "updated": "2024-03-20T15:03:27Z", "galleryUrl": "https://community.chocolatey.org/packages/WinSecurityBaseline/19.03.02", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/WinSecurityBaseline/19.03.02", "licenseUrl": "https://github.com/MicrosoftDocs/windows-itpro-docs/blob/public/LICENSE", "packageName": "WinSecurityBaseline", "displayName": "WinSecurityBaseline", "summary": "A security baseline is a group of Microsoft-recommended configuration settings that explains their security impact. These settings are based on feedback from Microsoft security engineering teams, product groups, partners, and customers.", "version": "19.03.02", "icon": "https://rawcdn.githack.com/devnomadic/Chocolatey-WinSecurityBaseline/6c9feb19bd88c5016b10b82947c97bfc4ab8f1de/MS_SecurityIntelligence_Icon.png", "author": "Microsoft", "downloadCount": 72364, "tags": ["Windows", "Security", "Baseline", "1903"]}