{"description": "WireGuard® is an extremely simple yet fast and modern VPN that utilizes state-of-the-art cryptography. It aims to be faster, simpler, leaner, and more useful than IPsec, while avoiding the massive headache. It intends to be considerably more performant than OpenVPN. WireGuard is designed as a general purpose VPN for running on embedded interfaces and super computers alike, fit for many different circumstances. Initially released for the Linux kernel, it is now cross-platform (Windows, macOS, BSD, iOS, Android) and widely deployable. It is currently under heavy development, but already it might be regarded as the most secure, easiest to use, and simplest VPN solution in the industry.\n\n### Simple & Easy-to-use\nWireGuard aims to be as easy to configure and deploy as SSH. A VPN connection is made simply by exchanging very simple public keys – exactly like exchanging SSH keys – and all the rest is transparently handled by WireGuard. It is even capable of roaming between IP addresses, just like Mosh. There is no need to manage connections, be concerned about state, manage daemons, or worry about what's under the hood. WireGuard presents an extremely basic yet powerful interface.\n### Cryptographically Sound\nWireGuard uses state-of-the-art cryptography, like the Noise protocol framework, Curve25519, ChaCha20, Poly1305, BLAKE2, SipHash24, HKDF, and secure trusted constructions. It makes conservative and reasonable choices and has been reviewed by cryptographers.\n### Minimal Attack Surface\nWireGuard has been designed with ease-of-implementation and simplicity in mind. It is meant to be easily implemented in very few lines of code, and easily auditable for security vulnerabilities. Compared to behemoths like Swan/IPsec or OpenVPN/OpenSSL, in which auditing the gigantic codebases is an overwhelming task even for large teams of security experts, WireGuard is meant to be comprehensively reviewable by single individuals.\n### High Performance\nA combination of extremely high-speed cryptographic primitives and the fact that WireGuard lives inside the Linux kernel means that secure networking can be very high-speed. It is suitable for both small embedded devices like smartphones and fully loaded backbone routers.\n### Well Defined & Thoroughly Considered\nWireGuard is the result of a lengthy and thoroughly considered academic process, resulting in the technical whitepaper, an academic research paper which clearly defines the protocol and the intense considerations that went into each decision.", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/wireguard/0.5.3", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wireguard/0.5.3", "licenseUrl": "https://git.zx2c4.com/WireGuard/about/COPYING", "packageName": "wireguard", "displayName": "WireGuard", "summary": "Fast, modern, secure VPN Tunnel.", "version": "0.5.3", "icon": "https://cdn.jsdelivr.net/gh/chtof/chocolatey-packages/automatic/wireguard/wireguard.png", "author": "WireGuard Team", "downloadCount": 355670, "tags": ["wireguard", "secure", "vpn", "tunnel", "cryptography"]}