{"description": "Wiimms ISO Tools is a set of command line tools to manipulate Wii and GameCube ISO images and WBFS containers. The toolset consists of the following tools:\n\n* wit (Wiimms ISO Tool):\n\n  This is the main ISO manipulation tool : It can list, analyze, verify, convert, split, join, patch, mix, extract, compose, rename and compare Wii and GameCube images. It also can create and dump different other Wii file formats.\n* wwt (Wiimms WBFS Tool):\n\n  This is the main WBFS manipulation tool (WBFS manager) : It can create, check, repair, verify and clone WBFS files and partitions. It can list, add, extract, remove, rename and recover ISO images as part of a WBFS.\n* wdf (Wiimms WDF Tool):\n\n  wdf is a support tool for WDF, WIA, CISO and GCZ images. It converts (packs and unpacks), compares and dumps WDF and CISO images. Additionally it dumps WIA and GCT image and unpacks WIA images. The default command depends on the program file name (see command descriptions). Usual names are wdf, unwdf, wdf-cat, wdf-cmp and wdf-dump (with or without minus signs). »wdf +CAT« replaces the old tool wdf-cat and »wdf +DUMP« the old tool wdf-dump.  \n* wfuse (Wiimms FUSE Tool):\n\n  Mount a Wii or GameCube image or a WBFS file or partition to a mount point using FUSE (Filesystem in USErspace). Use 'wfuse --umount mountdir' for unmounting.", "updated": "2024-03-18T01:33:27Z", "galleryUrl": "https://community.chocolatey.org/packages/wit/3.04.8427", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wit/3.04.8427", "licenseUrl": "https://www.gnu.org/licenses/old-licenses/gpl-2.0.html", "packageName": "wit", "displayName": "Wiimms ISO Tools (Install)", "summary": "Wiimms ISO Tools is a set of command line tools to manipulate Wii and GameCube ISO images and WBFS containers. The toolset consists of the following tools: wit (Wiimms ISO Tool), wwt (Wiimms WBFS Tool), wdf (Wiimms WDF Tool), wfuse (Wiimms FUSE Tool)", "version": "3.04.8427", "icon": "http://cdn.rawgit.com/Lami-Lemmy/choco/master/wit/wit-icon-1.png", "author": "Dirk Clemens", "downloadCount": 1588, "tags": ["wit", "wii"]}