{"description": "WizTree is a very high speed disk space analyser utility for Windows. It scans your hard drive and shows you which files and folders are using the most disk space. Your entire hard drive's file system is displayed visually, making it very easy to locate large files and folders. Use the information WizTree provides to quickly locate and remove \"space hogs\" from your hard drive.\n\n#### Features\n* Disk Space Analysis:  Quickly identify what's using up the space on your hard drive and optionally delete files and folders to free up space.\n* Extremely Fast!:  WizTree reads the Master File Table (MFT) directly from NTFS formatted drives (similar to the way Everything Search Engine works)\n* Multiple File Systems:  BID can scan all hard drive types supported by Windows (NTFS, FAT, FAT32, network, etc).\n* Visual Treemap:  The visual treemap displays all files and folders visually based on their size. This allows you to spot large files and large collections of smaller files at a glance.\n* Find Largest Files:  The \"File View\" lists every individual file and folder on your hard drive in order of size.\n* File Name Search:  Quickly locate files by name or type using the file view search filter. Wildcard searches also supported (e.g. *.mp3)\n* Export File and MFT Data:  All or selected file information can be exported to CSV (comma separated values) file or copied to the clipboard. MFT files can be extracted and dumped to a file.\n* Import File and MFT Data:  Exported CSV and dumped MFT files can be imported back into WizTree for viewing. Great for tracking file system changes over time.\n* Command Line Support:  Exports of CSV and MFT files can be done via command line parameters. Great for automated auditing of hard drives.\n\nWizTree is FREE for personal use! However, if you find WizTree useful or are using WizTree in your business and would like to help to support further development, [please make a donation](https://wiztreefree.com/donate).", "updated": "2024-03-24T01:03:28Z", "galleryUrl": "https://community.chocolatey.org/packages/wiztree/4.19.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wiztree/4.19.0", "licenseUrl": "https://github.com/teknowledgist/Chocolatey-packages/blob/master/automatic/wiztree/tools/LICENSE.txt", "packageName": "wiztree", "displayName": "WizTree", "summary": "Find the files and folders using the most space on your hard drive - QUICKLY!", "version": "4.19.0", "icon": "https://cdn.jsdelivr.net/gh/teknowledgist/Chocolatey-packages@2b0f9ae47d47b9b699977be5d6a6c98f0f910180/Icons/wiztree_icon.png", "author": "Antibody Software", "downloadCount": 835004, "tags": ["wiztree", "diskspace", "treemap", "treesize", "windirstat", "embedded", "donationware"]}