{"description": "![Screenshots of WOT for Chrome](https://youtu.be/KtwamDprgWM)\n\t\nCheck out any website for reputation and safety information based on users’ experience. The official Web of Trust Chrome Extension.\n★★★★★ “Your new favorite add-on” - PCMag.com \n\nJoin millions of people in the WOT community to protect yourself from online threats that only humans can detect. Stay protected while shopping and surfing with this must-have addition to any antivirus solution (even if you don’t use one)! \n\n***How it Works***\n\n*  WOT protects you while you browse, warning you when you visit dangerous sites, scams, malware, rogue web stores, dangerous links, and more \n\n* Reputation icons are displayed next to search results, social media, email, and other popular sites to help you make informed decisions \nRed indicates potential danger\nYellow tells you to be careful\nGreen means it’s a safe website\n\n*  Website reputations are calculated by combining advanced algorithms with millions of user reviews\t\n\n***Features***\n\n*  Reputation Icons\nA small icon on your browser displays each site's rating and reputation \n\n*  Warning Screen (optional)\nGet a warning popup when you land on a site with a poor reputation, giving you the option to proceed or go back to safety\n\n*  Check any site before visiting\nUse WOT scorecards to check reputation and reviews for any site before you visit. Find the site safety checker at https://mywot.com/ \n\n*  Real-time Protection\nWOT has 2 modes: Real-time Protection and Manual Mode. Real-time Protection actively notifies you of online threats\n\n*  Site Reviews\nWhen visiting a site, users can give a rating and review based on their personal experiences\n\n####PACKAGING NOTE: This installs no software. It installs a registry key for the extension that Chrome will see and then ask you for permission to enable the extension if you are in Chrome or on the next run. Chrome will install the latest version of the extension. The mentioned version is the version at time of packaging, you can ignore it. Chrome will handle updates to the extension.", "updated": "2024-03-15T09:33:48Z", "galleryUrl": "https://community.chocolatey.org/packages/wot-chrome/3.2.1", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wot-chrome/3.2.1", "licenseUrl": "https://www.mywot.com/en/terms", "packageName": "wot-chrome", "displayName": "Web of Trust for Chrome", "summary": "The official Web of Trust Chrome Extension.", "version": "3.2.1", "icon": "https://lh6.googleusercontent.com/PVRWWt3pAFvBu-88w-tfP80XUtpD7xlmzm_FfPSDWxu87qDF7gJY-a62-U_E_L-69TlbO-Gq=s26-h26-e365-rw", "author": "bcurran3", "downloadCount": 1214, "tags": ["wot", "web", "of", "trust", "chrome", "extension"]}