{"description": "WPS Office Free the perfect free office software. Your dream solution for a low-budget, no-commitment, free productivity office suite.\nThe smallest size office suite consisting of Writer, Presentation, and Spreadsheets, plus PDF tools to fulfill all of your document needs.\nIncludes a brand new Docer Templates page.\nAvailable in English, French, German, Spanish, Portuguese, Polish and Russian.\n\n## Features\n\n* **WPS Cloud:**\nA professional office file cloud storage service with 1G Free Space, which can be used on PC, mobile and tablet.\nWith only one click, it can share your documents by links. In such way, documents can be viewed and edited anywhere and anytime.\n* **Drag-and-drop Tool:**\nWPS Office's innovative Paragraph Layout feature is a drag-and-drop tool that allows you to adjust each paragraph naturally.\nSimply by moving your mouse, you can change the location, spacing, and indentation of a paragraph.\n* **Free Templates:**\nWPS Office offers a large number of free templates to help you create word documents, presentations, and spreadsheets to save you time.\nQuickly select the desired templates from the Docer library to create your documents with ease.\n* **Section Navigation:**\nThe Section Navigation tool makes it a piece of cake to jump between and edit sections.\nQuickly access Cover Pages, Content Pages, and your Header and Footer, or Split Sections and Delete Sections.\n* **Multiple Document Tabs:**\nAvoid the hassle caused by switching between multiple document windows.\nThe tab bar that appears above the editable area allows you to switch between documents by Ctrl + Tab.\nThis makes your document editing as easy and natural as web browsing.\n* **MultiLanguage:**\nSupports 12 languages and All Office File Formats.\n* **New Feature:**\nWe support read and write PDF files!\n\n## Notes\n- Our latest version is already compatible with GDPR, users can revoke the collection of personal information at any time.", "updated": "2024-03-24T00:03:38Z", "galleryUrl": "https://community.chocolatey.org/packages/wps-office-free/11.2.0.10223", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wps-office-free/11.2.0.10223", "licenseUrl": "https://www.wps.com/eula", "packageName": "wps-office-free", "displayName": "WPS Office Free", "summary": "WPS Office Free is a free office productivity suite which is smaller and faster than most other office suites.", "version": "11.2.0.10223", "icon": "https://cdn.jsdelivr.net/gh/chocolatey-community/chocolatey-coreteampackages@c4b46cad1e6a8071b53bb3b797940cabae7f4152/icons/wps-office-free.png", "author": "Kingsoft Software", "downloadCount": 180656, "tags": ["kingsoft", "wps", "office", "pdf", "reader", "admin", "freeware", "trial", "multilanguage", "MUI", "cloud"]}