{"description": "wxMacMolPlt is an open-source, cross-platform (Mac OS X, Linux and Windows) gui for preparing, submitting and visualizing input and output for the GAMESS quantum chemistry package. \n    #### Features\n* A modern graphics program for plotting 3-D molecular structures and normal modes (vibrations). \n* Reads a variety of file formats including any GAMESS input, log or IRC file, xMol XYZ files, MolDen format files and Chemical Markup Language (CML) files. Also some PDB file support and MDL MolFile support is included.\n* Fast (multi-threaded) on the fly computation of orbitals, densities and molecular electrostatic potentials for display as 2D contour maps or 3D isosurfaces!\n    * 2D Contour maps computed live with rotations or animations!\n    * Compute orbitals across an animation.\n    * Molecular Electrostatic Potentials available either alone or color mapped to a total electron density isosurface.\n    * Ability to create density difference maps, or abitrary combinations of densities. \n* Molecular point group symmetry is supported.\n* You may also paste GAMESS and Gaussian-92 style cartesian coordinates directly into the program.\n* Animation of Normal Modes.\n* Animation of IRC's, and DRC's including orbitals.\n* Simple Energy Plots (including geometrical parameters).\n* Simple frequency line graph of frequency versus infrared or Raman intensity.\n* Append multiple GAMESS files together to create a single animation.\n* Build or modify molecules using the graphical molecule builder.\n* Build molecules from scratch using cartesian or internal coordinates\n* GAMESS input file (.inp) builder", "updated": "2024-03-18T23:03:58Z", "galleryUrl": "https://community.chocolatey.org/packages/wxmacmolplt/7.7", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/wxmacmolplt/7.7", "licenseUrl": "https://raw.githubusercontent.com/brettbode/wxmacmolplt/master/LICENSE", "packageName": "wxmacmolplt", "displayName": "wxMacMolPlt", "summary": "A GUI for input and output of the GAMESS quantum chemistry package.", "version": "7.7", "icon": "https://cdn.rawgit.com/teknowledgist/Chocolatey-packages/master/Icons/wxmacmolplt_icon.png", "author": "Brett Bode", "downloadCount": 969, "tags": ["wxmacmolplt", "chemistry", "GAMESS"]}