{"description": "# X-Mouse Controls\n\nMicrosoft Windows utility to manage the *active window tracking/raising* settings. This is known as *x-mouse behavior* or *focus follows mouse* on Unix and Linux systems.\n\nWorks on Windows 11, Windows 10, Windows 8, Windows 7, Windows Vista, Windows XP, Windows Server 2012, Windows Server 2008, Windows Server 2003. Might work on other versions as well.\n\n## What is x-mouse behavior?\n\nWhen multiple programs are running on a Windows operating system, the default mode of operations is that you click one window after another to give them focus for keyboard inputs. With the x-mouse settings that click is not necessary — the only thing needed is to move your cursor over the window for it to become active.\n\nThis behavior has been possible, but disabled, in different versions of Windows for years. It is usually enabled through Windows accessibility settings or a wide variety of tools and utilities, most notably Tweak UI found in Microsoft PowerToys. However, Tweak UI does not run on Windows Vista, Windows 7, Windows 8, Windows 10, Windows 11, Windows Server 2008, Windows Server 2012, and later versions, which is why I created this utility.", "updated": "2024-03-23T23:33:25Z", "galleryUrl": "https://community.chocolatey.org/packages/xmouse-controls/1.1.0.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/xmouse-controls/1.1.0.0", "licenseUrl": "https://www.gnu.org/licenses/gpl-3.0.html", "packageName": "xmouse-controls", "displayName": "xmouse-controls", "summary": "Microsoft Windows utility to manage the active window tracking/raising settings. This is known as x-mouse behavior or focus follows mouse on Unix and Linux systems.", "version": "1.1.0.0", "icon": "https://rawcdn.githack.com/joelpurra/xmouse-controls/28b8b4bba60da7590b97af242d4364655347b96d/Graphics/icon/X-Mouse Controls 02/X-Mouse Controls 02-128x128.png", "author": "Joel Purra", "downloadCount": 393, "tags": ["xmouse-controls", "windows", "xmouse", "activewindowtracking", "focusfollowsmouse"]}