{"description": "Store your unique credential on a hardware-backed security key and take it wherever you go from mobile to desktop. No more storing sensitive secrets on your mobile phone, leaving your account vulnerable to takeovers. With the Yubico Authenticator you can raise the bar for security.\n\n* The Yubico Authenticator will work with any USB or NFC-enabled YubiKeys\n\nThe Yubico Authenticator securely generates a code used to verify your identity as you are logging into various services. No connectivity needed!\n\n### Features include\n\n* Secure - Hardware-backed strong two-factor authentication with secret stored on the YubiKey, not on your phone or computer\n\n* Portable - Get the same set of codes across our other Yubico Authenticator apps for desktops as well as for all leading mobile platforms\n\n* Flexible - Support for time-based and counter-based code generation\n\n* USB or NFC usage - Insert the YubiKey into the USB port, or use the YubiKey with NFC with a mobile phone that is NFC-enabled or a desktop NFC reader to store your credential on the YubiKey\n\n* Easy Setup - QR codes available from the services you wish to protect with strong authentication\n\n* User Presence - Require a touch on the YubiKey sensor to generate new codes for sensitive accounts\n\n* Compatible - Secure all the services currently compatible with other Authenticator apps\n\n* Versatile - Support for multiple work and personal accounts\n\n**NOTE**: This is an automatically updated package. If you find it is out of date by more than a week, please contact the maintainer(s) and let them know the package is no longer updating correctly.", "updated": "2024-03-23T23:48:28Z", "galleryUrl": "https://community.chocolatey.org/packages/yubico-authenticator/6.4.0", "abuseUrl": "https://community.chocolatey.org/package/ReportAbuse/yubico-authenticator/6.4.0", "licenseUrl": "https://github.com/Yubico/yubioath-flutter/blob/main/LICENSE", "packageName": "yubico-authenticator", "displayName": "Yubico Authenticator (Install)", "summary": "The Yubico Authenticator is a tool for generating OATH event-based HOTP and time-based TOTP one-time password codes using a Yubikey.", "version": "6.4.0", "icon": "https://cdn.jsdelivr.net/gh/pauby/ChocoPackages@82318b3/icons/yubico-authenticator.png", "author": "Yubico", "downloadCount": 44421, "tags": ["yubikey", "yubico", "authenticator", "security", "authentication", "totp", "2fa", "oath", "desktop", "hotp", "admin"]}